{
  "name": "Crazy Frog Racer 2",
  "slug": "crazy-frog-racer-2",
  "year": 2007,
  "description": "Crazy Frog Racer 2 is a one- or two-player game featuring \"the most annoying thing on the planet\" and friends in a series of races and mini-games. The game also includes the two videos released by the Crazy Frog, \"Axel F\" and \"Popcorn\".\r\n\r\nThe game installs in English, French, German, Italian or Spanish at a default resolution of 800x600 but this can be changed. Its default controls are all on the keyboard but joystick and paddle are also supported.\r\n\r\nThough this is, at its heart, a basic racing game there are lots of options. All the single player options apart from Time Trials have three levels of difficulty, the options are:\r\n\r\n- Championship. There are four cups to win, The Football Cup, The Ice Cup, The City Cup, and the Beach Cup, initially The Football Cup is the only one available the last three must be unlocked by winning the previous trophy. \r\nSingle Race with twelve different courses and twelve characters available\r\n\r\n- Chase Race where the player must stay ahead of the chasing drones for as long as possible\r\n- Time Trials where the player races round the track with no opponents aiming to beat their previous best time\r\n- Mini Games, there are two of these Crazy Frog Pinball and Crazy Dance.\r\n\r\n> Crazy Frog Pinball is unlike most pinball games as there are no paddles. The frog is fired from a canon onto the play area where it careens around destroying any robots it hits. When it hits a robot, or when it runs out of momentum, it stops and a rotating compass ring appears around it, when the dial is pointing in the desired direction the player presses the Spacebar and the process repeats. There is a separate arena for each music track and each has three difficulty levels.\r\n\r\n> In Crazy Dance arrows appear rhythmically on screen and the player must hit the corresponding button on the numeric keypad 'bemani' style. Crazy dance can be performed in three levels of difficulty with any of the music tracks.\r\n\r\nThe music tracks available in these games are 'Hey Baby', 'I'm too sexy', 'Final Countdown', 'Axel F', and 'Popcorn'.\r\n\r\nIn the two-player mode the game options are:\r\n- Championship: this is the same as the single player option\r\n- Single Race: also the same as the single player option\r\n- Battle: this is the only game mode that is unique to the multiplayer game. Players have three lives and compete in any of four arenas, last one standing wins.\r\n\r\nIn all game options, apart from Time Trials and the mini-games, there are on-track bonuses to be collected for weapons, armour and defence.",
  "banner_url": "/games/banner/crazy-frog-racer-2.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-06-16T20:36:07.580903Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 37178
}