{
  "name": "Minecraft - Feed the Beast",
  "slug": "minecraft-feed-the-beast",
  "year": 2012,
  "description": "Feed the Beast, also known as FTB, originated as a custom challenge map in Minecraft that made heavy use of multiple tech mods. It played very similar to a type of map known as Sky Block, where the player is started in a void world with only a small platform, and must overcome a series of challenges. Because FTB included tech mods, it was possible to use the various custom blocks and items to keep track of the challenges and the player's progress, as well as automatically give awards after each challenge was met.\r\n\r\nThe map was then adapted to allow multiple players to compete against each other in a race to complete the objectives. This version gained large popularity after being live-streamed on Twitch.TV with Direwolf20 vs Nearbygamer, both very well known users of the mods included in the map. \r\n\r\nAs the map was released to the public, it became apparent that it was very difficult to distribute the map file, mods, and configuration settings to those interested in playing it. At some point a decision was made to combine all of the mods into an easily distributable pack, as well as create a launcher that would stream-line installation.\r\n\r\nThe map went through various iterations, including the bedrock map - known for the challenge and reward structure made of bedrock. However most players that refer to the FTB map, truly mean the pyramid map, known for its large basalt pyramid that included various rooms that listed a set of items the player had to create in order to solve each challenge. That version was then updated to a harder version, known as FTB Insanity, which took many players 50 to even over 100 hours of play time to fully complete.\r\n\r\nThe mod pack is centered around mods built on the Minecraft Forge platform. It initially focused on mods of a technical theme, such as IndustrialCraft, Buildcraft, and RedPower. However it then expanded to other genres, such as magic mods like Thaumcraft and Mystcraft. \r\n\r\nThe initial mod pack was released as a beta in November 2012. It stayed in beta status for some time because of the necessity for mod authors to update their mods to Minecraft version 1.4, where everything became server based. This process proved a long road for a few of the mods that were core to the pack. \r\n\r\nOther versions of the FTB Mod Pack were created, including a Lite version, which slimmed down the list of mods to assist new users learn the ins and outs without being overwhelmed. A Magic World version, which focused on mods of a magical nature, was also released. At the time of this writing,the full FTB Mod Pack, also known as the Ultimate FTB Pack, has not been released.",
  "banner_url": "/games/banner/minecraft-feed-the-beast.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:23.955209Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}