{
  "name": "Command & Conquer: Red Alert 3",
  "slug": "command-and-conquer-red-alert-3",
  "year": 2008,
  "description": "The desperate leadership of a doomed Soviet Union travels back in time to change history and restore the glory of Mother Russia. The time travel mission goes awry, creating an alternate timeline where technology has followed an entirely different evolution, a new superpower has been thrust on to the world stage, and World War III is raging. The Empire of the Rising Sun has risen in the East, making World War III a three-way struggle between the Soviets, the Allies, and the Empire with armies fielding wacky and wonderful weapons and technologies like Tesla coils, heavily armed War Blimps, teleportation, armored bears, intelligent dolphins, floating island fortresses, and transforming tanks.\r\n\r\n*    Star-Studded Storytelling : Command & Conquer's trademark live-action videos return in HD, with over 60 minutes of footage featuring the largest cast in the history of the Command & Conquer franchise.\r\n*    Command the Seas, Conquer the World : Experience Gameplay as for the first time in the series, waging war on the water will be every bit as important as dominating by land and air. Gain strategic advantages by controlling resources in the seas and mounting three-pronged attacks from all directions.\r\n*    Ready your Man Cannons! : Armored War Bears, and Anime-inspired psychic school girls join your favorite Red Alert units like Sonic Dolphins, Tesla Troopers, Attack Dogs, and the ever popular Tanya.\r\n*    A New Threat From the East : The deadly Empire of the Rising Sun is a technological terror, with designs influenced by a mixture of anime, science-fiction, martial arts and robot culture. The Empire's futuristic units can transform into alternate forms, and they specialize in naval warfare.",
  "banner_url": "/games/banner/command-and-conquer-red-alert-3.jpg",
  "icon_url": "/games/icon/command-and-conquer-red-alert-3.png",
  "is_public": true,
  "updated": "2019-09-11T17:31:18.685298Z",
  "steamid": 17480,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 668
}