{
  "name": "Realms of Chaos",
  "slug": "realms-of-chaos",
  "year": 1995,
  "description": "Realms of Chaos is an exciting side-scrolling platform game with an innovative mix of action, adventure, mysticism, and role-playing that's never been seen in this style of game.\r\n\r\nSet in the fantastic world of Mysteria, Realms of Chaos is the first of many adventures of Endrick and Elandra, a brother and sister duo who find themselves on a journey to save the many realms of Mysteria, from a dark, evil shadow that has engulfed their world, and has turned all of the inhabitants into fierce enemies.\r\n\r\nThe story of the darkness is revealed as you finish each of the three game chapters. Each chapter, or episode, has three unique realms. Each realm has new enemies, new graphics, new traps and new challenges - all in 26 killer levels!\r\n\r\nPlay as two different characters: A male warrior with a devastating sword attack and extra stamina, and a female sorceress with a long-range fireball attack and leap ability. Switch characters at the stroke of a key and decide which character is best to handle each challenge.  \r\n\r\nFeatures: \r\n* A World of its Own: Vibrant, realistic VGA graphics with a high-speed, 360-degree scrolling playfield, viewed at a tilted perspective.\r\n* Boss Battles: Five bosses: four incredible bosses and a final super boss!\r\n* Brilliant Bobby: MIDI music and digital sound effects by Bobby Prince, known for his award-winning work in Wolfenstein 3D, DOOM I & II, and Duke Nukem 3D.\r\n* Dare to be Dangerous: Five difficulty levels: \"Super Easy\" to \"Psycho Warrior.\" Higher levels introduces new hazards and challenges.\r\n* Save Your Game: Save and restore as you play (save anywhere) - plus convenient quick save and restore buttons\r\n* Controller Support: Partial Xbox 360 Controller support.  ",
  "banner_url": "/games/banner/realms-of-chaos.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-05-31T00:17:53.423290Z",
  "steamid": 358320,
  "gogslug": "realms_of_chaos",
  "humblestoreid": "",
  "id": 4123
}