{
  "name": "Heroes of Mana",
  "slug": "heroes-of-mana",
  "year": 2007,
  "platforms": [
    {
      "name": "Nintendo DS"
    }
  ],
  "genres": [
    {
      "name": "RPG"
    }
  ],
  "aliases": [],
  "description": "Heroes of Mana, originally released in Japan as Seiken Densetsu: Heroes of Mana,[Note 1] is a 2007 real-time strategy game for the Nintendo DS. It was developed by Brownie Brown and Square Enix and published by Square Enix. It is the ninth game of the Mana series and the fourth entry in the World of Mana subseries, following the release of Dawn of Mana three months prior. Set in a high fantasy universe, Heroes of Mana follows a young soldier, Roget, as he journeys to defend several nations from the ruthless aggression of his own country in a series of battles.\r\n\r\nWhile it contains some small role-playing elements, Heroes of Mana diverges from the prior action role-playing game titles of the series to instead be a real-time strategy game. Composed of a series of strategic battles, the player gathers resources, constructs buildings and units, and fights enemy forces to achieve objectives on fixed isometric grid maps. The Nintendo DS's second screen displays a map of the ongoing battle, and buildings and units are constructed inside of the player's airship and dropped onto the map by the flying base. Players can fight several dozen required and optional battles in the single-player game, as well as local multiplayer matches.\r\n\r\nHeroes of Mana was produced by series creator Koichi Ishii and directed by Takeo Oin. The story was written by Masato Kato, and the music was composed by Yoko Shimomura. The game was not a commercial success, selling around 180,000 copies worldwide by the end of 2007, less than contemporary Mana games. While critics generally praised the graphics, they were dismissive of the plot, mixed on the actual gameplay and sharply negative on what they saw as poor artificial intelligence and pathfinding inhibiting actual play.",
  "banner_url": "/games/banner/heroes-of-mana.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:49.434255Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}