{
  "name": "Doom II RPG",
  "slug": "doom-ii-rpg",
  "year": 2009,
  "description": "DOOM II RPG is a follow-up in the style of the Wolfenstein RPG, chronologically set before the events in DOOM RPG. Thanks to secret experiments, the various UAC Bases on Mars, the Moon, Earth and wherever else the cooperation has set foot have experienced incidents involving demons. A team of soldiers including a scientist are sent to Tycho Station on the Moon to investigate. But right at the start, the team is separated and the player is left behind alone to find his way through the station and even Hell itself in order to find and destroy the source of all the problems.\r\n\r\nAs with its predecessor, DOOM II RPG is a first-person role-playing game. The shooter's quick action has been traded in for a slowed down turn-based system where emphasis is placed on using the correct weapons or tools at the right time against the appropriate enemies since each action, be it a step forward, firing a weapon or using a health pack, takes one round. At the start of the game, the player has to choose between one of three characters, changing the stats he starts the game with. While Sarge has a high amount of strength, the scientist has a high IQ but is as agile as a bucket, making him less likely to successfully dodge incoming fire.\r\n\r\nDuring the course of the game the player earns experience points for killing enemies and subsequently levels up, increasing his stats by doing so. In addition, several mini-games are available that further increase specific skills but also give the player other advantages like a lower price at vending machines or access to a security bot that he can send out to scout the area. As well, several kinds of nano-drinks are available, allowing the character to temporarily boost his stats or make himself immune against fire (which is especially useful against the imps in the game).\r\n\r\nMost of the weaponry and enemies in the game are well-known from the previous games of the DOOM series - including the Soul Cube from DOOM 3, which the player will find in Hell near the end of the game. The most important new addition to the arsenal is the Holy Water Pistol which can be refilled at toilets and other sources of water and scare the demons for a few rounds. Holy Water can also be used to heal the character.",
  "banner_url": "/games/banner/doom-ii-rpg.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2020-04-21T14:10:53.554725Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}