{
  "name": "GS Mikami: Joreishi wa Nice Body",
  "slug": "gs-mikami-joreishi-wa-nice-body",
  "year": 1993,
  "description": "Two video games based on the manga and anime were spawned. In 1993 a video game entitled Ghost Sweeper Mikami: Joreishi wa Nice Body (ゴーストスイーパー GS美神 〜除霊師はナイスバディ〜, Gōsuto Suīpā GS Mikami 〜Joreishi wa Naisu Badi〜) was released for the Super Famicom. In 1994 GS Mikami was published by Banpresto for the PC Engine. Ghost Sweeper Mikami: Joreishi wa Nice Body is a Japan-exclusive action video game based on the manga and anime Ghost Sweeper Mikami. It was developed by Natsume and published by Banalex, which was released in 1993.\r\n\r\nGhost Sweeper Mikami: Joreishi wa Nice Body is a side-scrolling platformer where the player controls Reiko through multiple stages. Reiko is armed with a magic baton that can be used to perform several types of melee attacks. The baton can be powered up to shoot various types of projectiles, though these powerups are lost if Reiko takes any damage. It can also be used as a type of grappling hook to access certain platforms. There are also limited uses of magic attacks that hit all enemies on the screen. \r\n\r\nManga/Anime:\r\n\r\nGhost Sweeper Mikami: The Great Paradise Battle!! (Japanese: GS美神 極楽大作戦!!, Hepburn: Gōsuto Suīpā Mikami Gokuraku Daisakusen!!) is a Japanese manga series written and illustrated by Takashi Shiina. It was published in Shogakukan's Weekly Shōnen Sunday from 1991 to 1999. In 1993, it won the Shogakukan Manga Award for best shōnen manga. The series explores some folk religion themes such as possession, exorcism, shamanism, Yurei, and Yōkai.\r\n\r\nThe series was adapted as a 45-episode anime television series by Toei Animation called Ghost Sweeper Mikami (GS美神, Gōsuto Suīpā Mikami) which ran on TV Asahi and the Asahi Broadcasting Corporation from 1993–1994, covering most parts of the first nine volumes of the Manga (total 39 volumes). The anime lead to the release of a movie, which had been the only existence of Mikami in the United States (released by Manga Video). The TV series has been licensed by Sentai Filmworks. In November 2013, Toei Animation released all of the episodes with English subtitles to YouTube.",
  "banner_url": "/games/banner/gs-mikami-joreishi-wa-nice-body.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-04-13T06:51:23.647196Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13795
}