{
  "name": "Pax Romana",
  "slug": "pax-romana",
  "year": 2003,
  "description": "Pax Romana is a real-time strategy game in the tradition of Europa Universalis. The setting: the ancient Mediterranean world. The objective: control the destiny of the Rome. There are two gameplay modes: strategic and political.\r\n\r\nIn the strategic mode, the player controls Rome with the goal of securing the Republic and expanding its borders while also keeping the citizens happy. The map can be viewed through four different filters: military, economic, diplomatic, and administrative. Military view allows the player to manage armies and navies and appoint leaders of varying skills and abilities. In the economic view, the focus is on trade goods; the player must build trade routes (imports and exports) for each territory. Trade routes vary in value, cost to establish, and likelihood of being broken by war or other events. Diplomatic view allows the conduct of foreign relations; the player can raise or lower relations with other states (both major and minor) through gift-giving, public approval/disapproval, support of rebels, and other means. Once relations deteriorate, Rome has the option of declaring war—a necessity before making any aggressive military moves. Administrative view has the player building military units and roads, clearing land for economic development, and setting the priorities of the local governors.\r\n\r\nIn political mode, the player controls one of six historical factions, each with its own agenda. Success in this mode depends not only on fulfilling the overall goals of the strategic mode, but also on achieving the goals of the individual faction. This requires getting your faction members elected to the various offices (including censors, tribunes, governors, consuls, and proconsuls) and implementing policies through the Senate. Elections occur on a yearly basis, with the rest of the time being spent on politicking at the various locations of the Forum (baths, basilica, tavern, etc.).\r\n\r\nHistorical scenarios range from the Punic Wars to the rise of Caesar. A scenario editor is also included, giving the player the chance to alter scenarios and build new completely new ones. Of course, the ultimate goal is always the same: expand your power and establish the Pax Romana.",
  "banner_url": "/games/banner/pax-romana.jpg",
  "icon_url": "",
  "is_public": false,
  "updated": "2020-04-30T07:36:02.787775Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 32853
}