{
  "name": "Future Fragments",
  "slug": "future-fragments",
  "year": null,
  "description": "Future Fragments is a hybrid platforming/run 'n' gun/RPG game, with a science fiction/mystery theme.\r\nThe game starts off in the year 1000 AD, where your King, a powerful sorcerer, has been having trouble keeping your kingdom protected from those who would try and harm it.\r\nHe’s attempted to train multiple promising citizens into mages to help defend the kingdom, but unfortunately only two of them had enough talent to become exceptionally powerful magicians; Talia (that’s you!), an 18-year old, serious, “by the book” long-range specialist and Faye, a 21-year old, acerbic, arrogant short-range specialist.\r\nWhile the two were able to defend their kingdom for the next year, the other kingdoms continued to increase their power, and soon all seemed lost as the kingdom was quickly losing ground. However, after a frantic search for a solution, your King stumbled on a miracle; using his powers to rip a portal open to the future, he was able to find the fragments of a powerful weapon, laying dormant in the year 3000 AD.\r\n\r\nThus, your King’s orders are simple and direct; find the Fragments and return home safely.\r\n\r\nAdditionally, whoever brings back the most pieces will be designated the King’s right hand woman, with all the power that that brings.\r\n\r\nUnfortunately for him though, they each have their own motives...\r\n\r\nAnd of course, there’s threats in the future, too.\r\nMainly, there’s the World Organization for Regulation of the Masses, abbreviated “affectionately” as the WORM by the few remaining rebels who fight against it.\r\n\r\nEven worse is that sex and relationships, being seen as a waste of time that could be spent working, are both outlawed by the WORM (people are created through cloning and other means).",
  "banner_url": "/games/banner/future-fragments.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:36.518774Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}