{
  "name": "Dying Light",
  "slug": "dying-light",
  "year": 2015,
  "platforms": [
    {
      "name": "Linux"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "Adventure"
    },
    {
      "name": "FPS"
    },
    {
      "name": "RPG"
    },
    {
      "name": "Shooter"
    }
  ],
  "aliases": [],
  "description": "Dying Light is every zombie slayer's dream come true. As a skilled parkour runner, you explore a dangerous urban environment, scavenging for supplies and crafting weapons that can help you defeat the hordes of flesh-hungry enemies created by a mysterious epidemic. Once the sun sets, the hunter becomes the prey as the infected grow in numbers and strength - and the even more lethal Volatiles leave their nests to feed on human flesh. You must use all your skills and any available tools to survive till dawn.\r\n\r\nGood night. Good luck.\r\n\r\nGo anywhere and climb anything as you seamlessly traverse a vast, open environment. Whether you hunt or escape the hunters, you can move around the city with ease and speed. Jump between rooftops, climb walls, and attack your foes from above. Weaponize your parkour skills and use them for creative combat. Dying Light gives players a freedom of movement never seen in open world games before.\r\n\r\nCooperate with other players in the extreme conditions of a zombie apocalypse. Take your friends on a thrilling survival trip to the quarantine zone, tackle the story campaign together, and take part in special co-op challenges. Show your individuality and customize your character with dozens of unique outfits.\r\n\r\nExperience the horrifying tension of the night. In daylight you explore the city searching for supplies and weapons. After nightfall, though, this infected world undergoes a dramatic transformation that gives the gameplay a new dimension. You, a hunter by day, become prey. The infected grow in strength, but something even more sinister looms in the darkness to begin its hunt.",
  "banner_url": "/games/banner/dying-light.jpg",
  "icon_url": "/games/icon/dying-light.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:20.297700Z",
  "steamid": 239140,
  "gogslug": "",
  "humblestoreid": ""
}