{
  "name": "Pokémon SoulSilver Version",
  "slug": "pokemon-soulsilver-version",
  "year": 2009,
  "description": "Pokémon HeartGold Version and SoulSilver Version[b] are enhanced remakes of the 1999 video games Pokémon Gold and Silver, including the features in Pokémon Crystal. The games are part of the Pokémon series of role-playing video games, and were developed by Game Freak, published by The Pokémon Company and distributed by Nintendo for the Nintendo DS. The games were released in Japan on September 12, 2009, and were later released in other countries during March 2010.\r\n\r\nHeartGold and SoulSilver take place in the Johto region of the franchise's fictional universe, which features special creatures called Pokémon. The basic goal of the game is to become the best Pokémon trainer in the Johto and Kanto regions, which is done by raising and cataloging Pokémon and defeating other trainers.\r\n\r\nGame director Shigeki Morimoto aimed to respect the feelings of those who played the previous games, while also ensuring that it felt like a new game to those that were introduced to the series in more recent years. The games have received positive reviews from critics, and as of March 2014, the games' combined sales have reached 12.72 million, making the two games combined the eight best-selling DS game of all time\r\n\r\nPokémon HeartGold and SoulSilver are role-playing video games with adventure elements. The basic mechanics of the games are largely the same as their predecessors'. As with all Pokémon games for hand-held consoles, gameplay is viewed from a third-person overhead perspective, and consists of three basic screens: a field map, in which the player navigates the main character; a battle screen; and the menu, in which the player configures his party, items, or gameplay settings. The player begins the game with one Pokémon and can capture more using Poké Balls. The player can also use the Pokémon to battle or deceive others, often forming alliances or trends via the Team Rocket networks.[5]\r\n\r\nWhen the player encounters a wild Pokémon or is challenged by a trainer to a battle, the screen switches to a turn-based battle screen where the Pokémon fight. During battle, the player may fight, use an item, switch the active Pokémon, or flee (the last is not an option in battles against trainers). Pokémon have hit points (HP), which is displayed during combat; when a Pokémon's HP is reduced to zero, it faints and cannot battle unless taken to a Pokémon Center or healed or revived with a Pokémon skill or item. If the player's Pokémon defeats the opposing Pokémon (causes it to faint), it receives experience points. After accumulating enough experience points, it will level up; most Pokémon evolve into a new species of Pokémon when they reach a certain level, or when certain conditions are met (commonly, how much a Pokémon statistically 'likes' its trainer).[5",
  "banner_url": "/games/banner/pokemon-soulsilver-version.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-08-09T20:35:38.537693Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 14006
}