{
  "name": "Pikmin",
  "slug": "pikmin",
  "year": 2001,
  "description": "Captain Olimar has crash landed on a strange, alien world. With the pieces of his ship scattered across the planet, his only hope for survival lies with curious creatures he calls Pikmin. The captain must rally his newfound Pikmin friends and find the missing pieces of his ship ... before it's too late. \r\n\r\n Game storyline: Everything is going smoothly for Captain Olimar until a comet collides with this spaceship and forces him to crash land on a strange, alien world. After the rough landing, he quickly learns that his ship has broken apart while entering the atmosphere -not to mention the fact that his spacesuit is the only thing between him and a deadly poisonous atmosphere. He enlists the help of the Pikmin, small, indigenous plant-like creatures that inhabit the world, to search out the missing pieces of his ship before he succumbs to the noxious atmosphere. With a horde of Pikmin at his command, he just might have a chance.\r\n\r\nHow to progress through the game: In Pikmin, players must set out and explore the strange, lush planet and enlist the help of the indigenous Pikmin creatures to find the missing ship parts. Olimar has just 30 days to find all the parts before his air supply runs out. During the adventure, players encounter new types of Pikmin, each with its own special abilities. As players find more parts, new areas of the world are opened up, filled with dangerous native species and other hazards.\r\n\r\nCharacters: Captain Olimar, Pikmin \r\n\r\nSpecial powers/weapons/moves/features: Captain Olimar doesn't have any special weapons or super powers. Instead, he has an army of helpful Pikmin. Players can control up to 100 Pikmin at a time. There are several different kinds of Pikmin, each with its own special ability. For example, red Pikmin are immune to heat and fire, while blue Pikmin can survive in water. Players need to use strategy and command their Pikmin well to defeat predators and solve puzzles.",
  "banner_url": "/games/banner/pikmin.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:44.161176Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 21175
}