{
  "name": "Def Jam: Fight for NY",
  "slug": "def-jam-fight-for-ny",
  "year": 2004,
  "description": "O jogo ocorre imediatamente após Def Jam Vendetta . D-Mob ( Chris Judge ) é preso pelos policiais da NYPD Starks e Jervis e colocados na parte de trás de seu carro de polícia quando um SUV o atinge, fazendo com que ele flip sobre suas costas. D-Mob rasteja dos destroços e embarca o SUV enquanto Starks percebe o suspeito antes de passar. Mais tarde, ele descreve sua aparência para Lauren. O suspeito torna-se o protagonista do jogo , chamado The Hero .\r\n\r\nEm seu berço, Blaze ( Method Man ) e Sticky Fingaz estão jogando Def Jam: Vendetta (sons do jogo são ouvidos) e Doc ( Redman ) está dormindo. A dupla se surpreende quando D-Mob chega, acreditando que ele ainda estava preso. Louvando o herói por resgatá-lo, D-Mob diz a Blaze e Sticky que ele está, mas a dupla quer vê-lo lutar. Depois de derrotar House, Blaze fica impressionado, mas Sticky não está impressionado. D-Mob, em seguida, dá ao protagonista $ 750 para parecer melhor e começa a lutar pelo horário para ele. Procurado pelos policiais, Blaze dá a The Hero um berço para ficar escondido. O herói então começa a derrotar inúmeros lutadores, ganhando notoriedade depois de derrotar OE ( Omar Epps ). A derrota da OE impressiona o lutador da D-MobLudacris .\r\n\r\nDepois que The Hero derrota um lutador de The Limit, Blaze diz que 4 lutadores se interessaram por ele. As mulheres são Cindy J, Kimora Lee , Lil 'Kim e Shawnna . Quando The Hero se aproxima de 1 deles, seu namorado Nyne (que The Hero anteriormente lutou) o ataca. Se The Hero ganhar, a namorada de Nyne se tornará sua namorada. Se The Hero perde, ele é console por Shaniqua e ela se torna sua namorada. Agendando uma partida contra Ice-T , The Hero o derrota. Enquanto a D-Mob lhe entrega seu dinheiro, eles são recebidos por Crow ( Snoop Dogg ), o principal antagonista do jogo e seus capangas: Magic , Crack e Trejo. Advertindo a D-Mob que o Clube 357 estará sob seu controle, Crow anuncia que ele está aceitando lutadores em troca de mais dinheiro. O anúncio faz com que a D-Mob perca alguns de seus clubes e vários de seus lutadores se juntando a Crow, como WC .\r\n\r\nVoltando para The Limit e Babylon para derrotar os lutadores de Crow, Carmen Electra toma conhecimento do The Hero. Quando Electra ou The Hero se aproximam do outro, a namorada fica com ciúmes e envolve a Electra para uma briga. O vencedor torna-se a namorada do Herói com resultados mistos. Em uma reunião com D-Mob, Blaze, Ludacris, NORE , The Hero e Sticky, eles concordam em lutar contra os lutadores de Crow para recuperar seus clubes. D-Mob, em seguida, organiza uma partida para o Blaze ir contra o crack, mas o Blaze perde. Derrotando muitos dos lutadores do Crow, The Hero, depois derrota o WC no The Red Room. Comemorando sua vitória, Crow propõe uma partida vencedora entre o Crack e o \"melhor homem\" da D-Mob. D-Mob aceita e escolhe The Hero. Enfurecido, ele não foi escolhido,\r\n\r\nChegando ao assassinato do clube, The Hero derrota Crack. Crow deixa a arena com raiva enquanto The Hero, Blaze e D-Mob celebram em sua limusine . À medida que a D-Mob dá ao protagonista um pingente e o recebe na família, um carro puxa ao lado deles e Trejo abre fogo com um Uzi. Tentando fugir, os carros batem em uma lamppost e Trejo, Magic, e um terceiro assaltante fazem sua fuga na estação de metrô 125th Street. Enquanto D-Mob e Blaze permanecem nos destroços, The Hero persegue o trio como Magic e Sticky, que se juntam à tripulação de Crow, embarcam em um metrô que sai da estação. Apesar de ter um tiro claro, Trejo está fora de balas e luta em The Hero (o último tem a opção de jogar Trejo nas trilhas do trem, onde é atropelado por um trem. Independentemente de fazer isso ou simplesmente derrubá-lo , ele não aparece no resto da história). Voltando à limusine, The Hero tenta retirar o D-Mob do naufrágio, mas D-Mob diz que ele e Blaze vão embora porque ele está muito ferido e os policiais chegaram à cena.\r\n\r\nVoltando ao berço, Blaze leva o lugar da D-Mob. Apesar de querer retaliar, Blaze conta ao The Hero para continuar lutando contra os lutadores de Crow para conquistar mais clubes enquanto Doc, acordando, se junta. Junto com Ludacris, o trio assume o controle do Terror Dome, a Syn Power Power Plant, 7th Heaven, Hunt's Point Scrap Yard e a Fundação. Chegando ao Chopshop, um torneio de equipe patrocinado pela revista The Source , está sendo realizado onde a equipe vencedora ganha uma grande quantidade de dinheiro e um Cadillac Escalade personalizado . Depois que Magic se aproxima da namorada do Herói, ele entra no torneio e escolhe Ice-T ou OE como seu parceiro. Alcançando a rodada final, a equipe enfrenta Magic e o parceiro The Hero não escolheu como seu parceiro e os derrota.\r\n\r\nEnquanto o jogador continua a acumular vitórias e pires no império de Crow, Crow tenta continuamente obter o Hero para se juntar ao lado dele, mas falha (1 das primeiras tentativas consiste em Magic ameaçando The Hero em um estacionamento depois de uma luta em gaiola em o Gauntlet - isso resulta no único jogo de demolição do jogo ). Crow convida a seqüestrar a namorada do Herói e forçá-lo a retomar todos os clubes que ele ganhou para o lado da D-Mob, 1 por 1, uma aparente traição que irrita a equipe da D-Mob. Crow alerta o herói de que, se ele dissesse a alguém o verdadeiro motivo de sua mudança de lado, a namorada do herói morrerá.\r\n\r\nCom o último clube conquistado em uma luta contra o Doc (antes que Blaze distraída tomasse o pingente D-Mob do Hero), Crow afirma ter uma 1ª tarefa final para o jogador. A cena é movida para um scrapyard vazio, onde o jogador encontra Blaze brutalmente espancado por Magic, a tarefa final é acabar com ele. O Herói se recusa, e bate o WC. Ele e Blaze então batalham Crack and Magic. Após a luta, o jogador descobre onde sua namorada está sendo realizada e que Crow nunca planejou deixá-la viver. Ele e a Blaze correm para uma fábrica abandonada, onde Sticky está prestes a incendiar todo o edifício. O jogador envolve Sticky in a Inferno Matche o deixa morrer no edifício em chamas. Depois que ele ganha a luta, ele pode ser visto tirando sua namorada do prédio antes que ele colapsa. Ela permanece inconsciente quando o jogador tenta sacudê-la acordada (deixando seu verdadeiro destino indeterminado) e enfurece o herói o suficiente para enfrentar Crow.\r\n\r\nThe Hero e Blaze enfrentam Crow em sua sede, apoiado por Crack e WC, cujo respeito eles ganharam, e o restante da equipe da D-Mob, com quem Blaze limpou o bom nome do Herói. À medida que um rumor explode com as tripulações, The Hero corre para enfrentar Crow em um confronto final. Depois de uma breve parada, envolvendo uma arma, dada ao jogador por uma mágica arrependida, The Hero decide que Crow não vale a pena matar. No entanto, um Corvo enfurecido o ataca com uma faca escondida em sua bengala. O ataque de Crow foi o aviso de D-Mob: \"Um cachorro espancado pode ter medo de você, mas o segundo, você virará as costas, ele vai atacar\". Após um Match de Janelas(a partida final no jogo) Crow é derrotado. (O jogador tem a opção de jogar Crow fora da janela. Independentemente de se você fizer isso ou simplesmente nocauteá-lo, o cutscene que se segue mostra o cadáver de Crow no chão, como se ele fosse jogado fora da janela). O jogador então leva um minuto para refletir depois que Crow morre.",
  "banner_url": "/games/banner/def-jam-fight-for-ny.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:29:08.241783Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 17295
}