{
  "name": "Mario & Luigi: Partners in Time",
  "slug": "mario-luigi-partners-in-time",
  "year": 2005,
  "description": "Mario & Luigi: Partners in Time[a] is a role-playing video game developed by AlphaDream and published by Nintendo for the Nintendo DS handheld game console in 2005. It is the second game in the Mario & Luigi series, and is the prequel/sequel to Mario & Luigi: Superstar Saga for the Game Boy Advance. The game was followed by Mario & Luigi: Bowser's Inside Story, released in 2009. The game was later re-released for Wii U as a Virtual Console title in 2015, available for purchase from Nintendo eShop.[1]\r\n\r\nAlthough the prequel/sequel to Superstar Saga, the game's plot is completely unrelated to that of its predecessor with more emphasis on the time-traveling theme, which involves the protagonists traveling in between the past and present of the Mushroom Kingdom.[2] The adventure follows Mario, Baby Mario, Luigi, and Baby Luigi while they search for Princess Peach, who has been abducted by an alien species only known as the Shroobs.[3] The gameplay centers on the co-operation between the quartet, who must use their specific qualities and skills to solve puzzles to progress through and features multiple role-playing game elements, but with a turn-based battle system focused on timing accuracy.[4] The game is considerably darker in tone than its predecessor, especially in its plot and themes.\r\n\r\nPartners in Time was critically acclaimed by the media, gaining an aggregate score of 86 from Metacritic.[5] Like its predecessor, the game was praised by critics for its characterization and comical style, as well as its use of the DS's dual screen and the rumble feature.\r\n\r\nThe gameplay of Partners in Time, with an emphasis on role-playing games elements and co-operative puzzle solving,[7][8] is similar to that of its predecessor, although gameplay differences exist between the games. For the majority of Partners in Time, the overworld of the game is presented on the DS's touchscreen, while a map is present on the top screen, showing relevant information such as the location of each character and save albums. Additionally, the perspective changes when battling or accessing the inventory, and when the quartet is separated into two pairs, in which a pair is visible on each screen.",
  "banner_url": "/games/banner/mario-luigi-partners-in-time.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:17.699490Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13981
}