{
  "name": "Anno 2205",
  "slug": "anno-2205",
  "year": 2015,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "City building"
    },
    {
      "name": "Simulation"
    },
    {
      "name": "Strategy"
    }
  ],
  "aliases": [],
  "description": "Anno 2205™ – the beloved city builder takes off into space!\r\n\r\nIn Anno 2205™, you join humankind‘s next step into the future with the promise to build a better tomorrow. You conquer Earth, establishing rich, bustling cities and grand industrial complexes, but to secure the prosperity of your people, you must travel into space.\r\n\r\nA scientific breakthrough in fusion energy promises to revolutionize all aspects of society. The necessary isotope, helium-3, can only be found in harvestable quantities on the Moon. Venture into space and settle on the Moon in the thrilling race for resource and power.\r\n\r\nAnno’s masterful economic gameplay is back and taking strategic city-building simulation to new heights, launching into space!\r\n\r\nTHE ACCLAIMED CITY BUILDER REACHES FOR THE STARS\r\nAnno 2205™, the sixth title in the award-winning city-building franchise, expands into space. Colonize continents on Earth, establish bases on the Moon, and mine the Moon’s resources to transform your cities into thriving metropolises.\r\n\r\nUNLIMITED CITY BUILDING\r\nThousands of hours of accessible and challenging gameplay let you go beyond the story and ultimately grow monumental cities with thousands of buildings. You control your growing corporation simultaneously on multiple locations on Earth and the Moon. Gameplay brings a revolutionary session mode that lets you play on multiple islands, instantaneously connecting different regions. Anno 2205™ is the biggest in the series, offering unlimited replay value on islands five times bigger than in previous games.\r\n\r\nINDULGENT GRAPHICS BRING YOUR CITY TO LIFE\r\nThe new game engine offers a true sense of grandeur and brings an unprecedented level of detail and immersion. Your city comes to life with flying cars and more than a million thriving citizens alongside churning factories, grinding mines, and amazing wildlife, all completely animated and driven by your actions.",
  "banner_url": "/games/banner/anno-2205.jpg",
  "icon_url": "/games/icon/anno-2205.png",
  "is_public": true,
  "updated": "2019-02-09T07:09:00.958276Z",
  "steamid": 375910,
  "gogslug": "",
  "humblestoreid": ""
}