{
  "name": "Gyruss",
  "slug": "gyruss",
  "year": 1984,
  "description": "The majority of enemies are spaceships, which must be destroyed to complete a level. They appear either from the centre of the screen or from one of the edges, and move in swirling patterns. They can shoot the player's ship or destroy it by contact. They hover near the centre of the screen after completing their deployment pattern, and occasionally fly outwards and shoot at the player. If not destroyed by the player, the enemy ships gradually fly away one by one.\r\n\r\nThere are also several other types of enemies: satellites, asteroids, and laser beam generators. These appear intermittently and soon disappear of their own accord if not destroyed by the player.\r\n\r\nSatellites materialise in a group of three just in front of the player after the ordinary enemy ships have finished deployment. They gyrate in small circles and shoot at the player. If the player has the basic weapon when the satellites appear the middle one will be a sun-like object. If destroyed, the player's ship gets a better weapon. If the better weapon has already been gained then all satellites are identical.\r\n\r\nAsteroids fly straight outwards from the centre of the screen at regular intervals. They cannot be destroyed, but a small points bonus is given for shooting at them.\r\n\r\nLaser beam generators occasionally fly straight outwards from the centre of the screen. They consist of two generator segments with a laser beam between them; destroying either generator deactivates the beam. The player's ship is destroyed by contact with either the generators or the beam.\r\n\r\nThe player begins the game \"2 WARPS TO NEPTUNE\". After completing each level, the player is one warp closer to a planet. Each time a planet is reached, the player's ship is seen flying towards it and then a short bonus round is played, where the player can shoot enemy ships for bonus points without worrying about being destroyed by them. After reaching Neptune, the player is then three warps from Uranus, and progresses through Saturn, Jupiter, Mars, and finally Earth, taking three warps to reach each planet. Stage one and every 10th stage thereafter the enemies do not fire on the player when entering the screen.\r\n\r\nAfter completing Earth's bonus stage, the player must travel through the very fast \"3 WARPS TO NEPTUNE\" level before returning to the start of the game.",
  "banner_url": "/games/banner/gyruss.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-03-17T11:44:55.191332Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}