{
  "name": "CivNet",
  "slug": "civnet",
  "year": 1995,
  "description": "When Sid Meier's masterpiece Civilization was first released in 1991, it seemed to be the ideal pioneer of multi-player gaming. At that time, though, on-line gaming was still in its infancy, and so the idea of a networkable version was postponed. Two years later, MicroProse released CivNet, the multiplayer version of the venerable classic. Unfortunately, hindered by tragically slow response speeds and overshadowed by the virtually concurrent release of Civilization 2, CivNet was a big disappointment to fans of the original. Fortunately, today's fast Pentiums render all speed issues moot, and when the latest patch is applied, CivNet emerges as one of the best games ever made.\r\n\r\nFor all intents and purposes, CivNet is Civilization with a slick new Windows-based interface. The concept remains the same addictive hodgepodge of strategy, war, and the amazing technology tree: each player selects a culture and attempts to lead his or her nation into the most powerful civilization of all time, either through military conquests, economic development, or technological prowess. Typically, a mastery of two or more of these areas is crucial to winning the game with a high score.\r\n\r\nIn addition to multiplayer support, a few cosmetic features have been added. These includes: a king builder that enables players to create a visual representation of their alter ego, and a map editor to allow the creation of personalized landscapes. The players can choose to play a multiplayer game as either turn-based, or simultaneous. The turn-based play is clearly superior to the simultaneous mode, since in the latter adds the chance of enemy units attacking you in the middle of your turn, and is very confusing in a game with more than 2 players. The turn-based mode (which was the game's Achilles' heels when it was released due to very slow speeds on hardware at the time) will prove as addictive as it was in the original. The game also benefits from Windows features, such as crisp SVGA graphics and on-line civilopedia and help files.\r\n\r\nOverall, CivNet is a solid game that was unfortunately ignored simply because Civilization 2 was released almost concurrently, and the crucial multiplayer options were not thoroughly tested.",
  "banner_url": "/games/banner/civnet.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:28:53.729796Z",
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 24552
}