{
  "name": "Rhem 2: The Cave",
  "slug": "rhem-2-the-cave",
  "year": 2005,
  "description": "Rhem 2 takes place immediately where the first game left off. However, it is not necessary to have played Rhem 1 first since all of the information you need to play this sequel is given to you at the beginning of the game.\r\n\r\nKales and his brother, Zetais, have found entrances to underground territories in the world of Rhem. As the game begins, Zetais gives you the first piece of a star-shaped key which will open a portion of the subterranean caves. Your mission: To fully explore the pathways and caverns below the surface of Rhem .. to find all of the pieces of the key .. and, finally, to find and photograph a mysterious disk that Zetais wants to examine.\r\n\r\nRhem 2 is an adventure that relies heavily on solving puzzles to advance the story. The majority of the interaction entails working with electrical cables which will ultimately restore power to the various parts of the world. Players will encounter logic and mechanical puzzles, those dependent on colors or numbers as well as an open/close door maze-like puzzle. Manipulation of some puzzles requires locating specific clues about them in other parts of the underground caves.\r\n\r\nThis sequel, like its predecessor, features a point-and-click QuickTime interface in first person perspective. Various cursors appear for navigation and interacting with the environment. Screen load transitions can be adjusted to suit the players taste and style of play. Ambient sound effects can be heard throughout and motion effects can be seen. The prerendered graphics are preset for 32-bit color / 800x600, and there are no options to change resolutions. Video-quality cut-scenes feature real actors and actresses. Inventory appears in a separate screen, which is different than the first game. Ten save-game slots are available and are saved by number without the option to customize.",
  "banner_url": "/games/banner/rhem-2-the-cave.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-09-11T17:29:18.918262Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 29309
}