{
  "name": "CounterSpy",
  "slug": "counterspy",
  "year": 2014,
  "description": "CounterSpy is a 2.5D side-scroller with stealth elements and randomly generated levels. Set in an alternate version of the Cold War, players play as a counter agent sent to infiltrate the bases of opposing countries in order to prevent either of them from launching nuclear weapons. Movement largely takes place on a 2D plane, whilst specially marked areas allow the player aim their weapon in 3D space. The games atmosphere is heavily inspired by 60s spy mythologies such as James Bond, and The Man from U.N.C.L.E. Score multiplier is awarded for making consecutive stealth kills. The main aim of the game is to collect enemy plans which help to further the story and shut down the base's weapon at the end of each level. Players can also collect intel, which serves as the game's currency, as well as plans which unlock new weapons and special formulas. Prior to each mission, players can spend intel to refill ammo, purchase and equip unlocked weapons, or equip up to three single use formulas which make the game easier, such as increased stealth or health. If a player beats a rival player's score, they can encounter them during the next level and retrieve bonus intel from them.\r\n\r\nThe main thing the player must be cautious about is the DEFCON status of both sides. This raises if the player is caught by security cameras or if a guard is allowed to radio in after becoming suspicious, and will automatically go up a level if the player is killed. Players can lower the DEFCON status by forcing white-uniformed officers to surrender without killing them, or by using a certain formula. If the DEFCON status reaches DEFCON 1, the player will have a limited amount of time to reach the end of the level and shut down the weapon before it is launched, at which point the game will end.",
  "banner_url": "/games/banner/counterspy.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-05-19T13:14:45.987277Z",
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 27193
}