{
  "name": "DROD: The Second Sky",
  "slug": "drod-the-second-sky",
  "year": 2014,
  "description": "The Second Sky is the fifth major title in the DROD series and the climactic chapter in Beethro's adventures in the Great Beneath. This game is the culmination of years of development and evolution of the DROD formula. It is designed as a tremendously rewarding experience for the hardcore gamer. We are making this game especially for those who love puzzles and dungeon delving. It features a plethora of novel game and puzzle elements that you have not seen anywhere else, placed onto a backdrop of a unique and epic story full of peculiar characters and engaging locales.\r\n\r\nGuide Beethro Budkin, professional dungeon pest exterminator, as he goes up against the Rooted Empire in a race against time under the looming Grand Event. Beethro is always fond of saying \"there is no problem that can't be solved with a really big sword,\" but he will need to use a variety of fresh new weapons and tactics to win the day this time against a dire threat. You won't believe what's in store!\r\n\r\nAre you new to DROD?  If so, then I envy you. Amazing puzzles await you in The Second Sky. But if you're a new player, we suggest you begin your journey at an easier point in our beginner-friendly title, Gunthro and the Epic Blunder.  Here is what is in our latest offering:\r\n\r\n* Over 500 puzzle rooms and 30 levels, each organized around a different type of puzzle element.\r\n* Many secrets and optional extra challenges that lie in store for the more curious and adventuresome, uncovered in a variety of ways.\r\n* Over a dozen new puzzle elements, including new weapons and monsters with play mechanics that you haven't seen in any other game.\r\n* Journey across multiple overworld maps as you explore over and under the vast continents of the Eighth.\r\n* This game has over four hours of music, containing an all-new 90-minute soundtrack composed by synthpop artist Jon Sonnenberg of Travelogue, plus ten thematic tracks by Emmett Plant!\r\n* A epic story, filled with a host of fun and intriguing characters, each portrayed with quality voice acting.\r\n* New and upgraded in-game artwork, including three all-new terrain styles, with realtime lighting and a range of environmental effects.\r\n* Comes with bonus \"DROD Starter Pack\", a selection of high quality user-made level sets.",
  "banner_url": "/games/banner/drod-the-second-sky.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-05-31T00:17:40.789505Z",
  "provider_games": [
    {
      "name": "DROD: The Second Sky",
      "slug": "1207665683",
      "service": "gog"
    }
  ],
  "steamid": 351320,
  "gogid": 1207665683,
  "gogslug": "drod_the_second_sky",
  "humblestoreid": "",
  "id": 4111
}