{
  "name": "Ace Attorney Investigations: Miles Edgeworth",
  "slug": "ace-attorney-investigations-miles-edgeworth",
  "year": 2009,
  "platforms": [
    {
      "name": "Nintendo DS"
    }
  ],
  "genres": [
    {
      "name": "Adventure"
    },
    {
      "name": "Puzzle"
    }
  ],
  "aliases": [],
  "description": "SYNOPSIS\r\n\r\nAce Attorney Investigations is the newest offering in Capcom’s successful Ace Attorney franchise, swapping the stage of a courtroom for a crime scene, and getting to the bottom of cases that will test the skills of eagle-eyed players with challenges developed for the Nintendo DS. \r\n\r\nThis time around, the player takes on the role of famed prosecutor Miles Edgeworth, a memorable rival of charismatic legal eagle Phoenix Wright. Edgeworth actively investigates crime scenes in order to pursue the truth behind each case. By solving the challenging puzzles presented him, Edgeworth will work with the police to bring criminals to justice.\r\n\r\nUsers will be able to directly control the character avatar’s movement on the scene with the arrow key or touch screen and investigate the crime scenes freely. If, during the course of an investigation, users find contradictions, they will be able to obtain new information by presenting decisive evidence. In some cases, users will identify clues and conduct examinations of material witnesses. On these occasions, users will have to uncover the truth behind the crimes using collected information, the evidence, and logic.\r\n\r\nMiles Edgeworth will have to confront suspects and get to the bottom of his cases by collecting information and evidence through detective work between key locations. Also, in the “logic” mode that symbolizes Edgeworth’s logical inferences, users can discover new information and evidence by combining two pieces of information out of the collected pieces. The real culprit that will be revealed through investigations and witnesses will be confronted in a ‘battle’ similarly fought (Testimony – Pursuit – Press – Confront) to that of the ‘Court Battle’ in the Ace Attorney series (Testimony – Cross Examination) to expose the contradictions.\r\n\r\nFEATURES\r\n\r\nStarring Miles Edgeworth, the popular rival of attorney Phoenix Wright\r\nGameplay moves out of the courtroom and onto the crime scene\r\nNew investigative style using the Nintendo DS stylus to uncover evidence\r\nSeveral unique cases to solve with over 15 hours of gameplay\r\nNew technique, such as “logic” mode assists you in uncovering the crime\r\nUnique dialog trees and interrogation techniques let you question witnesses to discover the truth",
  "banner_url": "/games/banner/ace-attorney-investigations-miles-edgeworth.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:10.858015Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}