{
  "name": "Cities: Skylines",
  "slug": "cities-skylines",
  "year": 2015,
  "description": "Cities: Skylines is a modern take on the classic city simulation. The game introduces new game play elements to realize the thrill and hardships of creating and maintaining a real city whilst expanding on some well-established tropes of the city building experience.\r\n \r\nFrom the makers of the Cities in Motion franchise, the game boasts a fully realized transport system. It also includes the ability to mod the game to suit your play style as a fine counter balance to the layered and challenging simulation. You’re only limited by your imagination, so take control and reach for the sky!\r\n\r\nMain features:\r\n*    Multi-tiered and challenging simulation: Constructing your city from the ground up is easy to learn, but hard to master. Playing as the mayor of your city you’ll be faced with balancing essential requirements such as education, water electricity, police, fire fighting, healthcare and much more along with your citys real economy system. Citizens within your city react fluidly, with gravitas and with an air of authenticity to a multitude of game play scenarios.\r\n*    Extensive local traffic simulation: Colossal Orders extensive experience developing the Cities in Motion series is fully utilized in a fully fleshed out and well-crafted transport systems.\r\n*    Districts and Policies: Be more than just an administrator from city hall. Designating parts of your city as a district results in the application of policies which results in you rising to the status of Mayor for your own city.\r\n*    Extensive modding support: Build or improve on existing maps and structures. You can then import them into the game, share them as well as download the creations of other city builders on the Steam workshop.",
  "banner_url": "/games/banner/cities-skylines.jpg",
  "icon_url": "/games/icon/cities-skylines.png",
  "is_public": true,
  "updated": "2019-03-23T14:23:05.961183Z",
  "provider_games": [],
  "steamid": 255710,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "cities-skylines",
  "id": 4081
}