{
  "name": "Command & Conquer: Generals",
  "slug": "command-conquer-generals",
  "year": 2003,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Real-time strategy"
    }
  ],
  "aliases": [],
  "description": "A new chapter in the Command & Conquer universe, set somewhere in the 2020s, pits three sides for global domination: the United States of America, the People's Republic of China and the Global Liberation Army (GLA). \r\n\r\nGenerals features real world (renamed or slightly altered) weapons combined with quasi-high-tech ones, new control schemes and a fast-paced multiplayer. Generals is the first game in the Command & Conquer series not to include FMV or pre-rendered cutscenes between missions, and was also the first C&C game without the Westwood Studios label (although the development studio was initially called Westwood Pacific before being merged into EA Pacific). It uses a full 3D environment powered by the SAGE engine, a modified version of the W3D engine previously seen in Emperor: Battle for Dune and C&C: Renegade.\r\n\r\nThe core gameplay differs somewhat from other games in the series, a move done in order to modernize the formula. First off, construction yards are absent, as structures are built by dozers for the USA and China, and workers for the GLA. The sidebar is replaced with the bottom bar, and support powers are \"purchased\" with leveling up as a general, which is done through participating in combat. For the first time in the series, each factory-type structure (barracks, war factory, airfield...) has its own build queue, in the same fashion as in Blizzard's RTS titles before it, instead of having a shared one like in the previous C&C games. Upgrades are available for the first time in the series as well, bringing improvements to units and structures. Everything is paid for in advance instead of having credits slowly drain as the object is constructed.",
  "banner_url": "/games/banner/command-conquer-generals.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:56.498755Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}