{
  "name": "Asteroids Deluxe",
  "slug": "asteroids-deluxe",
  "year": 1981,
  "description": "Pilot a spaceship equipped with shields and auto-fire as you blast through level after level of rotating asteroids. UFOs and multi-segmented Killer Satellites take chase, searching for an opportunity to destroy your ship. Asteroids Deluxe features modified gameplay intentionally designed to challenge players who had mastered the original Asteroids. Hyperspace was replaced with a new option called \"shields\", which creates a protective barrier around the players' ship. This barrier is only effective when the button is depressed and held unlike hyperspace, and depletes with use also unlike hyperspace. The players' ship was redesigned to include two side fins and a narrower body, keeping the overall ship dimensions identical to the original game. The ship has the same maximum velocity as in Asteroids, but can accelerate twice as fast. Firing is automatic, holding down the fire button will release a maximum of four shots on screen at a time. The asteroids themselves rotate as they travel about the screen. Firing accuracy of the two saucers was improved, and the saucers shoot both \"wrap-around\" shots and shoot immediately upon entering the screen both features designed to discourage UFO hunting. Atari added extra challenge to the game by introducing the \"Killer Satellite\" or \"Hexagon\", a snowflake-like object which breaks into three ship-chasing \"Diamonds\" once hit. Each diamond in turn can break into two \"Sharks\" or \"Wedges\" they resemble the dorsal fin of a shark which also pursue the players' ship. Overall a much more difficult game than the original Asteroids. There are two versions of the software. The original release proved to be so difficult that Atari released a revised version that had easier game play. This new version was originally introduced in Europe and is often referred to as the \"European Version\". Determining which version you are playing can be discerned by noting when the first appearance of a Killer Satellite occurs - in the original version this is near the end of the second wave, in the revised version it will appear near the end of the first wave and moves much more slowly. Dave Sheppard was the designer.",
  "banner_url": "/games/banner/asteroids-deluxe.jpg",
  "icon_url": "/games/icon/asteroids-deluxe.png",
  "is_public": true,
  "updated": "2020-05-26T03:31:56.777698Z",
  "provider_games": [
    {
      "name": "Asteroids Deluxe",
      "slug": "astdelux",
      "service": "mame"
    }
  ],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 24838
}