{
  "name": "Rebel Moon Rising",
  "slug": "rebel-moon-rising",
  "year": 1997,
  "description": "Rebel Moon Rising is a sequel to Rebel Moon. It is a first person shooter where the player takes on the role of a rebel colonist on the moon fighting against the oppressive UN forces from Earth.\r\n\r\nIn Rebel Moon, the player is thrown into a conflict between the self-proclaimed Lunar Free State (also known as Free State Selena) and the United Nations of Earth who seek to quell the rebellion and bring back the colonies on the Moon under control. Declaring the colonists \"terrorists\", the UN deploy their ATFOR (Anti-Terrorism Force) units which comprise the main enemies of the game. As the war for independence unfolds, the player takes active participation in the role of a Lunar Defence Forces (LDF) operative who is tasked with various missions to thwart the UN invasion. Despite the rebels' tactical successes, ATFOR troops manage to win a major victory, and the leader of the Lunar Free State disappears in the aftermath.\r\n\r\nThe story is continued in Rebel Moon Rising. The revolution is far from over, as LDF and the Free State still control several domes on the Moon's surface. The UN forces on the other hand face their own problems. ATFOR's victory over the colonists would not be possible without the aid of the Neue Deutsche Einheit (NDE) - Germany's successor state - and the superior training and firepower of NDE Blacksuits. However NDE is not part of the UN and has its own agenda concerning the lunar colonies. The arising tensions between the two factions present an opportunity for the LDF to gain advantage and tip the scales in their favour. Further complicating the situation are rumours of alien sightings on the Moon's surface.\r\n\r\nWhile the gameplay of Rebel Moon Rising is in many aspects similar to that of Doom and other contemporary first-person shooters, it is much more mission-oriented, making it comparable to Star Wars: Dark Forces. There are four mission types: Commando missions, which involve infiltrating enemy installations, acquiring a device or destroying a target; Search & Destroy missions where the player needs to locate and eliminate a number of targets; Defence missions which require to protect a critical item, location or piece of equipment; and Rescue missions where it is needed to free LDF prisoners and escort them to safety. Sometimes, the player is accompanied by AI-controlled allies during the missions.\r\n\r\nIn addition to an arsenal of weapons of varying firepower, the player can find and make use of items such as a jetpack and temporary invisibility or invulnerability \"powercels\". However the most important item is the oxygen recycler. The player starts each mission with a supply of oxygen which slowly gets used up as the level progresses. This essentially limits the time to complete a mission, and the oxygen supply duration is indicated in the briefing. This time limit is cancelled if the player finds an oxygen recycler in the level, usually hidden in one of the secret areas.\r\n\r\nThe level design often emphasises stealth over direct, frontal assault approach. The player is encouraged to search for secrets and backdoors to get past enemy forces. It is possible to sneak up on unsuspecting enemies; conversely, setting off an alarm might end up the player facing an overwhelming number of enemy troops.",
  "banner_url": "/games/banner/rebel-moon-rising.jpg",
  "icon_url": "/games/icon/rebel-moon-rising.png",
  "is_public": true,
  "updated": "2019-09-24T21:24:11.780700Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 28410
}