{
  "name": "Extinction",
  "slug": "extinction",
  "year": 2018,
  "description": "Legend calls them the Ravenii, encroaching armies of bloodthirsty monsters standing 150 feet tall that threaten to destroy mankind. You are one of the world’s last Sentinels, a soldier named Avil equipped with the skills to battle the endless wave of Ravenii. Fight massive brutes and their minions across a sprawling countryside, defending cities and rescuing refugees torn from their homes. Swiftly define your strategy as hordes attack from the ground and air. Use a dynamic skill-based combat system to your advantage, tactically disarming and dismembering enemies to go in for the kill. This is no longer a war. It is an annihilation. And you are all that stands between humanity…and extinction.\r\n\r\nDeep Story Campaign. Protect the human population across an abundant story campaign, rescuing as many civilians as possible and taking down brutal opponents.\r\n\r\nDynamic Side Missions. Complete numerous side missions with various objectives, earning upgrades to aid you in your campaign.\r\n\r\nSkill-Based Combat. Travel horizontally and vertically, perform wall runs, and use your whip as a vault to execute devastating air assaults. Master dynamic combat\r\nmaneuvers to effectively traverse the giant beasts and expose their weak points, progressing along different skill trees to develop a path best suited to your playstyle.\r\n\r\nInteractive Environment. Move freely around a fully destructible environment, and use objects throughout the world to your strategic advantage.\r\n\r\nInnumerable Battle Scenarios. Every battlefield is different from the last, ensuring a unique combat situation each time you play.\r\n\r\nSkirmish Mode. Create unique battlegrounds and challenge players online to compete for the top score.\r\n\r\nExtinction Mode. Fight off a continuous horde of assailants as wave after wave of ogres and their minions attack without relent.",
  "banner_url": "/games/banner/extinction.jpg",
  "icon_url": "/games/icon/extinction.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:26.931316Z",
  "provider_games": [],
  "steamid": 570710,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 19762
}