{
  "name": "Battel for Middle Earth 2",
  "slug": "battel-for-middle-earth-2",
  "year": 2006,
  "description": "The Lord of the Rings: The Battle for Middle-earth II brings extensive changes compared to the original.\r\n\r\nThe storyline follows the lesser known story of the War of the North, which took place at the same time as the Lord of the Rings trilogy. The game makes use of the book license in addition to the existing license of Peter Jackson's film trilogy, which also results in some characters which were not seen in the films being present in this game. Also included are some original characters, like Gorkil and Drogoth. The campaigns are once again split to the Good and Evil, but instead of taking place on a meta-map, they are entirely linear in nature.\r\n\r\nThe game features six playable factions: Men of the West (combination of Gondor and Rohan from the first game), Elves, Dwarves, Goblins, Isengard, and Mordor. The base system has been completely overhauled, allowing for free-form construction around the map. Resources are still primarily gathered by farm-type structures, but they have to be built far from each other and on suitable terrain for optimal income. Some neutral buildings like beacons, taverns and shipyards can be captured by infantrymen, much like tech structures in the later Command & Conquer games. In addition to this, production structures (unlike farm-type ones) have to be manually upgraded to be able to train higher-tier units. More units are available per faction, new support powers can be selected in the Palantir, and custom heroes can be designed and trained in skirmish and multiplayer. Taking the One Ring (from a killed Gollum unit which can occasionally appear on a map) to a fortress will allow the player to train a Ring Hero - Galadriel for the Good factions or Sauron for the Evil factions, both heroes being more powerful than any other unit in the game.\r\n\r\nA new game mode is introduced - the War of the Ring, which is available in singleplayer and multiplayer. The player chooses a meta-map scenario and the armies which will be present on it, after which the game is played in a turn-based fashion over the regions of Middle-earth, where players establish bases and task forces. Battles between opposing factions can be resolved automatically or by loading a usual real-time mode map and playing a modified skirmish match with starting units and/or structures which match the state on the turn-based map.",
  "banner_url": "/games/banner/battel-for-middle-earth-2.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2020-04-21T13:57:43.806008Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}