{
  "name": "Children of Mana",
  "slug": "children-of-mana",
  "year": 2006,
  "description": "Children of Mana, originally released in Japan as Seiken Densetsu DS: Children of Mana,[a] is a 2006 action role-playing game for the Nintendo DS handheld console. It was developed by Square Enix and Nex Entertainment, and published by Square Enix and Nintendo. It is the sixth game of the Mana series—following 2003's Sword of Mana—and the first entry in the World of Mana subseries. Set in a high fantasy universe, Children of Mana follows one of four young heroes as they combat an invasion of monsters and learn about the cataclysmic event that killed their families.\r\n\r\nWhile it reprises the action role-playing elements of previous Mana games, such as real-time battle sequences, Children of Mana features an increased focus on user-friendliness. Unlike earlier Mana titles, Children is a heavily action-oriented dungeon crawler, in which the player progresses by completing randomly generated levels. Both the main plot and side-quests require the player to fight through dungeons and defeat boss monsters before returning to the central Mana Village. Like many of its predecessors, the game features a local cooperative multiplayer component.\r\n\r\nChildren of Mana was designed by series creator Koichi Ishii, directed by Yoshiki Ito, and produced by Takashi Orikata and Katsuji Aoyama. The game was a moderate commercial success: it sold 100,000 copies in its first week of release, and over 280,000 copies in Japan by the end of 2006. While critics praised the graphics and music as beautiful and unique, they found the combat simplistic and repetitive, and the story insubstantial.\r\n\r\nLike previous games in the Mana series, Children of Mana features a top-down perspective, in which the player characters navigate the terrain and fight off hostile creatures. The player controls a main character, chosen from one of four options. Each of the characters have different ratings from one to five in four areas: the damage they do with magic, the speed that they can attack, and the amount of health and mana they have.[1] The game plays out nearly identically regardless of which character is chosen, except for a few quests specific to each character. Unlike previous games in the series, the main character typically has no companions during the game; however, a cooperative multiplayer option is present for up to four players, who all appear on each player's screens.[2] This multiplayer mode is only present with local WiFi, and progress is only saved on the host player's game.[3]\r\n\r\nUnlike previous games in the series, which were more typical action role-playing games, Children of Mana is a dungeon crawler, and the majority of the gameplay takes place in selected locations rather than on an open world map. The player selects these areas on the world map to reach them. The primary objective in each location is to clear the dungeon of monsters. Each dungeon is divided into different randomly generated floors, and to progress between each zone, the player must find an item called a Gleamdrop, then carry it to a pillar of light called a Gleamwell.[3] The player must repeat this process on each floor of the dungeon until the last floor is reached, where a boss monster lies.[2] The player can not return to previous floors unless they die or leave the dungeon; upon returning, they start the dungeon over at the beginning.[3] When not clearing dungeons, the player stays in the Mana Village, which contains shops to purchase equipment. Dungeons can be returned to later by accepting quests from townsfolk in the Dudbear shop.[2] During these quests, the dungeon itself is slightly altered: the player's starting position may be different, the number of floors can change, and the monsters and boss monster contained may change. Like the main quests, Dudbear quests involve clearing the dungeon of monsters, sometimes to acquire an item from the end of the dungeon.[1]\r\n\r\nThe game retains the real-time battle mechanics of previous games in the Mana series. The game sports four weapons with their own unique abilities: sword, flail, bow and arrow, and hammer. The player can have two weapons ready to attack with at a time, and any of the four character options can use any weapon. The player can change which weapons they have available at any time. Each weapon has standard normal attacks, special attacks, and fury attacks. The fury attacks are the strongest and require a full Fury Gauge to use, which is filled by striking enemies with standard attacks and taking damage from enemies. Different weapons can have different effects on the environment, such as the hammer's ability to smash pots.[3] In addition to weapons, the player can select from one of eight Elementals, which provide different magical attacks and magical enhancements to weapon attacks. The player can switch between Elementals in the Mana Village. Elemental attacks can be made stronger by equipping Gems, which can also boost the player's attributes.",
  "banner_url": "/games/banner/children-of-mana.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:28:51.170456Z",
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13949
}