{
  "name": "Final Fantasy Crystal Chronicles: Ring of Fates",
  "slug": "final-fantasy-crystal-chronicles-ring-of-fates",
  "year": 2008,
  "platforms": [
    {
      "name": "Nintendo DS"
    }
  ],
  "genres": [
    {
      "name": "RPG"
    }
  ],
  "aliases": [],
  "description": "Final Fantasy Crystal Chronicles: Ring of Fates (ファイナルファンタジー・クリスタルクロニクル リング・オブ・フェイト Fainaru Fantajī Kurisutaru Kuronikuru Ringu Obu Feito) is an action role-playing game for the Nintendo DS, developed and published by Square Enix. It is a prequel to Final Fantasy Crystal Chronicles for the Nintendo GameCube. The game takes advantage of both the local wireless and Wi-Fi capabilities of the system and features voice acting.\r\n\r\nMost of the gameplay takes place on the top screen. The touch screen shows inventory and status as well as stylus access for different weapon attacks. There are also special race-specific attacks in the game. By pressing the right shoulder button, the screens will swap allowing enemies to be attacked by certain races just by touching them with the stylus. If done correctly, chained attacks can be performed.\r\n\r\n    Clavats: formerly an all-rounder class, Clavats are now warriors. They have high attack, defense and HP, but low magic and SP. They wield swords and hatchets.\r\n    Yukes: the Yukes remain a mage class. They have high magic and SP, but low defense, HP and attack. They wield staffs, and attack by firing purple orbs from the staves in a medium-range attack.\r\n    Selkies: the Selkies have been changed into an archer class. Their SP and attack are very high, with average HP and magic, and low defense. They use bows. Selkies also have the unique ability to double-jump.\r\n    Lilties: Lilities have changed from warriors into alchemists. They are capable of creating magicite in their pots, and using the pots for various special attacks and techniques. They wield hammers, maces, and more awkwardly, spoons.\r\n\r\nAs in the previous game, Magicite is required to perform spells, of which 6 types are available; Fire, Thunder, Blizzard, Cure, Clear and Raise (formerly Life). Unlike in the previous game, magicite is consumed when used and remains in the player's inventory between dungeons. In story mode, all characters have a shared inventory for magicites, as well as potions and ethers. Magicite, potions and ethers are used by selecting them from the touch screen, holding the X button to create a magic ring, and then releasing it upon its desired target. Magic rings can also be \"locked\" in position with the L button, allowing a character to cast multiple spells at the same time. Magic rings can also be piled on top of one another to create more powerful spells.\r\n\r\nAs in most RPGs, Ring of Fates features a level-up system, where defeating monsters earns experience points, and sufficient experience points raises a character's level, along with their stats. Ring of Fates features five stats: Hit points, Special points (used for special attacks), Power, Defense and Magic. Experience is shared between party members, with members of lower or higher level getting more or less experience. All races learn new skills after gaining a certain amount of experience, such as charged attacks.\r\nA battle in Final Fantasy Crystal Chronicles: Ring of Fates\r\n\r\nRings of Equipment can be bought or crafted at one of the four stores in the game. Players will find materials and scrolls in the various dungeons; bringing the required materials along with the scroll to the store will enable players to make over 300 different weapons, armor and accessories that change appearance depending on which race makes them. Unlike in the original Crystal Chronicles, the characters' appearance changes depending on what armour they are wearing.",
  "banner_url": "/games/banner/final-fantasy-crystal-chronicles-ring-of-fates.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:30.700138Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}