{
  "name": "Kirby Air Ride",
  "slug": "kirby-air-ride",
  "year": 2003,
  "platforms": [
    {
      "name": "GameCube"
    }
  ],
  "genres": [
    {
      "name": "Racing"
    }
  ],
  "aliases": [],
  "description": "If you can't beat 'em, eat 'em!\r\n\r\nPrepare for fast and furious racing action as Kirby hits Warpstar speed! Use ultra-simple controls to race and battle your friends in one of three hectic game modes. Developed by the same team who brought you Super Smash Bros. Melee, Kirby Air Ride is a true multiplayer masterpiece!\r\n\r\nFeatures\r\n\r\n    Kirby Air Ride is really three games in one. Air Ride, Top Ride and City Trial modes each deliver a unique approach to the intense action found in Kirby's first-ever racing game.\r\n    Gulp down enemies scattered throughout each course to copy their abilities. Unleash the power of Bomb Kirby, Wing Kirby, Freeze Kirby, Sword Kirby, Fire Kirby and lots more.\r\n    Unlock and master 15 Air Ride Machines, each with different features and distinctive control styles.\r\n    Complete 350 hidden challenges to unlock a wide variety of cool special features.\r\n    Use Nintendo GameCube Broadband Adaptors in LAN mode to allow each player to have his or her own personal screen.\r\n\r\n\r\nIn Air Ride mode, you'll race to the finish line against your friends or computer-controlled competition. There are three ways to play in Air Ride mode: Air Ride, Time Attack and Free Run. In Air Ride mode, your goal is to take first place by completing a set number of laps or by going the farthest distance within a set time limit. Time Attack has you racing to beat your best three-lap time, and in Free Run you'll race alone to try to beat your best one-lap time on a course.\r\n\r\nTop Ride mode delivers light-hearted 2D racing action from a sky-high view. Up to four players can race to the finish line using wild items like Buzz Saws, Drills, Freeze Fans and many more to pester the competition. Like Air Ride, Top Ride has three separate modes of play designed to put your racing skills to the test.\r\n\r\nIn City Trial mode, you'll race around a gigantic fantasy city in a quest to build the ideal machine to use in a random challenge that occurs after a set time limit. The more of City Trial's 120 objectives you complete, the larger the pool of random challenges becomes. The challenges cover a wide variety of scenarios, ranging from quick one-lap races to insanely fast drag races. There are literally dozens of challenges to conquer!",
  "banner_url": "/games/banner/kirby-air-ride.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-03-11T04:05:00.806161Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}