{
  "name": "Livalink",
  "slug": "livalink",
  "year": 2012,
  "description": "Do you have what it takes to survive the relentless wrath of the Progeny? Discover, upgrade, unlock, activate and survive. \r\n\r\nSet in a far fetched future, you play as a Reinforced Intergalactic Livalink Trooper (RILT), a special operations organisation involved in the Livalink project. Years of exploration and research have discovered what was once, and wished was still unknown. The discovery of a new race known as ‘the Progeny’ proved violent and reckless, retracing the breadcrumbs of our ventured exploitations back home. \r\n\r\nFight against increasignly difficult waves of Progeny attackers. Experience a variety of unique weaponry, upgrades and combinations that will result in a different gameing experiance eachtime you play. \r\n\r\nLivalink features a variety of unique weaponry and upgrades. Earn credits by collecting kills, bonuses, levels and achievements. These credits will become your best friends, choose wisely how you spend them. Each action in Livalink has a consequence, by spending your hard earned credits on unlocking doors will also activate attached spawn points, making the game increasingly difficulty, however you will discover new equipment and weapons as well a mysterious chest that will thrive on your gambling addiction.\r\n\r\nContent will frequently be added including maps, weapons, upgrades and even new Progeny ai. If you wish to support Livalink’s development simply check out Livalink on Desura or Steam and share the information around!\r\n\r\nKey Features:                                                                        \r\n* Frequent FREE updates and downloadable content.\r\n* Optimised performance suitable for the majority of todays hardware\r\n* Dozens of unique weaponry and upgrades from exploding shotguns to disintegrating lasers.\r\n* Unique variety of enemy Progeny Ai from suicide bombers to electrocuting giants.\r\n* Unlockable areas, weapons, levels, and more.\r\n* Custom soundtracks – composition by Jerel Northern.\r\n* Hidden in-game easter eggs.\r\n* Local high-score leaderboards.\r\n* Five individual difficulty settings and much, much more.",
  "banner_url": "/games/banner/livalink.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:11.902037Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}