{
  "name": "Hacktag",
  "slug": "hacktag",
  "year": 2018,
  "description": "Hacktag is a 2-player co-op stealth-game with an asymmetric gameplay.\r\n\r\nPlay as the stealth Agent in the field or as the Hacker, virtually infiltrating and cooperating to fulfill industrial espionage missions to take down corporations.\r\n\r\nIn 2029, in a parallel world inhabited by anthropomorphic animals, you are a mercenary who secretly accomplishes missions for corporations struggling for leadership. To succeed you will have to team-up with a partner and infiltrate corporations simultaneously in two ways:\r\n\r\n    As the stealth Agent, moving through corporate buildings with an isometric 3D view and fast, arcade-style infiltration gameplay.\r\n\r\n    Or as the Hacker virtually infiltrating the same level with a different view—see the world through holographic blueprint vision and move through a virtual network to interact with the cameras, doors, phones or even coffee machines…\r\n\r\n    The whole Hacktag experience is designed to make the players feel like they are the heroes in a spy or heist movie.\r\n        Online and local multiplayer: Play separately or share the same screen.\r\n        Single player: Simultaneously handle the dual roles of the agent and the hacker in frantic, fast-paced gameplay.\r\n        Original asymmetrical gameplay and co-op mini-games: With the timer ticking, deactivate alarms and unlock doors or holding cells.\r\n        \"Co-opetitive\" gameplay: As mercenaries, your partner is also your best competitor!\r\n        24 levels in 3 corporations and playable in 3 types of missions.\r\n        Gain experience and add unlockable skills: Choose new active or passive skills as you gain levels.\r\n        Online challenges, ranking and leaderboards:\r\n        Full character creation: Customize your anthropomorphic animal character with more than 360 unlockable items.\r\n        Unique story for each player: Experience Hacktag’s story with each role getting its own unique NPCs.",
  "banner_url": "/games/banner/hacktag.jpg",
  "icon_url": "/games/icon/hacktag.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:45.632328Z",
  "steamid": 622770,
  "gogslug": "",
  "humblestoreid": ""
}