{
  "name": "Crash: Mind Over Mutant",
  "slug": "crash-mind-over-mutant",
  "year": 2008,
  "description": "Crash: Mind over Mutant is a platform video game published by Activision in North America and by Sierra Entertainment internationally and developed by Vancouver-based Radical Entertainment for the PlayStation 2, PlayStation Portable (ported by Virtuos), Wii and Xbox 360. The Nintendo DS version of the game was developed by TOSE.[3] It was released in North America on October 7, 2008[1] and was later released in Europe and Australia on October 31.[1] It is the second game in the series not to have a Japanese release, after Crash of the Titans.\r\n\r\nCrash: Mind over Mutant is the fifteenth installment in the Crash Bandicoot video game series, the seventh in the main franchise, and is the second title in accordance to the mutant series' chronology. The game's story centers on the arrival of a popular technological device (a parody of devices such as the iPhone[4] and BlackBerry[5]) that puts whoever uses it under the control of the device's creators Doctor Neo Cortex and Doctor Nitrus Brio, who serve as the stories' primary antagonists.[6] Crash Bandicoot - protagonist of the series and only one unaffected by the device besides his spirit ally Aku Aku - must free his friends from the control of the device and put an end to Doctor Cortex's plot.\r\n\r\nThe title received a generally mixed response, with reviews varying from version to version. The Wii and PlayStation 2 versions were met with generally positive reviews, while the Xbox 360 version received a mediocre critical response. Much of the game's praise went to the humorous cutscenes and dialogue,[7][8] while the unadjustable camera and extensive use of backtracking was sharply criticised.[9][10][11][12] The Nintendo DS version was received negatively for its dull and repetitive gameplay.[13]",
  "banner_url": "/games/banner/crash-mind-over-mutant.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:59.650372Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}