{
  "name": "Phoenix Wright: Ace Attorney - Justice for All",
  "slug": "phoenix-wright-ace-attorney-justice-for-all",
  "year": 2007,
  "description": "Capcom's Unique Court is Back in Session\r\nGet your jurisprudence jones on\r\nEnter a courtroom like no other in the sequel to Capcom's surprise hit Phoenix Wright: Ace Attorney.\r\nFeatures\r\nTake on the role of passionate attorney Phoenix and litigate your way through four shocking new cases\r\nNew “Psyche Lock” feature. Some witnesses may be keeping the truth under tight lock and key. Open their Psyche Locks with a series of correct questions or catch them on their inconsistent testimony\r\nNew life bar represents Phoenix’s status in court. By presenting incorrect evidence or failing to break Psyche Locks, Phoenix’s life bar will go down. The only way to build up his life bar is to successfully open a witness’s Psyche Lock\r\nIntuitive touch-screen play and voice-input play. Yell “Objection,” “Take that” and more!\r\nAs in the first Phoenix Wright game, each case involves two distinct storylines. In the investigation phase, you survey crime scenes, interview witnesses and gather evidence that will be used in court. Then it's on to the court phase, where you pesent findings from the investigation to support your case, listen to testimonies, cross-examine witnesses, and tease out fact from fiction so you can prove your client’s innocence.\r\nThe colorful cast of characters includes:\r\nPhoenix Wright – A rookie defense lawyer with a keen sense for discerning fact from truth\r\nFranziska von Karma – The new DA is the daughter of Phoenix's former adversary, Manfred von Karma. A formidable rival, Franziska is determined to avenge her father by any means necessary\r\nMaya Fey – Adept at the Kurain Channeling Technique, Maya's mystical powers will continue to be a valuable resource for Phoenix\r\nPearl Fey – Maya’s cousin is an up and coming psychic herself who looks to Maya as a role model\r\nThe original Phoenix Wright was one of the cleverest and most off-the-wall DS titles of '05. Expect more in the sequel!",
  "banner_url": "/games/banner/phoenix-wright-ace-attorney-justice-for-all.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:43.868961Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 21870
}