{
  "name": "FlightGear Flight Simulator",
  "slug": "flightgear-flight-simulator",
  "year": 1997,
  "description": "Introduction to FlightGear\r\n\r\nFlightGear is an open-source flight simulator.  It supports a variety of popular platforms (Windows, Mac, Linux, etc.) and is developed by skilled volunteers from around the world.  Source code for the entire project is available and licensed under the GNU General Public License.\r\n\r\nThe goal of the FlightGear project is to create a sophisticated and open flight simulator framework for use in research or academic environments, pilot training, as an industry engineering tool, for DIY-ers to pursue their favorite interesting flight simulation idea, and last but certainly not least as a fun, realistic, and challenging desktop flight simulator. We are developing a sophisticated, open simulation framework that can be expanded and improved upon by anyone interested in contributing.\r\n\r\nThere are many exciting possibilities for an open, free flight sim. We hope that this project will be interesting and useful to many people in many areas.\r\n\r\nProject Overview\r\n\r\nFlightGear is a free flight simulator project. It is being developed through the gracious contributions of source code and spare time by many talented people from around the globe. Among the many goals of this project are the quest to minimize short cuts and “do things right”, the quest to learn and advance knowledge, and the quest to have better toys to play with.\r\n\r\nThe idea for Flight Gear was born out of a dissatisfaction with current commercial PC flight simulators. A big problem with these simulators is their proprietariness and lack of extensibility. There are so many people across the world with great ideas for enhancing the currently available simulators who have the ability to write code, and who have a desire to learn and contribute. Many people involved in education and research could use a spiffy flight simulator frame work on which to build their own projects; however, commercial simulators do not lend themselves to modification and enhancement. The Flight Gear project is striving to fill these gaps.\r\n\r\nThere are a wide range of people interested and participating in this project. This is truly a global effort with contributors from just about every continent. Interests range from building a realistic home simulator out old airplane parts, to university research and instructional use, to simply having a viable alternative to commercial PC simulators.\r\n\r\nFlight Gear and its source code have intentionally been kept open, available, and free. In doing so, we are able to take advantage of the efforts of tremendously talented people from around the world. Contrast this with the traditional approach of commercial software vendors, who are limited by the collective ability of the people they can hire and pay. Our approach brings its own unique challenges and difficulties, but we are confident (and other similarly structured projects have demonstrated) that in the long run we can outclass the commercial “competition.”\r\n\r\nContributing to Flight Gear can be educational and a lot of fun. A long time developer, Curtis Olson, had this to say about working on Flight Gear:\r\n\r\nPersonally, Flight Gear has been a great learning experience for me. I have been exposed to many new ideas and have learned a tremendous amount of “good stuff” in the process of discussing and implementing various Flight Gear subsystems. If for no other reason, this alone makes it all worth while.",
  "banner_url": "/games/banner/flightgear-flight-simulator.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-04-21T14:10:56.217850Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 32245
}