{
  "name": "Lugaru HD",
  "slug": "lugaru-hd",
  "year": 2005,
  "description": "Follow Turner, a rebel bunny rabbit with impressive combat skills in his quest to find those\r\nresponsible for slaughtering his village. Uncover a far-reaching conspiracy involving the corrupt\r\nleaders of the rabbit republic and the wolves of the nearby lands.\r\n\r\nStreamlined Combat: Gone are the days of combo memorization and button mashing.\r\nLugaru uses a context-sensitive combat system to put all the moves at your finger tips. It’s\r\nup to you to choose the right move at the right time and think your way through the fights.\r\n\r\nOpen-Ended Strategy: Each level presents you with an environment and a series of enemies.\r\nHow you choose to defeat your adversaries is entirely up to you. Storm in from the front and\r\nfight everyone at once or ambush your foes one at a time with stealth attacks.\r\n\r\nRagdoll Physics: Not only does striking your enemies do damage, but so does colliding with\r\nthe environment once you’ve knocked them off their feet. Nothing does more damage than a\r\nswift rabbit kick that sends the enemy hurtling into a stone wall.\r\n\r\nEnvironmental Detail: Factors like wind direction and whether or not you remembered to clean\r\nthe blood off your knife affect your ability to sneak up on the enemy undetected.\r\nBrutal AI: Enemies in Lugaru prefer unfair fights. Expect them to shout for back up, attack in\r\ngroups, and exploit any superior weaponry they can find.\r\n\r\nModdability: Turning on Lugaru’s debug mode gives you access to the map editor so you can\r\nbuild your own levels, campaigns and mods. Debug mode also enables crazy cheats that allow\r\nplayers to fly, have infinite health, explode enemies’ heads and set themselves on fire further\r\nigniting anyone who comes too close.\r\n\r\nNew HD Textures: The original Lugaru has gotten a more modern, graphical makeover while still\r\nstaying true to the game’s spirit. Special thanks to Tim Soret for his HD texture pack.",
  "banner_url": "/games/banner/lugaru-hd.jpg",
  "icon_url": "/games/icon/lugaru-hd.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:14.080108Z",
  "steamid": 25010,
  "gogslug": "",
  "humblestoreid": "",
  "id": 166
}