{
  "name": "Horizon Chase Turbo",
  "slug": "horizon-chase-turbo",
  "year": 2018,
  "description": "Horizon Chase Turbo is a racing game inspired by the great hits of the 80's and 90's: Out Run, Lotus Turbo Challenge, Top Gear (SNES), Rush, among others. Each curve and each lap in Horizon Chase Turbo recreates classic arcade gameplay and offers you unbound speed limits of fun. Full throttle on and enjoy!\r\nBACK TO THE OLD-SCHOOL COUCH FRIENDSHIPS\r\nHorizon Chase Turbo offers a Multiplayer Split Screen mode that rescues the nostalgia of playing with your best friends sitting on a couch all night long. The hard time is to know who is your best friend because this one is also the one to be beaten.\r\n16-bit GRAPHICS REINVENTED\r\nHorizon Chase Turbo brings back the graphics context of the 16-bit generation and creates a style that is inspired in the past without letting go of its contemporaneity. The apparent polygon and secondary color aesthetic accentuate the visual beauty of the game, resulting in a unique and harmonic atmosphere. You'll feel the retro soul of the game on a completely modern body.\r\nA WORLD TOUR THROUGH AMAZING HORIZONS\r\nHorizon Chase Turbo is a race around the world. With each new cup, you'll pilot your car through extraordinary places, watching the sun setting, facing rain, snow, volcanic ashes and even severe sandstorms. Be it day or night each track takes place in beautiful postcards from across the world.\r\nBARRY LEITCH, THE COMPOSER BEHIND LOTUS TC, TOP GEAR AND RUSH\r\nHorizon Chase Turbo presents Barry Leitch, the musician behind the soundtracks of classic arcade racing games Lotus Turbo Challenge, Top Gear (SNES) and Rush. As you play the game, you'll be hypnotized by his charming tunes that complement the graphical ecstasy of each horizon.\r\nPC/Mac/Linux TURBO EDITION\r\nHorizon Chase Turbo is the new version of the acclaimed and multi-award winning game “Horizon Chase World Tour”, selected as “BEST OF 2015” having a Metacritic of 88. The Steam Edition brings a lot of unseen features and content that enhance the nostalgia of old-school arcade racing games.\r\nMain Features\r\n\r\n    Thrilling arcade racing game, inspired by Outrun, Top Gear, Lotus Turbo Challenge, and others\r\n    Modern high-quality graphics and UI\r\n    Amazing old-style split-screen multiplayer up to 4 players\r\n    Music by Barry Leitch, Sound Designer in 90s racing classics such as Top Gear and Lotus Turbo Challenge, among others\r\n    Tons of content: 12 Cups, 48 Cities, 109 tracks, 31 Unlockable Cars and 12 Upgrades\r\n    Challenge your friends in an Online Competitive Ghost Mode\r\n    Make History by adding your name among Friends' Leaderboards",
  "banner_url": "/games/banner/horizon-chase-turbo.jpg",
  "icon_url": "/games/icon/horizon-chase-turbo.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:52.176901Z",
  "steamid": 389140,
  "gogslug": "",
  "humblestoreid": ""
}