{
  "name": "Conquests of the Longbow: The Legend of Robin Hood",
  "slug": "conquests-of-the-longbow-the-legend-of-robin-hood",
  "year": 1990,
  "platforms": [
    {
      "name": "MS-DOS"
    },
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Adventure"
    },
    {
      "name": "Fantasy"
    },
    {
      "name": "Point-and-click"
    }
  ],
  "aliases": [],
  "description": "Live the Legend of the Longbow\r\n\r\n\r\nThe Gauntlet has been Dropped\r\nThe most intriguing and enduring outlaw of all time comes to life in Sierra's richest, most complex game yet. To survive, you must use compassion as well as wits and cunning.\r\n\r\nThink Fast. Choose Well.\r\nArmed with logic, creativity and moral judgement, you'll face some of the most intricate and challenging puzzles you've ever seen. Many puzzles have multiple solutions with varying implications - some more desirable than others. Even the game itself has at least five possible endings.\r\n\r\nMagic, Beauty, Motion and Music.\r\nThe art of Robin Hood is inspiring. Created with the brilliant palette of an illuminated medieval manuscript, it's a festival of light and color. Experience the splendor of 12th century England, from the grime of Nottingham to the vibrancy of Sherwood. The detailed video-captured animation is fluid and varied; most characters you meet have unique animated portraits.\r\n\r\nDesigner Christy Mars, creator of the critically acclaimed Conquests of Camelot, once again blends history, legend and pure magic to create a breathtaking adventure game.\r\n\r\nFEATURES:\r\n\r\n    More puzzles than any previous Sierra adventure game.\r\n    Arcade sequences with adjustable levels of difficulty, including auto-win.\r\n    Original soundtrack based on medieval music styles, using the sounds of period instruments.\r\n    A no-typing, point-and-click interface.",
  "banner_url": "/games/banner/conquests-of-the-longbow-the-legend-of-robin-hood.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:57.606734Z",
  "steamid": null,
  "gogslug": "conquests_of_the_longbow",
  "humblestoreid": ""
}