{
  "name": "Castles",
  "slug": "castles",
  "year": 1991,
  "description": "Welcome to the world of Castles. As a lord or lady of the realm, you've built the castle of your dreams, battled bloodthirsty dragons, engaged in brutal treachery, sent troops abroad to war, and defended your land against marauding enemies. But they're still not happy. Maybe you shouldn't have poured hot oil on their heads...?\r\n\r\nAnd now, with \"Castles II: Siege and Conquest\" you can experience even more. It is the year 1311. The King of France just died and because King Charles didn’t have any heir it is up to you to take control of as much of France as you can. If you manage the Kingdom properly and the Pope gives you the blessing, then you will become the King of France.\r\n\r\nCastles and Castles 2, bundled together are games of medieval diplomacy, treachery and power. To win you must survive. To survive you must scout the surrounding territories, defeat the local militias, subjugate the land with castles, feed and maintain the people, forge diplomatic alliances, appease the church and unite the land under your iron fist.\r\n\r\nThere's more. Now you can watch 30 minutes of BBC documentary footage which shows you how and why castles were constructed, planned, besieged and attacked prior to the age of gunpowder. Using this knowledge, you can create your own original castle designs to play against your computer opponents. Or, you can choose from 10 historical castles for your own personal fortress.\r\n\r\n    Real-time battles in a turn-based strategy\r\n    The ability to design your own fortress\r\n    Interesting historical videos giving you some insight into castle building",
  "banner_url": "/games/banner/castles.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-05-31T00:17:37.256743Z",
  "provider_games": [
    {
      "name": "Castles",
      "slug": "1207663063",
      "service": "gog"
    }
  ],
  "steamid": null,
  "gogid": 1207663063,
  "gogslug": "castles",
  "humblestoreid": "",
  "id": 25918
}