{
  "name": "BattleTech: The Crescent Hawks' Revenge",
  "slug": "battletech-the-crescent-hawks-revenge",
  "year": 1990,
  "platforms": [
    {
      "name": "MS-DOS"
    },
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Turn-based tactics"
    }
  ],
  "aliases": [],
  "description": "The year is 3029, and you are 19-year-old Jason Youngblood of the Lyran Commonwealth (House Steiner). Not long ago, the Draconis Combine (House Kurita) captured your father, Jeremiah Youngblood, the best Phoenix Hawk pilot alive (as detailed in BattleTech: The Crescent Hawk's Inception from Infocom). You are sworn to rescue him, relying on the extensive battle training you've received since the age of nine.\r\n\r\nYou fought hard to build up your Lance of four BattleMechs, the most powerful fighting machines in the galaxry, and you recruited three true friends to join you as MechWarriors. You know that in the years ahead you'll prove your military prowess to Katrina Steiner, your patroness, but all that matters now is finding your father.\r\n\r\nThe most likely place to get information about your father's whereabouts is on the planet Lyons, home base of the Kell Hounds. Your father was once a member of this famous mercenary Mech regiment, and you feel certain that they will help you.\r\n\r\nBut as your DropShip approaches Lyons, Kurita AeroSpace Fighters zero in to ambush you, and your transport is forced to crash land in a lake. The ship is sinking, your 'Mechs are trapped, and a Kurita light 'Mech, a Locust, is approaching at full speed to blow you out of the water. The only thing standing between you and certain destruction is a damaged Kell Hound Jenner, manned by a green recruit.\r\n\r\nDo you have the ability to take command and win a hopeless battle? If so, then perhaps you have what it takes to face the fiercest land battles the Inner Sphere has ever seen...",
  "banner_url": "/games/banner/battletech-the-crescent-hawks-revenge.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:33.586041Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}