{
  "name": "Mario & Luigi: Bowser's Inside Story",
  "slug": "mario-luigi-bowsers-inside-story",
  "year": 2009,
  "description": "Mario & Luigi: Bowser's Inside Story[a] is a role-playing video game developed by AlphaDream and published by Nintendo for the Nintendo DS handheld game console in 2009. It is the third game in the Mario & Luigi RPG series.\r\n\r\nThe game's plot involves Mario and Luigi being inhaled into the body of their long-time nemesis, Bowser. The Mario brothers learn to assist Bowser, who is unaware of their presence, as he combats Fawful, who has taken control of the Mushroom Kingdom. The gameplay focuses on the co-operation of the trio, who use their specific abilities to solve puzzles and fight enemies and thus progress through the game. Similar to its predecessors, its role-playing style emphasizes a turn-based battle system focused on timing accuracy, and is comedic in nature.\r\n\r\nBowser's Inside Story was first revealed at Nintendo's Tokyo Press Event on October 2, 2008,[1] and its English title and Western release dates were announced at E3 2009.[2] The game was both critically and commercially successful, gaining an aggregate score of 91% from GameRankings[3] and 90 from Metacritic,[4] and selling 4.13 million copies worldwide as of April 2011\r\n\r\nGameplay alternates between three characters, Mario and Luigi, who are controlled together using A and B on the bottom screen, and Bowser, who is controlled with X and Y on the top screen. There are two main worlds, the main overworld, which is played in an overhead view, and the world inside Bowser's body, which is a 2D side-scrolling world. Although most of the game is played with Mario & Luigi inside Bowser and Bowser himself in the overworld, Mario and Luigi also have opportunities to visit the overworld via pipes as the game progresses. Gameplay typically alternates between controlling the brothers and controlling Bowser. Some sections involve direct interaction between the brothers and Bowser in order to progress.\r\n\r\nThe battle system from the previous two games returns, this time with Bowser as a playable character. Bowser's battles are similar to Mario & Luigi's, albeit it he specializes in punching and breathing fire. During Bowser's battles, he can inhale to suck up defenses and enemies from the top screen similarly to the character Kirby from another Nintendo series. Any enemies inhaled will enter his body, where Mario & Luigi will fight them instead. Along with Mario & Luigi's Bros. Attacks, Bowser has his own set of special attacks that use the touchscreen. As Mario and Luigi can unlock new abilities by finding attack blocks, Bowser can earn new abilities by rescuing his caged minions, or by finding living, kitten-like blocks called Blitties.\r\n\r\nA new ranking system is introduced in which, after a character has reached a specific level, his rank will increase. Upon reaching these milestones, that character will receive a special bonus, such as an additional equipment slot, being able to visit specific shops or receiving a certain piece of equipment. Mario and Luigi each have six ranks, but Bowser has four. The badge system from previous games has also changed, now possessing effects that Mario and Luigi can use by charging a meter with attacks. When the meter is filled, players can touch the meter to activate its effect, which varies depending on the combination of badges equipped, such as health recovery or stat raising.\r\n\r\nVarious minigames are present, in which the Mario Bros. will have to help out Bowser's body from the inside in order to help him progress. Examples include the \"Arm Center\", where the brothers hit spark-like items into a muscle to strengthen Bowser's arms; the \"Leg Outpost\", where they stomp on leg muscles to strengthen Bowser's legs; and the \"Gut Check\", where they help digest food that Bowser eats. One location, the \"Rump Command\", has the player accumulate adrenaline in order to supersize Bowser if he is crushed, leading to a new battle system in which the DS is held vertically like a book and all attacks require the stylus and microphone.",
  "banner_url": "/games/banner/mario-luigi-bowsers-inside-story.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:17.682788Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}