{
  "name": "PGA Tour Golf 486",
  "slug": "pga-tour-golf-486",
  "year": 1994,
  "description": "Electronic Arts has finally upgraded their golf simulation to more pleasing and realistic levels. PGA Tour Golf 486 is filled with noticeable improvements over the previous releases in this line and the conversion from game platform to personal computer is now worthy of note. Immediately apparent is the gorgeous photo-realistic graphics which enhance game play tremendously. Another new feature is the elimination of the graphically challenged cartoon-like figures of previous releases and the advent of realistically portrayed golfer animations. One great option is the opportunity to play either as one of the nine PGA pro simulations that come with the game or against them in one of four possible modes. The pros include Brad Faxon, Fuzzy Zoeller, Bruce Lietzke, Tom Kite, Jeff Sluman, Davis Love III, Lee Janzen, Mark O'Meara and Craig Stadler. Yet another improvement is the replacement of the unfriendly sliding bar shot maker with a more visually pleasing swing arc that serves as the accuracy and power meter.\r\n\r\nThe graphics in PGA Tour Golf 486 are beautifully rendered and exude life-like properties. The three courses that ship with the game are all Tournament Player Club courses and include the challenging TPC at Sawgrass (Florida), TPC at River Highlands (Connecticut) and TPC at Summerlin (Nevada). Obviously, the three totally different types of courses were selected by the designers in a successful attempt to offer diverse golfing experiences and each is represented by a video overview of the course. Game play is smooth and on a 486/33 or higher, screen redraw times are endurable, although use of a 386 will cause a noticeable slowdown. However, if the player is experiencing slow reloads there are customizable options that will greatly increase the speed at a price of giving up some of the features that make the game such a sensory delight. For example, the Snap-Around option which allows the player to view the ball as it lands rather than from the originating point of the shot can be turned off. Other time savers include options to toggle off the music, commentary (not really necessary) and sounds but a more effective adjustment is the level of detail (numbers of objects required to be drawn).\r\n\r\nA great number of options are available for enhancing play such as being able to put spin on the ball, drawing or fading your shot, grids on the greens to help recognize the contours, instant replay, setting conditions for wind (calm, breezy or windy), fairways (damp, normal and dry), and greens (slow, fast or normal) as well as mulligan and gimmie rules. Tournament mode is offered which may well be the best option of all for emulating competition plus options for stroke, match and skins play. PGA Tour Golf 486 holds it's own in terms of playability and meaningful options when compared to other golf simulations. A huge step up on the computer golf evolution scale for Electronic Arts.",
  "banner_url": "/games/banner/pga-tour-golf-486.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-05-21T06:50:29.188194Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 27404
}