{
  "name": "A Kiss For The Petals - Maidens of Michael",
  "slug": "a-kiss-for-the-petals-maidens-of-michael",
  "year": 2018,
  "description": "Picking up from the famous, original A Kiss for the Petals titles, Maidens of Michael reintroduces the five couples fans have grown to know and love while expanding on their story, sharing many new months worth of development as their relationships lose their freshness and encounter the hardships of long term love. As these ten girls learn how to manage life and love, grow, and support each other, a new budding couple is introduced as well.\r\n\r\nToday at Saint Michael Girls' School, the class representative for the first-year “Snow” Class, Azumi Risa, had once again been fighting with the class troublemaker, Ayase Miya. Risa, who is earnest and hard-nosed, and Miya, who hates to cooperate with others, couldn’t have been less right for each other, as they were always on the verge of tearing each other’s throats out.\r\n\r\nAt the time, the whole school was in a festive mood with Christmas just around the corner. As couples and spur-of-the-moment couples alike were flirtatiously carrying on, the whole school was abuzz with excitement over the “St. Michael’s Best Couple” poll being conducted by the student volunteers. Risa, who was single, figured it didn’t concern her…\r\n\r\nSo then how did she and Miya end up being chosen?!\r\n\r\nAlthough Risa naturally denied that they shared that kind of relationship, the classmates who had selected them would just smile with the reasoning of tempered young ladies who had been raised in respectable families and say, “You always look like you’re having so much fun.” Resigning themselves, the two decided to go along with it, “Just for appearance’s sake,” and it seemed they would have to stick it out through the coming holidays of Christmas and Valentine’s Day along with four other couples as the committee members for various events.\r\n\r\nAnd what’s more…\r\n\r\nThose other four couples were practically the student council:\r\n\r\nThe president of the Campus Improvement Committee, Matsubara Yuuna, and her junior, Oda Nanami.\r\n\r\nThe renowned student model, Kitajima Sara, and her cousin, Kitajima Kaede.\r\n\r\nThe singing sensation of the culture festival, Kawamura Reo, and her girlfriend, Sawaguchi Mai.\r\n\r\nAnd last, but not least, the girls of the Lily Platinum fan club, exchange student Shitogi Eris, and the school’s foremost scribe, the highly respected Kirishima Shizuku.\r\n\r\nIn other words, only the most preeminent couples on campus.\r\n\r\nWill the big name couples be able to handle the events that follow? And will Risa be able to survive the lovers’ holidays of Christmas and Valentine’s with Miya?",
  "banner_url": "/games/banner/a-kiss-for-the-petals-maidens-of-michael.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-05-31T00:17:33.844502Z",
  "steamid": null,
  "gogslug": "a_kiss_for_the_petals_maidens_of_michael",
  "humblestoreid": "",
  "id": 24257
}