{
  "name": "Mario vs. Donkey Kong 2: March of the Minis",
  "slug": "mario-vs-donkey-kong-2-march-of-the-minis",
  "year": 2006,
  "description": "Mario vs. Donkey Kong 2: March of the Minis[a] is the sequel to the Game Boy Advance game Mario vs. Donkey Kong released in 2006, a follow up to the Game Boy Donkey Kong game, though it is more puzzle-oriented, now that the player controls several Mini Marios with the touch screen instead of Mario himself. The game also features the return of Pauline, whose last appearance was in the 1994 Donkey Kong game, a Game Boy remake of the original Donkey Kong. It features Nintendo Wi-Fi Connection. The DS Download Station Series 3 set of games features a short demo of the game. This is the sixth Mario game for the Nintendo DS. A sequel, called Mario vs. Donkey Kong: Minis March Again!, was released in June 2009; it is available for download via the DSiWare service for 800 Nintendo Points.\r\nInstead of controlling with the D-pad, Mario vs. Donkey Kong 2: March of the Minis uses the touch screen to control the Mini-Marios in the same vein as Lemmings. To move, the player must use the stylus to turn a Mini-Mario's direction to move them in that direction. Swiping up enters pipes, climbs ladders, or makes them jump. Swiping across the Mini-Marios left or right causes them to move in that direction, and swiping down causes them to enter a pipe that is below their feet. Tapping once causes them to stop. The D-Pad and the face buttons move the camera (i.e. X and Up move the camera up), and in DK stages pressing L and R causes a line to appear temporarily showing the path the launched Mini-Mario will take. The timer does not start until the player either moves blocks or taps a Mini-Mario. However, the player may move elevators, change the direction of pipes or conveyor belts, and scout the level out without starting the timer.\r\n\r\nThe game consists of eight worlds, or floors, each with nine levels, or rooms, a minigame, and a DK stage. In addition to these levels are the Roof, which consists entirely of the final DK stage, and the Basement, which consists of two extra boss stages that are only accessible by earning 40 Silver stars and 40 Gold stars. When a chain of Mini-Marios enters the door at the end, a combo occurs, meaning 1000 for the first, 2000 for the second, 4000 for the third, etc. If the stage contains a Gold Mini-Mario and it is the end of the chain, the point bonus doubles. For instance, if there are two normal Mini-Marios and a Gold Mini-Mario in a stage, and they enter in that order, the points will go like this: 1000, 2000, 8000. At the end of every room, the player's score is tallied up with 100 points for each second remaining. The player may also earn any combination of three bonuses: All Minis, which means every Mini-Mario made it into the door; Perfect Chain, which means that there was no break between Mini-Marios entering the door; and Nonstop, which means that at least one Mini-Mario was not stopped by being tapped with the stylus (stopping on elevators or waiting for platforms don't ruin this bonus). There are three medals, or stars, that can be earned upon meeting their requirements; Bronze, Silver, and Gold.\r\n\r\nIn each room there are cards and coins. Collecting all nine cards in a floor will spell out MINIMARIO and unlock that floor's minigame. The minigame involves tapping ShyGuys as they come out of pipes and avoiding the Bob-Ombs that occasionally come out as well. There are two types of coins: small and large. Small coins are worth 50 points and large ones are worth 500. Collecting coins will definitely help in meeting the score required for a Gold Star.\r\n\r\nThe DK stages play a bit differently from the main game. In these stages the bottom screen shows a cannon loaded with a Mini-Mario, a belt upon which the cannon moves on, and a button labeled Shoot that the player must tap to fire the Mini-Mario. The top screen shows your remaining hits, which depends on how many Mini-Marios the player led to the door throughout the entire floor, DK's remaining hits, which always starts out at six, DK's location, and objects the player needs to hit with a Mini-Mario in order to damage him. If a Mini-Mario collides with DK's side, that will damage him as well. The only way to get lose your own health is if your Mini-Mario is hit with an object or if DK breaks it. DK's movement varies with the stage. In some, it is like the shell game in that there are three locations he can appear and you can somewhat guess where based on a pattern. In the others, he is on a swinging platform that will kill a Mini-Mario if the Mini-Mario collides with it. Floor 8's DK Stage involves him moving between vines. Once the player hits DK six times, the stage ends and the score is tallied up with 100 points for each second remaining and 1000 points for each surviving Mini-Mario. The extra three DK stages are modeled after stages in the original Donkey Kong arcade game.",
  "banner_url": "/games/banner/mario-vs-donkey-kong-2-march-of-the-minis.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:17.807393Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13984
}