{
  "name": "Jungle Strike: The Sequel to Desert Strike",
  "slug": "jungle-strike-the-sequel-to-desert-strike",
  "year": 1992,
  "description": "he player controls a helicopter - a Boeing AH-64 Apache or a similar type - equipped with three ammunition types, limited fuel and armor. While there are refits for ammo, fuel and armor scattered around the map, armor is more easily repaired by rescuing and delivering POWs, allied soldiers or other passengers to a landing point. If either armor or fuel reach zero, the aircraft crashes and a life is lost.\r\n\r\nLevels are composed of several missions that can be completed in any order but it is often better to complete them sequentially, as completing an earlier mission will make later ones easier. This is because the objectives of later missions are usually protected by a \"Danger Zone\" which gives enemies in the area increased weapon range, firepower and damage as well as additional armor. A \"Danger Zone\" can be removed by the destruction of a radar or power plant, often the objective of an earlier mission. Later levels will often present only one mission that must be completed to reveal the next one. Missions can range from destruction of enemy targets, rescuing a MIA soldier who carries vital information, protecting friendly troops, capturing or eliminating an enemy leader, or delivery of friendlies or cargo to a drop zone. Between each level cut-scenes developing the story take place.\r\n\r\nThere are several kinds of enemies, from foot soldiers armed with rifles to powerful anti-aircraft systems and enemy helicopters. Generally the player has no backup, and must deal with the opponents on his own, though both Soviet Strike and Nuclear Strike incorporate missions involving large amounts of allies.\r\n\r\nThe player can lose a game in several ways; by losing all his lives or through an action that makes a mission impossible to complete. These include destroying a mission critical object, killing someone who was to be captured or rescued, killing too many friendlies, allowing an objective to leave the battlefield, failing to protect a friendly target from being captured or destroyed, destroying your home base or landing zones, or waiting too long to complete a mission objective. After such an occurrence, the player must return to his home base and the level restarts from the beginning. In Soviet Strike and Nuclear Strike, if a player fails to return they are warned to return to base and after three warnings, STRIKE shuts down the players vehicle and the level will be restarted.\r\n\r\nThe series was militaristic in nature, with each enemy sprite having a corresponding information section in the pause menu, relating details of the real world weapon (or a fictionalized version, in the case of non-existent weapons, such as the Mohican helicopter from Urban Strike). The next generation titles, Soviet Strike and Nuclear Strike, featured plots based heavily on present day geopolitics, such as the instability of post-USSR states, or tensions at the DMZ between North and South Korea. However, in contrast, the games often displayed a quirky sense of humor, featuring numerous appearances by Elvis including outside a castle where he cannot be killed or even harmed, he just laughs at you and even Santa Claus, as well as wisecracks from the player character in the earlier games (in Urban Strike, the player's character, on being told the villain is an evil genius, comments: 'Great, another evil genius. Why can't I ever fight an evil idiot?') Although ostensibly serious in nature, the games were often quite tongue-in-cheek in their execution.",
  "banner_url": "/games/banner/jungle-strike-the-sequel-to-desert-strike.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:01.599326Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}