{
  "name": "Cursed Lands",
  "slug": "cursed-lands",
  "year": 2018,
  "description": "Recruit. Investigate. Infiltrate.\r\n\r\nA mysterious mist has spread over the plains surrounding the Castle of M'Mar, and the mists carry with them the smell of undeath. The blight grows closer to the Empire's borders with every passing day, and they send an expedition to investigate—with disastrous results. The Empire's remaining forces regroup and devise an alternative plan, this time based on concealment and infiltration.\r\n\r\nYou assume the role of the Empire's Envoy, secretly serving the Grimoire Council. You must assemble a small strike team to investigate what is happening, and put a stop to whatever evil is lurking within the Castle of N'Mar.\r\n\r\nWith the help of Karen the Amazon Queen and Apolimesho the Archwizard, you'll need to recruit a team of individuals, united by a common goal, from all corners of Aravorn. Dwarves, elves, amazons, desert nomads, and river nagas can all be persuaded to join you.\r\n\r\nThe game plays like a RPG with an innovative social talent system that lets you take advantage of your enemies' personalities. You can bluff, intimidate, coerce, or reason with your foes to force them to flee. Negotiate a ceasefire to end things peacefully—or take advantage of your foes' weakness after you've lulled them into a false sense of safety. Killing all enemies is no the longer the only option at your disposal. The game also includes a \"visual novel mode\" for those who want to enjoy the story without playing through the battles.\r\n\r\nCursed Lands offers four bisexual romance options (Nuala the desert nomad, Vaeril the fallen druid, Sylrissa and Enok the nagas) and two same-sex romance options (Leena the amazon and Jasper the pirate).\r\n\r\nFor the first time in a Winter Wolves game, you can sleep with multiple love interests. Of course, be ready to face any possible consequences! Each love interest's ending leads to two more bonus scenes with \"pin-up\" CGs for the character you've coupled with.",
  "banner_url": "/games/banner/cursed-lands.jpg",
  "icon_url": "/games/icon/cursed-lands.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:02.793213Z",
  "steamid": 758320,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 20693
}