{
  "name": "Hyrule Warriors: Legends",
  "slug": "hyrule-warriors-legends",
  "year": 2016,
  "description": "Tetra and the Hyrule Warriors come to the Nintendo 3DS system\r\n\r\n\r\n\r\n\r\nBonus: Get a download code for a free Hyrule Warriors Legends theme* & new characters to the Hyrule Warriors™ game for the Wii U™ console ** when you purchase the Hyrule Warriors Legends game for the Nintendo 3DS™ family of systems in the Nintendo eShop. You’ll find the download code for the free theme and character set on your Nintendo eShop receipt.\r\n\r\nThe Hyrule Warriors Legends game is only playable in 3D with a New Nintendo 3DS or New Nintendo 3DS XL system.\r\n\r\n*Free Hyrule Warriors Legends theme available for download starting 3/24/16 9:00 p.m. PT.\r\n\r\n**Free Hyrule Warriors character set available for download starting 3/24/16 9:00 p.m. PT. Additional systems and software required; sold separately.\r\n\r\nCut down entire legions of enemies as fan-favorite Legend of Zelda™ characters using powerful moves as Hyrule Warriors comes to the Nintendo 3DS™ system. Control multiple characters to enhance your strategies and enjoy new story elements with playable characters from The Legend of Zelda™: The Wind Waker, such as Tetra, King Daphnes, and more.\r\n\r\nWar rages as the delicate balance of the Triforce is disrupted. The kingdom of Hyrule is once again being torn apart by a dark power, this time lead by Sorceress Cia. Now it's up to the legendary hero Link™ to face hordes of enemies and find the missing Princess Zelda™. Advance the story to unlock new playable characters, each with unique moves and weapon types. Collect Rupees and other useful items to upgrade weapons and craft badges, which you can use to bolster each warrior's abilities.\r\n\r\nContains content from the original Hyrule Warriors™ game, released on the Wii U console\r\nNew characters and story elements based on The Legend of Zelda™: The Wind Waker\r\nNew character-switching feature lets you change and command characters on the fly\r\nPlay as fan-favorite characters like Tetra and the King Daphnes for the first time in the series!\r\nBattle the fiercest Legend of Zelda™ enemies across Hyrule's most famous locales",
  "banner_url": "/games/banner/hyrule-warriors-legends.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-06-16T20:35:44.596954Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 37297
}