{
  "name": "Sage Fusion",
  "slug": "sage-fusion",
  "year": 2015,
  "description": "Sage Fusion is a hybrid between Role-Playing Game (RPG), adventure game, and visual novel, featuring turn-based battle system, more than 70 hand-drawn background and story illustrations, and an engaging space opera storyline that is told through the gameplay. Explore the futuristic city of Capistad, the capital of the Galactic Union.\r\n\r\n\r\nStory:\r\n\r\nAlvonse Brin watched intently at the two blasters gripped firmly in his hands. Tomorrow I may have to use these again. Just as he thought that, he realized how funny it was. In the outer space, there was no real concept of days. It wasn’t as if the spaceship he was traveling in rotated along its axis or revolved around a star. Yes, he was in a spaceship. The spaceship belonged to a man named Marlon Ziglar, a wealthy businessman who had hired him as a bodyguard. Apparently Mr. Ziglar was going to meet a very important client in Capistad, the capital planet of the Galactic Union, and Alvonse was to accompany and protect this man. What would they find in Capistad? As Alvonse pondered that, he put down his blasters on top of a small desk in his cabin, headed to his bed, and tried to get some rest, for tomorrow — again, he thought of the word — he would arrive in Capistad.\r\n\r\nIn another place, two agents from Tarrant Guild were cautiously and silently approaching the main temple in the Neo Vatican complex. It wasn’t that long ago that Vientiane Blaise had officially become a Tarrant spy, but already today she had to infiltrate the center of the Zeian Church. The Zeian Church was a powerful force in the galaxy, as the majority of citizens in the Galactic Union were Zeians. While she herself was not a Zeian, Vientiane still had mixed feelings about this mission. What exactly was in Neo Vatican?\r\n\r\n“Vi, your cloaking device.” Vientiane was startled and immediately shifted her attention to her mentor, Florence Waverly. Florence always shortened her name to “Vi,” but Vientiane did not dislike that. Florence was a strict mentor, and was easily annoyed especially by Vientiane’s lack of experience, but she was also the only person Vientiane could honestly call a friend.\r\n\r\n“Okay, Flo.” Vientiane answered faintly, trying not to draw attention from the guards standing a mere hundred meters away from where she and Florence were. The two agents drifted gracefully from behind a pillar to another, staying hidden from prying eyes of the guards. Alas, as she was closing in on the entrance of what seemed like a corridor, she suddenly felt her gaze meeting a guard’s. Oh no, I forgot about the cloaking device.",
  "banner_url": "/games/banner/sage-fusion.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:31:06.193699Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 4291
}