{
  "name": "Inazuma Eleven",
  "slug": "inazuma-eleven",
  "year": 2011,
  "description": "nazuma Eleven (イナズマイレブン Inazuma Irebun, \"Lightning Eleven\") is a role-playing sports video game for the Nintendo DS developed and published by Level-5. It was released on August 22, 2008 in Japan. A European release was confirmed by Nintendo and was released on January 29, 2011, three years after the Japanese release. The UK release was held back to 26 August 2011 for marketing reasons.[citation needed] The European release was updated with additional features from the sequel, Inazuma Eleven: Firestorm / Blizzard.\r\n\r\nThe game was included in an updated re-release compilation titled \"Inazuma Eleven 1-2-3: Endo Mamoru's Legend\" for the Nintendo 3DS, released on December 27, 2012 physically and digitally exclusively in Japan. It was based on the Japanese Nintendo DS version of Inazuma Eleven, updated with stereoscopic 3D and updated graphics. A Nintendo 3DS eShop port based on that compilation, and featuring a new dub, was the series' North American and Australian debut on February 13, 2014, directly after that month's Nintendo Direct announcement.\r\n\r\nSince the game's launch, it has received two sequels for the Nintendo DS; Inazuma Eleven: Firestorm / Blizzard and Inazuma Eleven 3: Sekai e no Chousen, as well as three spin-offs for the Wii: Inazuma Eleven Strikers, Inazuma Eleven Strikers 2012 Xtreme, and Inazuma Eleven GO Strikers 2013. The third sequel to the main series, which takes place 10 years after the events of the third game, Inazuma Eleven GO, is available on the Nintendo 3DS.\r\n\r\nAn Inazuma Eleven manga based on the games began serialization in CoroCoro Comic on May 15, 2008, while an anime based on the games, produced by OLM, started airing on October 5, 2008. Mitsui has also created a collectible card game tie-in.[1][2] The game served as the debut of a J-pop idol group, Twe'lv.\r\n\r\nThe main character, Mark Evans (円堂 守 Endō Mamoru), is a very talented goalkeeper and the grandson of the late David Evans (円堂 大介 Endō Daisuke), one of the strongest goalkeepers in Japan and coach of the legendary football team, the Inazuma Eleven (though Mark is unaware of this). He is captain of his school's (Raimon Jr. High) football team, and dreams of competing in the Football Frontier tournament one day. Unfortunately, the club is on the verge of disbanding, as the other members seem uninterested in training.\r\n\r\nOne day, a mysterious forward named Axel Blaze (豪炎寺 修也 Gōenji Shūya) moves to Mark's school. Axel used to be the top striker at his old school, and has gained the attention of Royal Academy (led by team captain Jude Sharp and principal Ray Dark), the most prestigious school in the area. They come to Raimon and challenge them to a football match, despite Axel refusing to join Raimon's team. They are much more powerful than anticipated, and Raimon's out-of-practice players take a horrible beating. Axel decides to join the team to help them out, and his sudden appearance surprises Royal, which he uses as an opportunity to score a goal. As the first goal scored against Royal Academy in years, Jude counts it as a win for Raimon and leaves with his team.\r\n\r\nThe victory gets Raimon a lot of attention, allowing them access into the Football Frontier tournament, which they gladly accept. They prove themselves as a force-to-be reckoned-with, winning all of their matches and reaching the finals. Before the match, Ray Dark uses the team's coach to spy on them, and orders him to kill them by draing the brake fluid from their bus. Fortunately, his plan is foiled by Nelly, the school counsellor's daughter, who promptly gets the teacher fired. At the match, Dark tries to kill them again, this time by crushing them with girders. They survive thanks to a warning from Jude, and Dark is promptly arrested by a detective known as Smith. The match goes on, and after a long battle, Raimon emerge victorious.\r\n\r\nThe team then move onto the Football Frontier nationals, but learn they will be unable to compete without a coach. Detective Smith points Mark in the direction of a man named Seamore Hillman, who used to be part of Raimon's team from forty years ago, the Inazuma Eleven. Hillman explains that the team was coached by Mark's grandfather, David Evans (much to Mark's surprise), and that they were unstoppable force: the best team of their time! This excites Mark, until Hillman tells him about how their run was ended when their bus crashed on the way to their last Football Frontier match, injuring the players and preventing them from competing.\r\n\r\nDespite his unfortunate past, Hillman agrees to be the team's coach, and also gets the team training with the now-elderly members of the Inazuma Eleven. This training helps them win their next few matches, along with the assistance of Jude, Royal's captain. He tells him Royal were completely destroyed by a team called Zeus Jr. High, who, unbeknownst to them, is being led by Ray Dark. Zeus also continue to win all their games, each time leaving their opponents unable to continue. This means the final will be Raimon versus Zeus.\r\n\r\nWhen Raimon arrive at the stadium for the finals (which is a floating palace in the sky), they see the members of Zeus drinking so-called 'ambrosia', which turns out to be filled with drugs to improve their abilities. The first half begins, and Zeus begin winning instantly thanks to the ambrosia; benching most of the players and scoring goal after goal. As the first half ends, Nelly realises that the drinks are spiked, and goes to switch the drinks with regular water. Her plan succeeds, and Zeus are forced to play through the remainder of the game as a normal team, allowing Raimon to seize victory and win the Football Frontier.",
  "banner_url": "/games/banner/inazuma-eleven.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:55.871580Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}