{
  "name": "Phoenix Wright: Ace Attorney",
  "slug": "phoenix-wright-ace-attorney",
  "year": 2005,
  "description": "Phoenix Wright: Ace Attorney[a] is a visual novel adventure video game developed by Capcom. It was originally released for the Game Boy Advance in 2001 in Japan, and has since been ported to multiple platforms. The Nintendo DS version, titled Gyakuten Saiban Yomigaeru Gyakuten in Japan, was released in 2005 in Japan and North America, and in 2006 in Europe, and includes an English language option. The game is the first entry in the Ace Attorney series, and has received several sequels and spin-offs.\r\n\r\nThe story follows Phoenix Wright, a rookie defense attorney who attempts to get his clients declared \"not guilty\". Among other characters are Phoenix's boss, Mia Fey; his assistant and Mia's sister, Maya; and prosecutor Miles Edgeworth. The player controls Phoenix through two types of sections: investigations and courtroom trials. During investigations, they gather information and evidence, and during trials, they cross-examine witnesses and answer questions from the judge, the prosecutor, and the witnesses. The story is split into five cases, the fifth being introduced in the Nintendo DS version to take advantage of gameplay elements using the handheld's touchscreen and not available in the original Game Boy Advance version.\r\n\r\nDevelopment of the game was handled by a team of seven people over the course of ten months. It was directed and written by Shu Takumi, and was originally planned to be a Game Boy Color game about a private investigator. The game was designed to be simple, as Takumi wanted it to be easy enough for even his mother to play. While the original version of the game takes place in Japan, the localization is set in the United States; this became an issue when localizing later games, where the Japanese setting was more obvious.\r\n\r\nThe game has been mostly positively received by critics, who have appreciated its premise, writing, characters and presentation. The game has been a commercial success both in Japan and internationally, with the North American release selling higher than expectations and being hard to find in stores shortly after release. Other media based on the game has been made: a manga series premiered in 2006; a film adaptation of the game, titled Ace Attorney, premiered in 2012; and an anime series adaptation started airing in 2016.\r\n\r\nPhoenix Wright: Ace Attorney is a visual novel adventure game[1] in which the player takes the role of Phoenix Wright, a rookie defense attorney, and attempts to defend their clients in five cases. These cases are played in a specific order; after having finished cases, the player can re-play them in any order.[2] Each case starts with an opening cinematic showing a murder;[3] shortly thereafter, the player is given the job of defending the prime suspect of the case.[2] The gameplay is split into two types of sections: investigations and courtroom trials.[4]\r\n\r\nDuring investigations, which usually take place before or in between trial sessions, the player gathers information and evidence by talking to characters such as their client, witnesses, and the police.[4] The player is able to move around a cursor to examine various things in the environment.[5] By using a menu, the player can move to different locations, examine evidence, and present evidence to other characters;[4] by showing certain pieces of evidence to some witnesses, the player can get access to new information.[6] In the game's fifth case, created for the DS version and used in all subsequent releases, the player is able to examine evidence more closely, rotating it to view it from all sides and zooming in or out on it using touchscreen controls; they are also able to move a cursor to investigate specific parts of the evidence. The fifth case also features forensics tests that the player can use at crime scenes to find clues: the player can spray luminol by tapping areas they want to examine on the touch screen, which makes the player able to see otherwise invisible blood stains; and they can touch the touch screen to apply aluminum flake powder in order to search for finger prints. After applying it, they can blow into the microphone to reveal the prints.[7] Once the player has gathered enough evidence, the investigation section ends.[8]\r\n\r\nIn the courtroom trials, the player aims to prove their clients' innocence. In order to do so, they cross-examine witnesses;[4] during these cross-examinations, the player aims to find lies and inconsistencies in the witnesses' testimonies. They are able to go back and forth between the different statements in the testimony, and can press the witness for more details on a statement. When the player finds an inconsistency, they can present a piece of evidence that contradicts the statement.[9] In the Nintendo DS version, the player can choose to press and present by using vocal commands,[4] and in the Wii version, players have the option to present evidence by swinging the Wii Remote.[10] At certain points, the player has to answer questions from the judge, the witnesses, or the prosecutor through a multiple-choice answer selection, or by presenting evidence that supports Phoenix's claims.[4] On the screen, a number of exclamation marks are shown; if the player presents an incorrect piece of evidence, one of the exclamation marks disappear. If all disappear, the client is found guilty and the player must restart.[11] When the player solves a case, they unlock a new one to play.[",
  "banner_url": "/games/banner/phoenix-wright-ace-attorney.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:43.860722Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 14000
}