{
  "name": "Final Fantasy Crystal Chronicles: Echoes of Time",
  "slug": "final-fantasy-crystal-chronicles-echoes-of-time",
  "year": 2009,
  "description": "Final Fantasy Crystal Chronicles: Echoes of Time (ファイナルファンタジークリスタルクロニクル エコーズ・オブ・タイム Fainaru Fantajī Kurisutaru Kuronikuru Ekōzu Obu Taimu) is a Wii and Nintendo DS action role-playing game in the Final Fantasy Crystal Chronicles series developed by Square Enix.\r\n\r\nThe game was released in Japan on January 29, 2009.[1] The North American version was released on March 24, 2009 and the European version was released on March 27, 2009.[2][3] The Australian version was released on April 2, 2009.[4]\r\n\r\nThe protagonist of the game returns from a forest where they battled a great number of monsters to celebrate their sixteenth birthday and coming-of-age ceremony. Upon completion, a Clavat cat-girl named Sherlotta rewards them with a personal crystal. The hero returns home to find a young village girl, Eryll, suffering from \"crystal sickness\". The hero then sets out to find a cure for the disease. However, he is unaware that outside his village lies a world where crystals are merely artifacts of the past and no longer exist.\r\n\r\nIn the town, they meet a man named Larkeicus, who agrees to make them a cure in return for a favor. Obtaining the necessary ingredients, the hero is able to make the potion and saves Eryll. As part of the bargain with Larkeicus, the hero must activate two long-dormant statues atop a fire and ice mountain.\r\n\r\nWhen they complete their task, Larkeicus begins plotting against the hero, first by destroying the \"Crystal Core\", which is said to be the last crystal remaining in the world. The following day, the hero awakens to find their village empty, as if all the villagers had left. Eryll is still left behind and asks him to find the broken pieces of the Crystal Core, believing that putting it back together will bring everyone back to their home. Larkeicus goes rogue and attacks the player, but returns from the dead after defeat, warning that should they meet again, he will kill them. Later finding an immortal Yuke Veriaude who worked alongside Larkeicus 2000 years ago, Veriaude gives them a method of locating the crystals and hopes that by doing so he amends for some past mistake of some sort.\r\n\r\nOne by one, the hero locates the crystal fragments, discovering more about their infancy and the town's history through sudden flashbacks, particularly Sherlotta, who found the hero abandoned as a baby and raised them as a child. They also notes that none of the villagers seemed to have aged from their past selves. When the crystal core is complete, it suddenly manifests itself into the hero's body, giving them the power to interact with ancient technologies. They uses their newfound power to delve further into the forests near their village, where they learns a startling revelation.\r\n\r\nThe hero discovers their village in ruins. Sherlotta appears and explains that Larkeicus and Veriaude apprentice razed the village 2000 years ago, and all of the inhabitants were slaughtered in the attack. Sherlotta and Eryll were attempting to escape, but Eryll was killed and Sherlotta was made immortal when she made indirect contact with the Crystal Core. It also gave her the power to create crystals, although Sherlotta herself doesn't understand why it chose her to be the harbinger of such powers.\r\n\r\nThe Crystal Core also made the villagers live, although they could not age, and their existence was tailored toward the Crystal and to the minds of those who wish to see them. Sherlotta and the villagers lead empty lives for 2000 years, until they found an infant which they could grow and raise to live for them in the outside world, the infant being the hero. With this, Sherlotta accompanies the player to put an end to Larkeicus's plan, as he wishes to stop a future event which was so powerful it destroyed all the crystals, and his city which ran on their power.\r\n\r\nSherlotta and the hero attempt to find a way to gain access to a tower which emerged when the hero activated the two statues, as she believes that is where Larkeicus plans to stop the future event. To do so, they gather a number of artifacts, including the hero's crystal locator and an 800-year-old spirit-witch made by Larkeicus to guard the artifacts (Who later aids the player greatly in finding the later artifacts). During this search, the villagers begin their slow process of disappearing from the world, valuing every moment the hero comes by to see them.\r\n\r\nEventually, only Norschtalen remains, as she is the second orphan the village raised and still mortal in her time. With nothing left to cherish or protect, Sherlotta and the hero go to the tower. To open the way, they use the artifacts and abandon the witch to an isolated spot near the entrance, saying that maybe someday somebody will come to retrieve her. At the top, the hero is surprised to see another, human Sherlotta, blind and deaf to her surroundings.\r\n\r\nThe cat-Sherlotta explains that her present was made after Eryll's pet cat had also retrieved the power of immortality. Through the cat, Sherlotta was able to live off in a depression until she found the hero, where the meaning of life and death became clear in her head again as she and the villagers dedicated their lives to helping you grow into a suitable adult. She then gives one final request to the player, to kill her so that her lifeless body cannot aid Larkeicus any longer with its powers. Larkeicus appears to make good on his promise to kill the hero, after a long battle where he destroys Sherlotta's cat-form and continually abuses her power, the hero and he reach a stalemate.\r\n\r\nThe human Sherlotta suddenly grabs hold of Larkeicus and summons the Crystal Core, realizing that it was created by her so that she may live, and that its choice to give her power must have been fate. Larkeicus and Sherlotta realize that it is the destruction of the Crystal Core that destroys the crystals of the past. With Larkeicus unable to move in the Crystal Core's presence, Sherlotta asks that the hero destroy it as the finale of their coming-of-age ceremony to prove that they are a worthy adult, despite the fact that its destruction will result in the death of the immortals and destruction of all crystals.\r\n\r\nThe hero does so, and returns home triumphant, though deeply depressed at the cost of victory. With only they and Norschtalen inhabiting the village, the hero makes one final pilgrimage through the forest where they received their own crystal. Still holding the crystal they received, they throw it into the pond where the Crystal Core was once located and walks away, their past gone and future ahead.\r\n\r\nAfter the credits roll, the player is free to continue playing on harder difficulties. It is also revealed that Eryll's cat, conveniently named Sherlotta, is still alive. As such, the hero takes notice to the reminder of the past. It is also shown that the tiny crystal the hero had thrown into the pond has grown into a larger one, resembling the Crystal Core. It is likely a new Crystal Core created by the hero's own will. It is presumed that the hero will live out the rest of their adult life seeking comfort and happiness, just as their family (the villagers) would have wanted.",
  "banner_url": "/games/banner/final-fantasy-crystal-chronicles-echoes-of-time.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:29:30.691811Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13955
}