{
  "name": "Kirby: Triple Deluxe",
  "slug": "kirby-triple-deluxe",
  "year": 2014,
  "description": "Pink? Check. Puffy? Check. Powerful? You have no idea.\r\nDevour trees, obstacles, and huge chunks of stages with Kirby’s Hypernova ability and inhale enemies to copy epic new moves like Archer. It’s a grand new Kirby™ adventure PLUS a new multiplayer battle mode, Kirby Fighters!*\r\n\r\nWhen a mysterious being kidnaps King Dedede atop a giant Dreamstalk, only Kirby can save the day! Jump from the foreground to the background in dynamic 3D side-scrolling environments while using new and returning copy abilities to defeat enemies. Duke it out in Kirby Fighters, a fierce 4-player* battle mode where you fight using a chosen ability like Sword or Ninja. The last Kirby standing reigns supreme. Whether you’re new to Kirby or an old fan, the Kirby: Triple Deluxe game offers a triple threat—action, adventure, and a battle mode!\r\n\r\n*    Kirby's powerful copy ability returns, allowing him to inhale, spit and transform\r\n*   Jump from the foreground to the background in dynamic 3D side-scrolling levels\r\n*    Employ new and returning abilities, including:\r\n*    Archer - Kirby wields a bow to strike silently from a distance\r\n*    Beetle - Kirby grabs foes with his horn and slams them into the ground\r\n*    Fire - Kirby can roll into a fireball and scorch through the air\r\n*    Sword - Kirby dons a green cap and wields a sword\r\n*    Kirby’s new Hypernova ability lets him inhale obstacles and big chunks of levels!\r\n*    Use the Download Play feature to duke it out in Kirby Fighters, a fierce battle mode for up to 4 players*! You can also sharpen your skills by playing solo\r\n*    Enjoy a selection of additional game modes including Dedede’s Drum Dash and Arena\r\n*    Collect hidden keychains in every level, each resembling legacy Kirby characters\r\n*    Unlock improved items and new keychains by using the StreetPass™ function to tag other players",
  "banner_url": "/games/banner/kirby-triple-deluxe.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:05.283845Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}