{
  "name": "DiRT Rally 2.0",
  "slug": "dirt-rally-20",
  "year": 2019,
  "description": "DiRT Rally 2.0 dares you to carve your way through a selection of iconic rally locations from across the globe, in the most powerful off-road vehicles ever made, knowing that the smallest mistake could end your stage.\r\n\r\nYou will need to rely on your instincts with the most immersive and truly focused off-road experience yet, including a new authentic handling model, tyre choice and surface degradation. Power your rally car through real-life off-road environments in New Zealand, Argentina, Spain, Poland, Australia and the USA, with only your co-driver and instincts to guide you.\r\n\r\nRace on eight official circuits from the FIA World Rallycross championship, complete with licensed Supercars and support series.\r\nDevelop your team and cars around race strategies, and progress through a varied selection of Events and Championships in both a single player Career Campaign and a competitive online environment.\r\n\r\n* OVER 50 OF THE MOST POWERFUL OFF-ROAD CARS EVER BUILT – Tear through environments with an iconic roster of historic and modern-day rally cars, VW Polo GTI R5, Mitsubishi Lancer Evolution X & Citroën C3 R5. Also take on the challenging power of the Chevrolet Camaro GT4.R.\r\n\r\n• 6 REAL LIFE RALLY LOCATIONS – Take the wheel through the stunning environments of New Zealand, Argentina, Spain, Poland, Australia and the USA.\r\n\r\n• FEEL YOUR RACE – Improved handling, surfaces, fallibility and environments deliver the most authentic and focused off-road experience ever.\r\n\r\n• THE OFFICIAL GAME OF THE FIA WORLD RALLYCROSS CHAMPIONSHIP – Race at Barcelona, Montalegre, Mettet, Lohéac Bretagne, Trois-Rivières, Hell, Höljes and Silverstone in a multitude of different series.\r\n\r\n• DEVELOP YOUR OWN TEAM – Create a team, hire your staff and expand your garage of vehicles as you choose.\r\n\r\n• TUNING – Tune your vehicle to suit your driving style and environmental characteristics. Alleviate wear and tear by configuring each car’s set-up, and upgrade your parts to ensure your vehicles are ready for whatever challenge lies ahead.\r\n\r\n• GET COMPETITIVE – Race the entire DiRT Community in Daily, Weekly and Monthly Challenges, with worldwide leaderboards and events.",
  "banner_url": "/games/banner/dirt-rally-20.jpg",
  "icon_url": "/games/icon/dirt-rally-20.png",
  "is_public": false,
  "updated": "2019-11-02T20:07:38.503857Z",
  "steamid": 690790,
  "gogslug": "",
  "humblestoreid": ""
}