{
  "name": "Age of Empires II: The Age of Kings",
  "slug": "age-of-empires-ii-the-age-of-kings",
  "year": 1999,
  "description": "Rome has fallen and the world is up for grabs.\r\n\r\nIn Age Of Empires II The Age Of Kings -sequel to the award-winning Age Of Empires- you have 1000 years to lead your people through the Middle Ages to greatness. Control one of the most powerful civilizations of the time. Decide whether to conquer the world through military might, rule through commerce and diplomacy, or seize power by means of intrigue and regicide. There are many paths to power but only one civilization will reign supreme.\r\n\r\n* Build a rich empire - A market based economy lets you open up new avenues of trade with your allies.\r\n* From the Dark Age to the Imperial Age - Experience real-time evolution as you build your civilization into a flourishing empire.\r\n* Lead with cunning and might - Place your military in formations or give them intelligent stances and commands to add interesting tactical choices.\r\n* Choose the path to greatness - Will it be an economic path created out of craftsmanship, trade, and technology? Or a military route of siege and naval warfare?\r\n* Command one of 13 civilizations - Including the Franks, Japanese, Byzantines, Vikings, Mongols and Celts. Each has unique attributes, units, buildings, and technologies based on it's historical counterpart.\r\n* Battle alongside heroes of the day - Who will fight for victory under your flag? With historically-based campaigns it could be Joan of Arc, William Wallace, Genghis Khan, Saladin, or Barbarossa.\r\n* Conqer a worthy opponent over the MSN Gaming Zone - Or a nearly human artificial intelligence opponent in single player mode.\r\n* New and bigger lands - With the random map generator you will always have new lands to explore and conquer, no matter how many times you play.\r\n* Create your own scenarios - The Map Editor allows you to build your own massive campaigns.\r\n* Lead swiftly and with ease - Production queues, gathering points and customizable hotkeys make it fast and simple to manage your forces and plan battles.",
  "banner_url": "/games/banner/age-of-empires-ii-the-age-of-kings.jpg",
  "icon_url": "/games/icon/age-of-empires-ii-the-age-of-kings.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:14.381392Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 1855
}