{
  "name": "Farming Simulator 2015",
  "slug": "farming-simulator-2015",
  "year": 2014,
  "description": "Giants Software's Farming Simulator 15 has arrived, and flush with money from the successful earlier games, the developer has invested in a new graphics and physics engine. Previous simulators were very dry, in environments that were as realistic as cheap film sets… Let's see if Farming Simulator 15 is everything it has promised to be.\r\n\r\nMore vehicles and activities, plus bigger environments\r\nTo begin with, you can choose to start your farm in one of two locations, Westbridge Hille in the USA, or Bjornholm in Sweden. Of the two, Bjornholm is probably the prettiest. Your game begins with an optional tutorial that takes you through basic controls and farming skills like harvesting, plowing, and sowing seeds. Once you have the basic process understood, you are left on your own start managing your farm.\r\n\r\nThe idea of Farming Simulator is to farm your land, earn money and then invest in more fields and machinery so you can do more, earn more and keep expanding. You'll grow, harvest and sell crops, rear livestock, and other things like logging. Farming Simulator 15 boasts more equipment and vehicles, which can be bought from the in game shop as you earn money. \r\n\r\nEase back into the action\r\nWhile there are new activities like woodcutting, the essence of Farming Simulator 15 is unchanged. The new physics engine is improved, but not greatly so. Vehicles are easy to control, and all the additional keys you need for each one's various functions are dynamically displayed as you might need them. There is a lack of information on the map, which has small and large display options. It would be improved with a modern 'GPS' style view, and could be better designed to show you, for example, exactly which fields you currently own.\r\n\r\nDriving around the two farms, they appear to be more 'alive' than in 2013, with more traffic and pedestrians wandering around. However, this effect does not last long. Pedestrians do not try and avoid you, as they are like ghosts, and can be passed through without effect. Conversely, other traffic like cars and vans are almost unstoppable objects, against which your huge farming equipment will just bounce. None of the tractors and vehicles have any damage modelling, graphically or otherwise. If you're unlucky enough to roll your vehicle, it'll be undamaged. If you reach the edge of the map, you hit an invisible wall not unlike the Truman Show. \r\nTractors get a facelift\r\nThere's little to talk about sound-wise. There are sound effects and countryside background noises, all of which are acceptable but nothing to write home about.\r\n\r\nThe graphics, with their new engine, are a different matter. Vehicles do look better, being more detailed and with improved animation. The environment is also more detailed, with gently swaying grasses, waterfalls, and improved trees that are far better than the cardboard cut-outs of before. But while it looks better than Farming Simulator 2013, it's not in the same league as current generation video games. The environments still feel 'dead', and the vehicle physics are still not realistic.\r\n\r\nNew look, same simulator\r\nSo, the graphics and physics are better, but not great. The game is bigger and prettier, but the gameplay is more or less unchanged. Fans of the series will be happy with this updated and improved simulator, but it doesn't do anything to convert unbelievers to a virtual agrarian lifestyle. Of course, with its enthusiastic community, Farming Simulator 15 will have a long life with all the mods you will be able to download and install.\r\n\r\nOverall, the much hyped new graphics and physics feel like a missed opportunity to improve the underlying simulator, which remains pretty much unchanged.",
  "banner_url": "/games/banner/farming-simulator-2015.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:29:28.940780Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 21753
}