{
  "name": "Attractio",
  "slug": "attractio",
  "year": 2014,
  "description": "Millions of inhabitants of the Solar System look forward to the new season of the controversial reality show: Attractio. In this reality show, the contestants solve deadly puzzles knowing there is a high probability of not leaving alive. However, the winner will choose the Grand Prize: money, technology or even their freedom.\r\n \r\nDalek, Keir and Mia were chosen as the contestants for this season of Attractio. Each one will have to solve different deadly puzzles using gadgets that allow them to manipulate gravity. Little is known about the contestants' past, but as is usual in every season, the spectators will learn more about them during the contest. But there is something new: one of them knows something that will change Attractio forever...\r\n \r\nAttractio takes place in the Entertainment Space Station (ESS), an artificial satellite orbiting Mars. This station was created for Attractio and has the necessary technology (unique in the Solar System) to change the gravity of any particular object. As usual, Darius will be the host of this exciting reality show.\r\n\r\nAttractio is an indie first-person puzzle game developed with the GC Engine (GameCoder Studios' in-house engine) where the player has to solve challenging puzzles manipulating gravity. These puzzles challenge the usual way of thinking about physics and gravity. In Attractio each object has its own gravity direction which can be changed by the player.\r\n\r\nThe interaction between objects with different gravity directions presents various possibilities. Thus, the player can solve in many ways each of the different puzzles across the game. \r\n\r\nSome examples of these possibilities are: \r\n* Creating a zero gravity object by colliding two objects of the same weight and opposite gravity direction.\r\n* Softening the character's landing with a box with gravity direction perpendicular to a wall. This happens due to the friction between the wall and the box.\r\n* Gravity-Boxes: A special kind of box that, when touched by another box, flips the second box's gravity direction. This is useful to automate some mechanics in the game and perform simultaneous tasks.\r\n\r\nThe player will be able to play with three different characters, each one with different abilities, adding variety to the puzzles. Some puzzles can be solved by a contestant alone, but for some others the player will need to switch between the contestants. Attractio has an unique gameplay and puzzles that will entertain the player for hours. This game was inspired by Valve's Portal.",
  "banner_url": "/games/banner/attractio.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:28:28.674266Z",
  "steamid": 317060,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 3995
}