{
  "name": "Libra of the Vampire Princess: Lycoris & Aoi in \"The Promise\" PLUS Iris in \"Homeworld\"",
  "slug": "libra-of-the-vampire-princess-lycoris-aoi-in-the-p",
  "year": 2017,
  "description": "These episodes take place BEFORE \"Libra of the Vampire Princess\", so they're a great introduction into Libra's vampire world. They're also perfect for fans who crave more of Libra's expanded universe. Both episodes were funded on Kickstarter thanks to our amazing Backers.\r\nLibra of the Vampire Princess: Lycoris & Aoi in \"The Promise\"\r\n“We promised each other, Aoi, that we wouldn’t die alone.” -Lycoris\r\n\r\nLycoris wasn’t always a dim-witted, scythe-swinging servant of darkness; she was a well-known agent in the Rubina: a holy organization of skilled monster fighters and vampire slayers. In this narrative, we go back in time and explore the circumstances of how her and Aoi came to be formally paired together as “buddies” in the Rubina. On a deeper level, we hone in on a particularly gruesome event that would come to shape their eternal love and respect for one another—a bond which can never be broken.\r\n\r\nWith moments of comedy, drama, and gory combat, Lycoris and Aoi’s episode is a must play, especially if you're a fan of this sweet duo.\r\nLibra of the Vampire Princess Extra: Iris in \"Homeworld\"\r\nDernière, one of the many worlds that exist in different dimensions. As holders of a special power known as \"life force\", Dernièreans were blessed with vast energy and extended lifespans, and they lived in glorious prosperity. However, even for them the day of ruin approaches.\r\n\r\nTaking place thousands of years before the events chronicled in Libra of the Vampire Princess, catch a glimpse Dernière’s tragic history and the lives of those caught in the middle. You will meet Aconite Embroche, the determined leader of the Bebel’s sixth commando unit, and his smitten lieutenant, Iris Pumila. Together with Galega Officinalis, a lecherous and gifted dollmaker, they use their superhuman powers to combat the infected life force from spreading and consuming their homeworld.\r\n\r\nWith moments of comedy, explosive battle scenes, and sexiness, this episode is a must play especially if you're an Iris fan!\r\n\r\nPlaytime: 5 hours",
  "banner_url": "/games/banner/libra-of-the-vampire-princess-lycoris-aoi-in-the-p.jpg",
  "icon_url": "/games/icon/libra-of-the-vampire-princess-lycoris-aoi-in-the-p.png",
  "is_public": false,
  "updated": "2019-06-10T13:21:36.734853Z",
  "steamid": 644680,
  "gogslug": "",
  "humblestoreid": "",
  "id": 15569
}