{
  "name": "Football Manager 2014",
  "slug": "football-manager-2014",
  "year": 2013,
  "description": "- Improved Match Engine\r\nThe 3D Match Engine has seen extensive improvements, including enhanced AI, improved lighting and player animation, individual player character and kit models, more realistic player reaction to on-field incidents and a range of optimisations which combine to make this the best looking and fastest FM Match Engine yet.\r\n\r\n- Tactical overhaul\r\nThere has been a complete redesign of how tactics are created, selected and implemented with player roles and team strategies becoming even more prominent, definable roles for players for multiple positions, new player roles and instructions and improvements to rival managers' AI so that they’ll adapt their tactics more readily over time.\r\n\r\n- More realistic transfers and contracts\r\nFM 2014 features a revamped transfer module where opposing clubs and managers adopt a more realistic approach when making or responding to transfer offers. In addition, a number of new ‘real world’ transfer clauses have been added, such as the facility to loan a player back to the club he’s just been bought from and the option to offer a combination of cash and loan players, as well as new contract clauses such as a sub bench appearance fee. On top of this, the old ‘turn-based’ system of transfer negotiations can now be done two ways, the tried and tested system and a new ‘live’ system, similar to that used in FM’s contract negotiations.\r\n\r\n- More sophisticated board interaction\r\nContract negotiations are more realistic in FM 2014, as managers and boards can now make demands and lay down their respective visions for the club in both initial job interviews and contract renewal discussions. Managers can also attempt to renegotiate transfer and wage budgets as a reward for staying loyal if they’ve been offered a job by another club, with the outcome helping aid their decision on whether to move or not.\r\n\r\n- Improved interaction with players, staff and media\r\nThere is now better interaction between players, managers, their rivals and the media; for example, members of the coaching staff now offer feedback on how reserve and youth team players are performing. Managers can also ask key players to have a word with unhappy squad members, while the introduction of an end-of-season meeting allows the manager to let the squad know how they have performed and set targets for the coming season.\r\n\r\n- News system\r\nThe news system has been overhauled so managers can now deal with many club matters directly from their inbox. In addition, news is now colour-coded, based on category, and contains more detail – for example, scout reports now appear as a single news item with a top-line report on all players scouted and the facility to shortlist or make an offer for each of these players.\r\n\r\n- Enhanced user interface\r\nMajor changes have been made to FM 2014’s user interface. Key areas have been redesigned – including the training overview page, the transfer centre and the news homepage – while widespread changes have been made across the game’s user interface. The language employed throughout the game has also enjoyed a major overhaul and now corresponds more closely to the language of real world football.\r\n\r\n- Football Manager Classic evolved\r\nManagers can now choose more than three playable nations in Classic mode for a more immersive experience. In addition, FM’s ‘fast play’ mode now includes Transfer Deadline Day, a Match Plan wizard and new unlockables. ",
  "banner_url": "/games/banner/football-manager-2014.jpg",
  "icon_url": "/games/icon/football-manager-2014.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:33.146625Z",
  "provider_games": [],
  "steamid": 231670,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 1706
}