{
  "name": "Call of Duty: Black Ops III",
  "slug": "call-of-duty-black-ops-iii",
  "year": 2015,
  "description": "Black Ops III is the fourth game in the Black Ops subseries (including World at War) of the Call of Duty first-person shooter franchise and the twelfth main title overall. It is the follow-up to Call of Duty: Black Ops II, but not a direct sequel. Rather, it continues the time progression of battles in the past in the first Black Ops game, modern and near future combat in the second game, and now a game in a far dystopian future set in 2065, 40 years after the previous title. A first for the series, the Xbox 360 and PS3 versions do not have the main single-player campaign, only the multiplayer portion and additional game modes such as Zombies. The single-player campaign is substantially longer compared to the previous games.\r\n\r\nThe game is set in the same universe as Black Ops II and references some past events indirectly. For instance, the focus in the story is back on group troops following the aftermath of the drone strikes by Menendez in the second game. Set in the far future, soldiers are now equipped with DNI, the Direct Neural Interface. It allows them to communicate directly with computers and machines, and it can also be used to read the thoughts and memories of people. The player controls a male or female character and needs the DNI after a failed infiltration and hostage rescue mission from the NCR in Egypt. Your partner, Jacob Hendricks, undergoes the enhancements as well. Five years later the player character and Hendricks are under the command of CIA Agent Rachel Kane investigating a CIA black site in Singapore. Through a series of events the player ends up in Egypt and Switzerland. The story deals with an artificial intelligence called Corvus, the role of privacy, the effects of cybernetic enhancements, secret CIA experiments, and also the characters Commander John Taylor and Dr. Yousef Salim.",
  "banner_url": "/games/banner/call-of-duty-black-ops-iii.jpg",
  "icon_url": "/games/icon/call-of-duty-black-ops-iii.png",
  "is_public": true,
  "updated": "2019-02-13T20:48:00.192913Z",
  "steamid": 311210,
  "gogslug": "",
  "humblestoreid": ""
}