{
  "name": "Krosmaster Arena",
  "slug": "krosmaster-arena",
  "year": 2015,
  "platforms": [
    {
      "name": "Linux"
    }
  ],
  "genres": [
    {
      "name": "Turn-based tactics"
    }
  ],
  "aliases": [],
  "description": "GO ONLINE AND SMASH THEM TO BITS!\r\nFace off against players from all over the world in an online board game that mixes strategy with epic battles! More than a hundred collectible fighters await you. Create your team of heroes, get your attacks ready… and HIT 'EM HARD!\r\n\r\nWith the online version of Krosmaster Arena, you'll get to relive the board game experience on the net and face off against players from around the world!\r\n\r\nDISCOVER THE MULTI-PLAYER GAME THAT BRINGS THE GREATEST WARRIORS ONTO ONE BOARD!\r\n\r\n\r\nTHE BIGGEST SMALL HEROES\r\nThe Demons of the Hours are trapped in the Outerworld, a dimension outside of time and space... and they're incredibly bored! Tired of counting seconds, they're looking for a new, more fun way to kill time... and as chance would have it, they found a way of snatching warriors from different eras and dimensions and making them fight each other in the arena, as if they were pieces in a board game. Who'd have thought it?! The biggest heroes of the Krosmoz... from all eras, fighting in the arena to save their skin…. They are the legendary Krosmasters.\r\n\r\nAppearances can be deceiving! The figurines might be small and adorable, but they're chock-full of power. All of these warriors have their very own 3D attacks – never has a board game been as animated as this!\r\n\r\n\r\nMORE THAN 100 COLLECTIBLE FIGURINES\r\nApart from being collectibles, the figurines can also be used to make up individual combinations of fighters and teams for arena battles!\r\n\r\nNew figurines are added to the range on a regular basis, and there are even real figurines available in-store that you can use as reinforcements, as these feature a code that unlocks their virtual avatars in the game.\r\n\r\n\r\nCOLLECT THEM ALL!\r\nThere are more and more of them!\r\n\r\n\r\nEXPRESS YOURSELF WITH 4 GAME MODES!\r\n\r\n1 campaign mode  go on adventures and battle the Krosmaster bosses.\r\n\r\n1 match mode do battle with your friends.\r\n\r\n1 tournament mode test your competitive spirit and rise through the ranks.\r\n\r\n… and coming soon 1 dungeon mode!\r\n\r\n\r\nTHE WHOLE WORLD IN ONE PVP ARENA\r\nJust because your opponents are on the other side of the world doesn't mean they'll be spared!\r\n\r\n\r\n6 DIFFERENT ENVIRONMENTS TO DO BATTLE IN\r\nTake down your opponents... right on location!\r\n\r\n\r\nMULTI-PLATFORM GAME\r\nFrom computer to tablet! And from tablet to smartphone! It doesn't matter where you log in from, you'll be able to play anywhere. And with the actual board game, you can even play with your family and friends in your living room!\r\n\r\n\r\nALL THE HEROES OF THE KROSMOZ TOGETHER ON ONE BOARD\r\nBefore being an online game, Krosmaster Arena was a board game inspired by the turn-based gameplay found in DOFUS and WAKFU. After all, where did you think these heroes came from?\r\n\r\nThe World of Twelve in DOFUS and WAKFU, as you can see! Not only can you put your figurines up on your mantelpiece, you can also obtain their virtual counterparts in the online game using the unique codes.",
  "banner_url": "/games/banner/krosmaster-arena.jpg",
  "icon_url": "/games/icon/krosmaster-arena.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:06.783428Z",
  "steamid": 329790,
  "gogslug": "",
  "humblestoreid": ""
}