{
  "name": "Close Combat: Cross of Iron",
  "slug": "close-combat-cross-of-iron",
  "year": 2011,
  "description": "Close Combat is a pausable real-time wargame series, heavily focused on historical accuracy and realistic soldier psychological profiles. Team management is crucial as every man in your teams matter. Close Combat: Cross of Iron brings back the epic battles of the Eastern Front of World War II.\r\n\r\nIn Close Combat: Cross of Iron you start off as a junior officer leading your men into battle in real time, focusing on the Eastern Front of World War II. Earn promotions as you deal with an unforgiving enemy. Fight and survive through the frozen winter, hot dusty summer and muddy autumn.\r\n\r\nThe game features a huge amount of Battles, Operations, and Campaigns, inlcudingis an entire Campaign called Fuger's Ostliche Wut, or Fuger's Eastern Fury, based on actions between 1943 and 1944 and playable as either German or Russian, Each Battle and Operation has been carefully made with in-depth briefings related to actual events and will give you hints about the battle and what you may expect.\r\n\r\nThe Teams, Units, Weapons, and Data have been accurately recreated to match historical realism. \r\n\r\nMEGA UPDATE IMPROVEMENTS\r\n\r\n-Noticeable improvements were made to the way vehicles and soldiers travel to way points and reach the end destination of both simple and highly complex, unhindered paths with a very high degree of success\r\n\r\n-Soldier pathfinding was improved so that when soldiers fall behind (heavy weapon or momentarily lost) they plot their own path to successfully rejoin their team\r\n\r\n.Vehicle driver and soldier decision making was improved to help them deal with unexpected obstacles (vehicle moving into their way , or wreck that was knocked out in the course of battle to block a path that was already determined), and get out of dead-end locations\r\n\r\n-AI improvements were made to be in concert with the re-designed pathfinder\r\n\r\n-The \"Bee Dance\" of CC2 that was related to conflicts between the AI for the vehicle driver and the AI that tried to keep the team moving along the team's path that would result in a conflict about which portion of the AI to follow or \"which way to go.\"\r\n\r\n-Many other minor improvements were made and reported bugs were fixed.",
  "banner_url": "/games/banner/close-combat-cross-of-iron.jpg",
  "icon_url": "/games/icon/close-combat-cross-of-iron.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:37.670852Z",
  "provider_games": [
    {
      "name": "Close Combat: Cross of Iron",
      "slug": "1988084980",
      "service": "gog"
    }
  ],
  "steamid": null,
  "gogid": 1988084980,
  "gogslug": "close_combat_cross_of_iron",
  "humblestoreid": "",
  "id": 24233
}