{
  "name": "Daxter",
  "slug": "daxter",
  "year": 2008,
  "description": "Are you ready for a whole new fun-filled platform adventure with Daxter as the hero? Sony Computer Entertainment Europe (SCEE) is pleased to announce the Spring 2006 release of Daxter™ on the PlayStation Portable (PSP®). After years of standing in Jak's shadow, Daxter gets his turn in the spotlight as he stars in his very own game.\r\n\r\nBrought to you by Ready At Dawn Studios' Daxter is tailor-made for the PSP, capturing all the fun, style, great gameplay and wit of previous Jak and Daxter titles.\r\n\r\nThe story takes us back to the events that led to the start of Jak II™. Jak has been imprisoned in Haven city jail, Daxter now on his own in an unfamiliar position, quickly realises that being small and furry won't help his chances of survival and it is time to get tough!\r\n\r\nDaxter takes on a job as a pest exterminator to help stamp out a mysterious bug infestation, this new job allows Daxter freedom to roam across Haven City collecting information that could lead to the release of his incarcerated friend. However Daxter soon discovers that he'll get a little more excitement from his job than he originally bargained for!\r\n\r\nBeing a pest exterminator is hard work and a work shy Ottsell can't be expected to wipe out an entire infestation without conserving energy with some well timed naps can he?! As Daxter takes time off his bug squashing duties he invites you into his dreams where he is the hero in several playable movie themed mini games.\r\n\r\nDaxter also features cross platform compatibility with Jak X on PlayStation 2, allowing gamers who own both titles to unlock new content. With over 17 levels and 13 minutes of hilarious cut scenes, this title is guaranteed to take gamers on a classic platform adventure.",
  "banner_url": "/games/banner/daxter.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-02-07T20:03:11.628847Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 25633
}