{
  "name": "Company of Heroes 2",
  "slug": "company-of-heroes-2",
  "year": 2013,
  "description": "Powered by the Essence Engine 3.0, the Company of Heroes 2 series feature some unique mechanics rewarding thoughtful players. From the TrueSight™ system that emulates the units’ line of sight to the cover-system that encourages clever unit placement – not to mention the combined arms approach and the hard and soft counters gameplay that will make you think twice before trying to destroy a tank with a simple squad of riflemen – each game presents players with an uninterrupted stream of meaningful tactical choices that can turn the tide of war. \r\n\r\nThe original Company of Heroes 2 game gives you access to two multiplayer armies from the Eastern Front: the Red Army (SOV) and the Wehrmacht Ostheer (GER). It also comes with a gritty single-player campaign that will give you a chance to familiarize yourself with the series core tenets. Step into the boots of a Soviet commander of the Red Army, entrenched in brutal frontline warfare to free Mother Russia from the Enemy invaders! Adjust your tactics to take into account the brutal weather conditions and wield the might of the Soviet Empire as you smash your way to Berlin. \r\n\r\nKey features:\r\n\r\n*    AWARD WINNING FRANCHISE\r\n    Sequel to the highest rated strategy game of all time returns with an innovative warfare experience that will redefine the Strategy genre once more\r\n\r\n*    ESSENCE ENGINE 3.0\r\n    Cutting-edge technology that increases the graphical quality and accuracy of deadly combat with the unprecedented TrueSight™ system, the ultrarealistic ColdTech™ dynamic weather that changes strategic warfare forever and improved environmental destruction\r\n\r\n*    TACTICAL WARFARE\r\n    Develop and utilize your new Commander Abilities and experience the up-close moment-to-moment brutality of frontline warfare through new Dynamic Battle Tactics\r\n\r\n*    INTENSE ONLINE COMBAT\r\n    Featuring the great competitive and co-operative multiplayer that fans have grown to expect from this high-quality and critically acclaimed franchise ",
  "banner_url": "/games/banner/company-of-heroes-2.jpg",
  "icon_url": "/games/icon/company-of-heroes-2.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:56.875705Z",
  "steamid": 231430,
  "gogslug": "",
  "humblestoreid": "",
  "id": 1724
}