{
  "name": "Cook, Serve, Delicious!",
  "slug": "cook-serve-delicious",
  "year": 2013,
  "description": "Cook, Serve, Delicious is a hardcore restaurant sim, one of the few in its genre that gives the players total control over where they want to take their restaurant.\r\n\r\nThe game centers on an old, worn down restaurant in the SherriSoda Tower, which was once the heart of the building but closed down as business (and tenants) dropped to an all time low. But with the local economy rising back up and occupancy reaching its maximum, SherriSoda Tower has decided to bring back the old Cook, Serve, Delicious restaurant, and has given you complete control to bring it back to its old five star status of world class dining.\r\n\r\nTo do that, you’ll start with a few thousand dollars and thirty foods to choose from to put on your menu, as well as a host of restaurant equipment and more. Nearly everything is unlocked from the start of the game for you to purchase; this is your restaurant, and you must figure out the best strategy to get that restaurant packed with satisfied customers. Can you prove your culinary skills?\r\n\r\nAnd if that weren’t enough, you’ll also have the opportunity to be cast in the Iron Cook television show, throw parties for offices in SherriSoda Tower, read virtual mail in your SherriSoda Tower Email account which ranges from game tips to crazy spam (nearly 500 emails in all), from customers providing feedback to your restaurant to opportunities such as being able to fund projects via “ClicknStart” and other big surprises!\r\n\r\nWith hours of content and tons of secrets and unlockables, Cook, Serve, Delicious will provide a big challenge for anyone who’s ready to take their crumbling, rat infested eatery to a luxurious Platinum Star Restaurant. Good luck!",
  "banner_url": "/games/banner/cook-serve-delicious.jpg",
  "icon_url": "/games/icon/cook-serve-delicious.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:38.109175Z",
  "provider_games": [
    {
      "name": "Cook, Serve, Delicious!",
      "slug": "1712729523",
      "service": "gog"
    }
  ],
  "steamid": 247020,
  "gogid": 1712729523,
  "gogslug": "cook_serve_delicious",
  "humblestoreid": "",
  "id": 958
}