{
  "name": "Knight Online",
  "slug": "knight-online",
  "year": 2016,
  "description": "Knight Online is a PvP-centric MMORPG that has been under continuous development for over a decade! Two nations, El Morad and Karus are locked in an eternal struggle for dominance of the Adonis Continent. You will be faced with the decision of choosing between one of the two available factions and bring glory and honor\r\nthroughout constant action-packed PvP battles within the designated PvP Zones during all hours of the day.\r\n\r\nBe part of the exclusive in-game events that are built to test your skills in battle and reward you with the spoils of war upon defeating all those who oppose you!\r\n\r\nEvents Available:\r\n\r\n-    Border Defense War\r\n-    Forgotten Temple\r\n-    Chaos\r\n-    BiFrost\r\n-    Castle Siege War\r\n-    Juraid Mountain\r\n-    Lunar War\r\n-    Dark Lunar War\r\n\r\nEpic events such as Lunar War and Castle Siege war are set to place you in an epic battlefield with action packed PvP that is able to entertain and excite its fans even after many years! We encourage you to try all that the Adonis Continent has to offer and see for yourself why Knight Online is so great even after so many years!\r\nWhile PvP may be the beating heart of Knight Online, much of the game is spent embarking on quests, killing monsters for great loot and of course defying the forgotten Gods of the Adonis Continent. Upon destroying monsters you will be able to gather equipment that will aid you in your adventures for years to come!\r\nThe Upgrade System has been built for players to tempt fate in an effort to improve their existing weapons, armor and accessories in order to gain stronger equipment that will make enemies tremble in fear! With its unique ability to let players refine their skills and build their characters and equipment, Knight Online is set to bring an exciting adventure to all those who wish to be part of the most epic Old School MMORPG on Steam!\r\n\r\nSo what are you waiting for? Pick a Nation, build up your warrior and join the fray!",
  "banner_url": "/games/banner/knight-online.jpg",
  "icon_url": "/games/icon/knight-online.png",
  "is_public": true,
  "updated": "2019-10-14T00:52:45.387791Z",
  "steamid": 389430,
  "gogslug": "",
  "humblestoreid": "",
  "id": 6022
}