{
  "name": "Battle Chess: Collection",
  "slug": "battle-chess-collection",
  "year": 1994,
  "platforms": [
    {
      "name": "MS-DOS"
    }
  ],
  "genres": [
    {
      "name": "Chess"
    }
  ],
  "aliases": [],
  "description": "This compilation includes:\r\n\r\n    Battle Chess (1988)\r\nBattle Chess is a quite typical chess game, but it comes with a twist: all pieces are represented by small, realistic figures that walk around on the chessboard, and when one piece takes another, they both take part in an animated battle. There is a different animation for each permutation, depending on which pieces are capturing or being captured. You can also play in 2D without animation.\r\nThe game's opening library includes 30,000 different moves, ensuring a variety of games will unfold across the 10 skill levels.\r\nMulti-player support can be extended to modem and/or serial port play.\r\n\r\n    Battle Chess II: Chinese Chess (1990)\r\nA sequel to the original Battle Chess, this game takes on a more Chinese approach, both in the rules of the game and in the presentation.\r\nUsing a Chinese variation of the game of Chess, pieces like the Queen and Bishop are replaced by Counsellors, Ministers, and Cannon. Pieces behave differently than their European counterparts and even the board is set up differently. Two things remain the same: the ultimate goal of checkmating the opposing player's king and the Battlechess style animated battles that occur when two pieces contend for the same spot on the board.\r\n\r\n    Battle Chess Enhanced CD-ROM (1991)\r\nThis version of Battle Chess, while retaining the gameplay of the original release, features improved 256-color SVGA graphics as well as new visual effects and animations. In addition, it has a symphonic soundtrack in redbook (CD audio) format.\r\n\r\n    Battle Chess 4000 (1992)\r\nThis edition follows the same premise, but with a futuristic science-fiction feel. Pieces are animated from clay models, with a new range of animations. The game can be played in 2D mode as an alternative.",
  "banner_url": "/games/banner/battle-chess-collection.jpg",
  "icon_url": "/games/icon/battle-chess-collection.png",
  "is_public": true,
  "updated": "2019-10-22T19:01:49.780664Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}