{
  "name": "Gratuitous Space Battles",
  "slug": "gratuitous-space-battles",
  "year": 2009,
  "description": "Who needs backstory? Who needs resource-gathering? Diplomacy is so last year. Gratuitous Space Battles cuts right to the chase of sci-fi strategy games, and deals with large, completely unjustified space battles between huge opposing space fleets.\r\nGratuitous Space Battles combines the visual appeal of an RTS, with the addictive unit-placement and design gameplay from tower defense games. In GSB, the player does not control individual ships at all during battle. The ships fight to a pre-determined set of orders and formations given to them by you before the battles.\r\n\r\nGSB casts you as supreme space admiral, tasked with the design of individual spaceships, and the composition of your fleet, as well as general orders of engagement. This is not a twitch-based real time arcade game like many an RTS, but a game of careful thought, planning and big-picture strategy. Huge space battles can be won or lost depending on just how cleverly you balanced the needs of defensive shielding and armor against the expensive punch of laser cannons and plasma torpedoes.\r\nGSB also features an innovative multiplayer challenge system. You can upload your ultimate fleet to serve as the enemy to other players, and keep track of how many other players have won and lost against your challenge. That way, you will never run out of cunningly designed enemies to battle against!\r\n\r\n* 4 different unlockable player races\r\n* Over 40 different ship hulls\r\n* Over 120 spaceship modules\r\n* Choice of skirmish vs AI, never-ending survival mode or play against other player’s fleets with the online challenge system\r\n* Play with different rules as each battle has different spatial anomalies to deal with. ",
  "banner_url": "/games/banner/gratuitous-space-battles.jpg",
  "icon_url": "/games/icon/gratuitous-space-battles.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:42.670606Z",
  "steamid": 41800,
  "gogslug": "",
  "humblestoreid": "",
  "id": 260
}