{
  "name": "BFF or Die",
  "slug": "bff-or-die",
  "year": 2018,
  "description": "Congratulations! You and your friends are graduating from the prestigious Intergalactic Time Academy. No time for partying though as your first mission awaits! The Orbees are all missing. Yes, those curious little beings made of energy who power our time-tech are nowhere to be fou... no, wait! We have a faint trace on their signal. Are you brave enough to rescue them?\r\n\r\nPrepare yourself for unknown dangers. If you find some of the Orbees they might equip your Space-Time Machine with new tech. Decide who is in charge of each gadget and combine your abilities to discover the best strategies.\r\n\r\nUse cunning, comradeship and co-operation to survive and never forget the Academy motto: “BFF or Die!”\r\nBest Friends Forever\r\nBFF or Die is a couch co-op game where players must work together to survive. Bonds will be formed and friendships will be tested in this one of a kind adventure.\r\nEvery part of BFF or Die has been developed with fun-filled group experiences in mind: a vision of players huddling around their PC and enjoying exciting and memorable moments that extend beyond the game itself.\r\n\r\nIn BFF or Die, you work together or you die together. If you are a lone wolf, the entire game can be played in single-player. Can you make it through Ancient Egypt all by yourself?\r\nShare and Play\r\nTwo players can buddy up and share the same control pad or take control of different sides of the keyboard. All four players cooperating in close proximity to overcome the game’s deadly challenges. Or you can go the traditional route and have a separate control pad each, it's up to you.\r\n\r\nSo grab your BFFs and get ready for 30 levels of tense, exciting couch co-op puzzling action for 1-4 players. Once you’ve reached the true potential as a BFF, fire into Infinite mode for never-ending challenges and fun.",
  "banner_url": "/games/banner/bff-or-die.jpg",
  "icon_url": "/games/icon/bff-or-die.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:35.577421Z",
  "steamid": 652360,
  "gogslug": "",
  "humblestoreid": ""
}