{
  "name": "BattleTech: The Crescent Hawk's Inception",
  "slug": "battletech-the-crescent-hawks-inception",
  "year": 1988,
  "description": "20 Lethal tons of massive fighting power are primed for battle and you're in control\r\n\r\nThe 31st century is a desperate time. Five Successor States are hopelessly locked in a mortal struggle for power.  In this era of endless war, the powerful, death dealing BattleMechs are valued higher than human life.\r\n\r\nYou are 18-year-old Jason Youngblood, and fate has given you a terrible gauntlet to run. Abruptly wrenched from the intense drilling of 'Mech warrior training, you are plunged into real battle with deadly Kurita warriors. Savage experience is now your unforgiving teacher, and the very survival of The Lyran Commonwealth demands you learn the ruthless precision of battle strategy quickly.\r\n\r\nCan you, the son of legendary 'Mech Warrior Jeremiah Youngblood, steel yourself for the greatest challenge of your life?\r\n\r\nAuthentic BATTLETECH combat is yours to command\r\n\r\nThe Master Storytellers of INFOCOM have joined forces with FASA, the creators of BATTLETECH, and the computer wizards of WESTWOOD ASSOCIATES to bring you an unparalleled adventure.\r\n\r\n*Exciting, animated role-playing action\r\n\r\n*All new, richly detailed story set in the world of the Successor States\r\n\r\n*Emotive outtakes in the Japanese comics style increase the realism\r\n\r\n*The Arena, a gladiatorial module, sharpens your battle skills\r\n\r\n*Plan your own battle tactics, or let the computer determine strategies for you\r\n\r\n*An enormous geography to fight in; more than 4 million individual locations\r\n\r\n*BattleTech characters and events come alive on your screen in animated close-ups\r\n\r\n*You're in command; you choose your weapons and your targets for each member of your fighting unit\r\n\r\n*Experience the thrill of battle as you move your 'Mechs across the far-reaching terrain of Chara IV\r\n\r\n* Your BATTLETECH package contains the game disk, Player's Guide, Weapon and 'Mech Recognition Guide, and full color poster",
  "banner_url": "/games/banner/battletech-the-crescent-hawks-inception.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-10-22T22:06:48.342394Z",
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 29460
}