{
  "name": "Girl Amazon Survival",
  "slug": "girl-amazon-survival",
  "year": 2016,
  "description": "THE BEGINNING OF A GREAT ADVENTURE\r\nYou woke up next to the crashed plane. Who are you and where flying - you don't remember.\r\nLand, where you were, you will require a lot of strength and courage to stay alive.\r\nIt's open world. There are a lot of dead cities, abandoned factories, caves, mines, and anomalous radioactive zones, a biologically dangerous place - where you have to find medicine, bandages, clothes and weapons.\r\n\r\nCALL OF NATURE AND EVIL\r\nYou will have to fight and kill the enemies that will attack you, bandits, monsters, zombies, wild animals.\r\n• You can play first and third person.\r\n• Dynamic day and night weather.\r\n• Cut trees and build houses, and various buildings.\r\n• Light the torch and light your way at night in the cave, jungle and desert towns.\r\n• You can explore the island alone, as well as to complete various missions.\r\n• Kill animals. Put out the fire.\r\n• You can use it to travel by car.\r\n• The game has many different clothes and equipment, which must find and collect.\r\n\r\nPRIMITIVE AND MODERN WEAPONS\r\n• You can create and find a variety of weapons.\r\n• Minigun, machine gun, flamethrower, grenade launcher, grenades, sniper rifle, bow, spear, axe, sword, pistol, torch.\r\n• With the help of weapons you can kill bandits, mercenaries, soldiers, animals and all sorts of monsters and zombies.\r\n• Build traps and defend against enemies.\r\n\r\nCHALLENGE IN A PVP GAME\r\n• Create your own server in multiplayer.\r\n• Play online with players around the world.\r\n\r\nPLAYING – LEARN TO SURVIVE AND FIGHT\r\nYou on a thrilling adventure in an open world, in the abandoned cities and caves, which are full of all mystery and horror.\r\n• In the game you can shoot the heads of the dead, zombies, and bandits.\r\n• Collect the heads of the dead and see them on spears, mark their territory.\r\n• Find bandages and medicine. Cure yourself from wounds and radiation.\r\nYou expect the city jungle. In the game you can swim, kill, hunt, build, gather clothes and things, weapons, ammo.",
  "banner_url": "/games/banner/girl-amazon-survival.jpg",
  "icon_url": "/games/icon/girl-amazon-survival.png",
  "is_public": false,
  "updated": "2019-01-23T08:29:39.853087Z",
  "steamid": 372750,
  "gogslug": "",
  "humblestoreid": "",
  "id": 12476
}