{
  "name": "Animal Crossing: New Leaf",
  "slug": "animal-crossing-new-leaf",
  "year": 2013,
  "description": "Welcome to Animal Crossing: New Leaf\r\n\r\nCreate your very own happy place in the wonderful world of Animal Crossing™. Come in and look around—and see why there's no other place quite like it.\r\n\r\nIt's Not Just a Game...It's a Way of Life\r\n\r\nThere are no points or levels, just an amazing array of sights and sounds, places and activities...all yours to explore. Spend your time passing new ordinances—or going fishing. Hang out at a coffee shop or visit a tropical island. It's all up to you.\r\n\r\nTotally Unique...Just Like You\r\n\r\nYour game is what you make it—and personalizing your world is part of the fun. Create cool patterns for clothing or furniture, build new structures in your town, design gardens and museum displays, and so much more.\r\n\r\nNew Day, New Discoveries\r\n\r\nTime passes in the world of Animal Crossing just as it does in real life. Celebrate holidays and see the seasons change. Meet new visitors or get gifts from your neighbors. There's always something special to look forward to.\r\n\r\nA Natural World\r\n\r\nThe great outdoors can play as big a part in Animal Crossing as you want it to. Spend time planting trees, picking fruit, digging for fossils, and arranging flowers. Grab a net and fishing rod to collect all kinds of insects and fish. Or just sit back and enjoy the scenery.\r\n\r\nNew Friends\r\n\r\nAs you build your town, new animals will move in and say \"hello.\" There are dozens of charming characters in the game to get to know. You can even visit the towns of other players (either online or locally) and invite the characters you meet along the way to move to your town.\r\n\r\nLots of Shopping\r\n\r\nOne of the many fun things to do in Animal Crossing is finding ways to spend your Bells (the local currency). Collect furniture for your dream home, buy new clothes, or shop at the flea market. With hundreds of items to buy, sell, or trade, there's always shopping to do.",
  "banner_url": "/games/banner/animal-crossing-new-leaf.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-12-22T19:14:29.109585Z",
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 30526
}