{
  "name": "God of Blades",
  "slug": "god-of-blades",
  "year": 2012,
  "description": "A love-song to pulp fantasy tales of yore, 70s synth-prog-landscape oddities, and forgotten places, God of Blades is a gorgeous, visceral sidescrolling physics-based sword-fighting adventure. Players assume the role of a nameless spectral king who has risen to defend his planet against a rampaging doom-cult the devouring touch of the cosmic horrors they serve. Wrenching this world from the grasp of oblivion, the Nameless King wields phantom blades forged from the legends and heritage of a dying world. \r\n\r\nGod of Blades asks players to think about memory, culture, and loss in terms of stories, books, and the communities that love them. Advocating for an awareness of lost tales, God of Blades rewards players with special swords for visiting real world libraries.\r\n\r\nRaise your blade, and rush into the darkness!\r\n\r\nFeatures:\r\n* Breathtaking environments and art inspired by pulp novel covers, classic RPG modules, and 1970s rock\r\n* Rush headlong into vast armies of barbarous foes\r\n* Battle to regain your memories and preserve a world on the brink of oblivion. The more you remember, the more blades you can call upon!\r\n* Extensive Campaign mode includes gorgeous cinematics and an epic story in the tradition of fantasy sagas past.\r\n* Addictive, emergent physics-driven combat makes every duel unique—shatter weapons, armor, and send your foes flying.\r\n* Pit your swordfighting prowess against the Voidchosen—procedurally generated master warriors.\r\n* Stellar aural experience, featuring tremendous sound design, and a rousing score reminiscent of 60s/70s fantasy and horror films\r\n* An array of unlockable weapons, each with a unique look, feel, power, and history— learn their tales and develop your own fighting strategies. Banish your enemies to other dimensions, cover them in flames, slow time to achieve impossible blows, summon storms, cover them in soul-devouring worms and more! \r\n* Unlock select weapons by visiting real world libraries, using our innovative feature, Loreseeker.\r\n* Eternal mode offers white-knuckle survival gameplay- how long can you last the void-crazed horde?",
  "banner_url": "/games/banner/god-of-blades.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:40.788451Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}