{
  "name": "Pokémon Black Version",
  "slug": "pokemon-black-version",
  "year": 2011,
  "description": "Pokémon Black Version and White Version (ポケットモンスター ブラック・ホワイト Poketto Monsutā Burakku & Howaito, \"Pocket Monsters: Black & White\") are role-playing games developed by Game Freak, published by The Pokémon Company and distributed by Nintendo for the Nintendo DS. They are the first installments in the fifth generation of the Pokémon series of role-playing games.[6] First released in Japan on September 18, 2010, they were later released in Europe on March 4, 2011, in North America on March 6, 2011, and Australia on March 10, 2011.\r\n\r\nSimilar to previous installments of the series, the two games follow the journey of a young Pokémon trainer through the region of Unova, as they train Pokémon used to compete against other trainers, while thwarting the schemes of the criminal organization Team Plasma. Black and White introduced 156 new Pokémon to the franchise, 5 more than the previous record holder Red and Blue, as well as many new features, including a seasonal cycle, rotation battles, fully animated Pokémon sprites and triple battles. Both titles are independent of each other, but feature largely the same plot, and while both can be played separately, trading Pokémon between both of the games is necessary in order to complete the games' Pokédex.\r\n\r\nUpon their release, Black and White received positive reviews; critics praised the advancements in gameplay, as well as several of the new Pokémon introduced; much acclaim went to the unique, complex plot. Reviewers, however, were divided on some of the character designs, and some critics felt that the games did not innovate as much as expected. Nevertheless, the games were commercial successes; prior to the games' Japanese release, Black and White sold one million consumer pre-orders and sold five million copies as of January 2011, making it one of the best selling DS games to date. As of March 2015, the games' combined sales have reached 15.60 million, putting the titles amongst the best selling games for the Nintendo DS, but still being outsold by their predecessors, Diamond and Pearl.[7] Sequels to Pokémon Black and White, Pokémon Black 2 and White 2, were released in Japan for the Nintendo DS in June 2012, with October releases in North America, Europe, and Australia.\r\n\r\nPokémon Black and White are role-playing video games with adventure elements, presented in a third-person, overhead perspective.[8] There are three basic screens: an overworld, in which the player navigates the main character; a battle screen; and the menu, in which the player configures their party, items, or gameplay settings. The player controls a Pokémon Trainer who begins the game with a single Pokémon[9] and is able to capture more using Poké Balls.[10] Like all other Trainers, the player can carry up to six Pokémon at one time. However, the game also includes a network of PCs to store hundreds of Pokémon. PCs are found in certain buildings—namely, \"Pokémon Centers\", where the player heals their Pokémon with low health.[11]\r\n\r\nMost Pokémon evolve into other forms when certain conditions are met, such as when they reach a certain level—levels range from 1 to 100—or have a certain item used on them.[12] They can learn up to four moves, including attacking moves, healing moves, and moves that inflict status conditions on the opponent.[13] They have six stats that affect battle performance: maximum HP (hit points), Attack, Defense, Special Attack, Special Defense, and Speed. Attack and Special Attack are distinguished from Defense and Special Defense by the types of moves being considered: generally, moves involving physical exertion are physical, while moves involving supernatural or elemental powers are special. Moves are classed as one of seventeen types, (Normal, Water, Grass, Fire, Electric, Ghost, Bug, Fighting, Ice, Steel, Rock, Poison, Psychic, Dark, Dragon, Ground, and Flying); Pokémon can have one or two types. Generally, most of a Pokémon's moves correspond to its typing. A Pokémon's type makes it vulnerable or resistant to others; for example, Fire-type Pokémon are weak to Water-type moves, while Grass-type moves do little damage to them and Electric-type moves do normal damage.[14]\r\n\r\nWhen the player encounters a wild Pokémon or is challenged by another Trainer to a battle, the screen switches to a turn-based battle screen where the Pokémon fight. During battle, the player may fight, use an item, switch the active Pokémon, or flee. However, the player cannot flee a battle against another Trainer or against certain wild Pokémon that are stronger than the player's. When a Pokémon's HP is reduced to zero, it faints until it is revived.[15] If an opposing Pokémon faints, all of the player's Pokémon who participated in defeating it receive experience points. After accumulating enough experience points, a Pokémon may level up, increasing its stats.[12] Many Pokémon evolve into other forms, usually by reaching certain levels.[12] At the \"Day Care\" location, the player can breed two of their Pokémon—usually, a male and a female—to create Eggs that hatch into baby Pokémon at level 1.[16]\r\n\r\nThe world of Pokémon Black and White, known as Unova, consists of a number of cities and towns connected by \"Routes\".[8] Random encounters may take place in tall grass along routes or in bodies of water. The player occasionally battles Trainers in cities and towns, as well as along routes.[17] In addition, eight of the game's cities and towns are homes to \"Gym Leaders\", powerful Trainers specializing in certain types of Pokémon; beating a Gym Leader gives the player a \"Badge\". All eight Badges are needed to unlock the Pokémon League,[18] where the player faces off against the \"Elite Four\" and, finally, the Champion. Across Unova, items can be found on the ground or purchased from \"Poké Marts\".[17] For example, Hyper Potions restore HP,[19] Antidotes cure poisoning,[20] and Revives revitalize fainted Pokémon.[21] TMs (Technical Machines) teach moves to Pokémon, and HMs (Hidden Machines) are a special class of TMs for important moves that allow the player to traverse the environment. The \"Surf\" HM move, as one example, is used to cross bodies of water.",
  "banner_url": "/games/banner/pokemon-black-version.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:46.996797Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 14007
}