{
  "name": "Oddworld: Stranger's Wrath HD",
  "slug": "oddworld-strangers-wrath-hd",
  "year": 2010,
  "description": "You're the Stranger, a mysterious bounty hunter on a mission to bag the ultimate prize. And you need that money like no one else because there is something very wrong with your health and the only way to fix it is a very costly operation. However the nature of your illness remains a secret and as you find out during the game, for a good reason.\r\n\r\nIn the dusty, undeveloped wastelands of Western Mudos, cantankerous townsfolk find their settlements besieged by belligerent outlaws. Along comes Stranger, a tall, dark and enigmatic bounty hunter with a mission to capture troublemakers and scoundrels and return them to civilized townships for incarceration.\r\nBut Stranger is keeping a secret and needs expensive surgery to survive. In his quest to earn enough Moolah, Stranger reluctantly accepts the ultimate bounty from the owner of the Mongo River and suddenly his adventure takes a very different turn.\r\n\r\nOddworld: Stranger's Wrath HD is a HD remake of Oddworld: Stranger's Wrath. It retains the original game and adds the following:\r\n* 720p, 60 FPS gameplay and cut-scenes\r\n*  All 84 character models have been updated with increased polygon counts and higher resolution textures.\r\n* Concept art and movie extras for completing each region of the game\r\n* Environments boast better poly-counts, textures and reflections\r\n* French and German audio\r\n* Full text translations for French, German, Italian and Spanish\r\n* Hidden easter eggs\r\n* Improved controls especially for PC\r\n* Music, voice and SFX upgraded from 8-bit 11KHz or less to 16-bit 44KHz\r\n* Three difficulty levels\r\n* Trophies (PSN) and Achievements (Steam PC)\r\n\r\nSome of these features may be specific for the PS3 or PC version of the game. The PC version of the game is not the same one as the version in the 2010 release of The Oddboxx, which contained a direct port. The version included there was also available separately. Existing owners of the game were offered the updated content for free and the HD version replaced the default version available in online stores.",
  "banner_url": "/games/banner/oddworld-strangers-wrath-hd.jpg",
  "icon_url": "/games/icon/oddworld-strangers-wrath-hd.png",
  "is_public": true,
  "updated": "2019-12-28T20:51:51.987381Z",
  "steamid": 15750,
  "gogslug": "oddworld_strangers_wrath",
  "humblestoreid": "oddworld-strangers-wrath-hd"
}