{
  "name": "Pikmin 3",
  "slug": "pikmin-3",
  "year": 2013,
  "description": "Pikmin 3 is the third installment in the Pikmin series. The game centers around controlling three new characters: Alph, Brittany, and Charlie. They travel to PNF-404 (the planet featured in the first two games) to save their home planet Koppai from famine by harvesting seeds from the planet's fruit. Upon reaching the planet, they discover the Pikmin, a servile species that's both plant and animal, which they use to collect the fruit and battle the planet's many fierce creatures.\r\n\r\nThere are five types of Pikmin which are found throughout the game. Red, Yellow, and Blue Pikmin are resistant to fire, electricity, and water respectively. New to Pikmin 3 are Rock and Winged Pikmin varieties. Rock Pikmin have a hard, rock-like exterior that can cause massive impact damage, and are resistant to blunt forces. Finally, Winged Pikmin are weaker in battle, but can carry objects over walls and gaps, as well as combat enemies in the air.\r\n\r\nUnlike the first two games, Pikmin 3 has no time limit but nevertheless tasks the player with resource management. Juice is squeezed from each fruit piece the player collects. One bottle of juice is consumed at the end of each day. If the player runs out of juice, it is game over.\r\n\r\nThe GamePad acts as the explorers' KopPad, displaying stray Pikmin, fruit, Pikmin nests, player characters and other objects on its map. The player can make characters move to a spot on the map on their own by clicking the Go Here icon on the GamePad's touchscreen. This allows players to accomplish more tasks simultaneously. Players can also use the Pad to take photos from the Pikmin's perspective and view information about the Pikmin, and files, which are strewn about the planet.\r\n\r\nThe save system works as follows: if for some reason the player is not satisfied how a certain day went, they can go back and replay it for a better result. However, this will erase the days that happened after the day that the player chooses to replay.\r\n\r\nIn addition to Story Mode, there are also Mission and Bingo Battle modes. Mission Mode tasks the player with completing missions in specialized arenas in the most efficient way possible. Bingo battle is a two-player competitive mode. The goal is to collect items in order to create a Bingo on the player's card, before the opposing player does.",
  "banner_url": "/games/banner/pikmin-3.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:44.177734Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 16350
}