{
  "name": "Pokémon FireRed",
  "slug": "pokemon-fire-red",
  "year": 2004,
  "description": "Travel through Kanto, battling, capturing and training wild Pokémon as well as tackling other trainers, and the evil Team Rocket. Between catching the 200 Pokémon, including 10 unique to Pokémon FireRed, visit one of the eight gyms in an attempt to prove your worth and become a Pokémon Master.\r\n\r\nPokémon FireRed and LeafGreen are set in Kanto, the region where Pokémon first took root and exploded into a major phenomenon, and the latest titles stuff in tons of exciting new features.\r\n\r\nFeatures:\r\n\r\n*    Return to the world of Kanto originally explored in Pokémon Red and Pokémon Blue, where the adventure is brought to life better than ever with dazzling GBA graphics and dozens of surprising new features.\r\n*    Experience the original duo's plot, prove yourself in the region's Pokémon League while single-handedly bringing down Team Rocket, plus pursue major new storylines that will add unexpected twists.\r\n*    Once you prove yourself, you'll be able to bring the Pokémon you caught from Pokémon FireRed and Pokémon LeafGreen into Pokémon Ruby, Pokémon Sapphire and Pokémon Colosseum!\r\n\r\nThe Big Picture:\r\n\r\nWith Pokémon FireRed and LeafGreen now available, the Pokémon games are connecting to create one gigantic Pokémon world. Provided that all gameplay requirements are met, you can:\r\n\r\n*    You can connect Pokémon Ruby/Sapphire to Pokémon FireRed/LeafGreen and trade/battle Pokémon between the games.\r\n*    You can currently connect a Pokémon Ruby or Sapphire GBA Pak to the Pokémon Colosseum GCN game to trade/battle Pokémon between the two systems.\r\n*    Shadow Pokémon that you Snag in Pokémon Colosseum's Story Mode can be used for competitions in Pokémon Colosseum's Battle Mode.\r\n*    Trade/battle Pokémon between Pokémon FireRed/LeafGreen and Pokémon Colosseum for the first time.\r\n\r\nGotta Breed 'Em All:\r\n\r\nWe've witnessed many a debate over which region's got the greatest \"starter Pokémon,\" and Pokémon Gold and Pokémon Silver fans always argue that Cyndaquil, Chikorita and Totodile reign supreme. Don't you wish you could settle that argument with a Pokémon Colosseum battle? You can. In Pokémon Colosseum's Story Mode, you can snag the triad's next evolutionary step -- Quilava, Bayleef and Croconaw, respectively -- then send them to Pokémon Ruby and Sapphire, where you can breed them in Hoenn's Day Care.\r\n\r\nIf you breed a female Pokémon with a male that has a compatible Egg Type, you'll be sure to hatch the female Pokémon's earliest evolutionary form. With it, you can settle the \"starter Pokémon\" score anywhere you want: in Hoenn or back in Orre!\r\n\r\nBottom Line:\r\n\r\nPokémon FireRed and LeafGreen revolutionize the Pokémon universe and prove once again that the Pokémon franchise delivers some of the most intense RPG action available anywhere! So what are you waiting for? Start your own Pokémon adventure today with Pokémon FireRed and Pokémon LeafGreen!",
  "banner_url": "/games/banner/pokemon-fire-red.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-04-17T06:38:09.147673Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 4109
}