{
  "name": "Ridge Racer™ Unbounded",
  "slug": "ridge-racertm-unbounded",
  "year": 2012,
  "description": "Ridge Racer Unbounded is an entry in the long-running Ridge Racer racing series and the first to be developed entirely by a Western studio. It follows the tradition of having players race in expensive sports cars through an urban environment with pounding electronic music, but departs from the previous games by shifting the focus from clean racing to crashing into opponents and breaking through objects in the environment to use shortcuts and introduce debris on the track. The game's story focuses on the Unbounded, a gang of street racers who use the fictional city Shatter Bay as their racing environment. The player assumes the role of one the racers and has to participate in events to gain in rank. In the main Shatter Bay mode growing in level makes available more cars and opens up different districts of the city.\r\n\r\nDuring the races a power bar can be filled up by drifting, jumping and staying in the slipstream of other cars. Once the bar is full a power mode can be activated. It provides a speed boost but also turns the car into a weapon to \"frag\" (crash) other cars similar to the takedowns in the Burnout series. It also becomes possible to drive through certain buildings and walls to destroy them and have the debris fill the course to hinder the other racers. Minor obstacles can be hit at all times, but really large ones such as tanker trucks for instance are only highlighted in the power mode, wrecking havoc similar to Split/Second. The different racing modes include regular Domination races based around the finishing position and fragging other cars, Shindo Racing that focuses on clean racing without damaging opponents, Drift Attack, and Time Trial. In Frag Attack the player controls a special vehicle and needs to destroy as many police cars as possible. The player's performance is rated with up to three stars and these are needed to progress through the game.\r\n\r\nEntirely new to the series is the City Creator, a full 3D editor where new cities, courses and scenarios can be designed and shared with other players. These are played through the The World game mode, which consists of cities designed by other players. Many building blocks for the editor only become available after unlocking them in the main Shatter Bay mode.",
  "banner_url": "/games/banner/ridge-racertm-unbounded.jpg",
  "icon_url": "/games/icon/ridge-racertm-unbounded.png",
  "is_public": true,
  "updated": "2019-11-11T02:32:37.961784Z",
  "steamid": 202310,
  "gogslug": "",
  "humblestoreid": "",
  "id": 2078
}