{
  "name": "Asterix & Obelix XXL 2",
  "slug": "asterix-obelix-xxl-2",
  "year": 2018,
  "platforms": [
    {
      "name": "Sony PlayStation 2"
    },
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "Adventure"
    },
    {
      "name": "Fantasy"
    }
  ],
  "aliases": [],
  "description": "By Toutatis! The indomitable Gauls are back with a new video game!\r\n\r\nMore than 10 years following their last appearance on games consoles and PC, Asterix and Obelix are back and in better shape than ever! Asterix & Obelix XXL 2 is a superb blend of action and adventure for all ages, with a winning combination of comedy and brawling.\r\nBut where has Getafix gone? The long-bearded druid has disappeared after betraying his own people for Julius Caesar! The Gaulish village is in uproar! They must find out the truth! Always ready for a fight, Asterix and Obelix are sent to Rome on a mission by their chief Vitalstatistix. There, they find a new amusement park - Las Vegum - built by the famous Roman emperor. To what end? What is Getafix hiding?\r\n\r\nplay As Asterix and Obelix\r\n\r\nExplore Las Vegum with the inseparable Asterix and Obelix, not to forget their faithful companion Dogmatix, who will be no small help in facing the Roman legionaries. And he will not be your only ally, as the unrivalled magic potion remains your number-one weapon against the Romans!\r\nSwitch between the shrewd Asterix and the superhumanly strong Obelix to take on the hordes of Romans, solve puzzles and overcome the many challenges that lie in wait!\r\n\r\na Unique and Immersive Adventure\r\n\r\nDiscover the huge amusement park Las Vegum, never before seen in the franchise! Our two happy adventurers make their way through this richly detailed and colorful world, which remains faithful to the iconic series of comics created by Goscinny and Uderzo. Playing Asterix and Obelix is an experience that is truly worth a trip all the way back to 50 BC!\r\n\r\na Game For All Ages\r\n\r\nWhether you're a diehard fan of the Gaulish tribe or have just discovered their adventures, Asterix & Obelix XXL 2 is an accessible game that's enormously fun to play. You can also enjoy the many references to be discovered. It's hard to not to love the game's endearing characters and environments. There are special bonuses to be found and a new difficulty mode for the more experienced players.\r\n\r\nan Updated Version\r\n\r\nAsterix & Obelix XXL 2 brings the experience of the original game to an unparalleled level. The enhanced graphics pay tribute to the comic books and the gameplay has been totally redesigned to make fighting the Romans even more fun! It also features a new system to improve your attacks and the ability to set yourself special challenges!",
  "banner_url": "/games/banner/asterix-obelix-xxl-2.jpg",
  "icon_url": "/games/icon/asterix-obelix-xxl-2.png",
  "is_public": true,
  "updated": "2019-10-11T02:54:48.873296Z",
  "steamid": 887060,
  "gogslug": "asterix_obelix_xxl_2",
  "humblestoreid": ""
}