{
  "name": "Dota Underlords",
  "slug": "dota-underlords",
  "year": 2019,
  "description": "YOUR HEROES ARE READY FOR HIRE\r\nHire a crew and destroy your rivals in this new strategy battler set in the world of Dota.\r\n\r\n\r\n\r\nSTRATEGIZE TO WIN\r\nRecruit heroes and upgrade them into a more powerful version of themselves.\r\n\r\n\r\n\r\nMIX AND MATCH\r\nEach hero you recruit can form unique alliances. Stacking your team with allied heroes will unlock powerful bonuses that can crush your rivals.\r\n\r\n\r\n\r\nCROSSPLAY\r\nPlay on your platform of choice and battle players across the globe in a hassle-free crossplay experience. Running late? Start a match on your PC and finish it on your mobile device (and vice versa). Your profile in Dota Underlords is shared across all devices, so no matter what you play on, you're always making progress.\r\n\r\n\r\n\r\nRANKED MATCHMAKING\r\nEveryone starts at the bottom, but by playing against other Underlords you'll climb through the ranks and prove you're worthy to rule White Spire.\r\n\r\n\r\n\r\nTOURNAMENT-READY\r\nCreate your own private lobbies and matches, then invite spectators to watch you duke it out.\r\n\r\n\r\n\r\nOFFLINE PLAY\r\nOffering a sophisticated AI with 4 levels of difficulty, offline play is a great place to hone your skills. Pause and resume games at your leisure.\r\n\r\n\r\n\r\nLIGHTNING-FAST NETWORK\r\nUnderlords runs on a shiny new network system for lag-free experiences.\r\n\r\n\r\n\r\nCOMING SOON: BATTLE PASS\r\nThe Battle Pass will introduce progression, cosmetics, custom boards and a host of other new features to the Dota Underlords experience.\r\n\r\n\r\n\r\nCOMING SOON: SEASONAL ROTATION\r\nEvery season we'll say goodbye to certain Heroes, Items, and Alliances to make room for new additions that will shape the ever-evolving world of Underlords.\r\n\r\n\r\n\r\nCOMING SOON: UNDERLORDS\r\nChoose an Underlord persona from our ever-expanding roster that fits your play style. With unique gameplay affecting changes, there's an Underlord for everyone.\r\n\r\n\r\n\r\nWHITE SPIRE AWAITS A LEADER...\r\nA vertical metropolis of gambling and grit, just beyond the reach of Stonehall and Revtel; White Spire is known as a smugglers' paradise with loose morals and colorful residents to spare. Despite being overrun with syndicates, gangs, and secret societies, White Spire has never descended into chaos for one reason: Momma Eeb. She was respected... she was loved... and unfortunately, she was murdered last week.\r\n\r\nEeb’s death has sent one question rippling through White Spire's underworld: who is going to run the city?",
  "banner_url": "/games/banner/dota-underlords.jpg",
  "icon_url": "/games/icon/dota-underlords.png",
  "is_public": true,
  "updated": "2019-06-27T05:11:56.647841Z",
  "steamid": 1046930,
  "gogslug": "",
  "humblestoreid": ""
}