{
  "name": "Final Fantasy Tactics A2: Grimoire of the Rift",
  "slug": "final-fantasy-tactics-a2-grimoire-of-the-rift",
  "year": 2008,
  "description": "Final Fantasy Tactics A2: Grimoire of the Rift (ファイナルファンタジータクティクス A2 封穴のグリモア Fainaru Fantajī Takutikusu Eitsū Fūketsu no Gurimoa, \"Final Fantasy Tactics A2: Sealed Grimoire\") is a tactical role-playing game developed and published by Square Enix for the Nintendo DS handheld game console.\r\n\r\nGrimoire of the Rift is the sequel to Final Fantasy Tactics Advance as well as an iteration in the Ivalice Alliance. It is set in the same world of Ivalice of Final Fantasy XII, and follows the adventures of a young boy transported to this world by a magic book, who encounters many monsters, and a sinister plot to unleash something from another dimension.\r\n\r\nThe game was well received by critics, praising the expansive gameplay and character customization, though the slow pace of battle, fixed camera perspective and steep learning curve were also mentioned. The title was called the \"Best Strategy Game\" of 2008 by IGN, and sold over 670,000 copies.\r\n\r\nGrimoire of the Rift features similar game mechanics of the previous game. The player, as before, takes on quests by visiting Pubs in towns in the game world, and pays for information on quests, which range from the usual fights against a group of foes, dealing with a specific target enemy, delivering something, or handling a unique objective such as defending something or someone from harm for a certain amount of time. As before, completing quests requires the player to visit a location or series of locations across the game map to complete them and earns the player Gil, experience (if battles are involved in the quest), ability points for the player's clan members, and Loot. The latter is a new concept in the game and holds two uses, and along with that is also clan points and talents which hold importance as well, the latter for quests. When players select a quest they will have varying time limits to complete them (in-game days), varying ranks of difficulty (1 - 99) and varying fees to pay (i.e. 200 Gil), with quests divided by New (recently announced in Pubs), Recent (quests still currently available) and Other (quests unavailable until after a certain amount of in-game days). Time limits don't apply for quests crucial for the story's progress as these ones can be completed at any time, but cannot be cancelled once selected unlike the others that can be acquired. In addition to picking a quest, the player is given details about it, including type, location(s) and number of clan members at location(s), items required, clan talent(s) needed (i.e. a certain talent of 4 is needed for quest), reward for the quest's completion, and whether a clan members can be dispatched for a quest, with an additional piece of info on job needed for dispatch to be successful. Dispatching, as before depends on levels of clan members and jobs and what abilities they have.\r\n\r\nBattles still use an isometric turn-based tactics battle system just like its predecessor, however Square Enix further developed the game's grid-based system, Law system and increased the number of character jobs used in the game. Battles still function as before with Unit Stats (i.e. Attack) affecting which units move first, how far they can move, what damage they can make, how accurate they are, and how much they resist attacks, with the usual array of buffs and debuffs from the Final Fantasy series (such as Blind and Haste), still appearing as before. Some enemies that can be encountered appear in larger sizes, taking up multiple squares on the grid and can be considered \"Bosses\" in a way. While some battles are initiated if part of a quest, others can occur from random fights encountered on the game map. The \"Law\" system from before remains a part of the battles, but was given a much needed change; it no longer hinders the player as such, but it still can determine how they act in a battle. When a battle begins, the \"Judge\" appoints a law on the battle as before (such as not using an element, like fire, against enemies), but if the player breaks it, the judge goes, and while they may fight on, clan members that get KO'ed after the judge goes, cannot be revived. The clan members also lose their Clan Privilege; after clan members are picked, the player may pick a Privilege, a new feature in the game, which is an advantage to help in the fight, from improved damage, to better luck, or empowering a certain race of clan members (i.e. Humes). If the Law is broken, this advantage is lost, but the fight can still be won. Sticking to the law, has more than the benefit of the advantage, as the player will receive a bonus at the end of the fight granting equipment, items and loot.\r\n\r\nThe game map was also developed further from the predecessor. It removed the placement system of locations onto the world, to a more standard world map that included \"area maps\". The area maps feature multiple battle locations and a town in some areas, which work similar to its predecessor, except when the player wishes to move to another area they travel to an exit point, transitioning from the current area map to the world map; travelling between area maps instead of locations within them, takes a day of in-game time just as battles and quest events do. Travelling into an area map, the player may encounter hostile monsters roaming a location, new clan members wanting to join (depending on the in-game month of the year), and various random events which can include encounters with rival clans, all at different locations in the area.\r\n\r\nAs stated above, the jobs clan members can have, were expanded from the first game, with the classic jobs added to by new ones, including exclusive jobs certain characters may acquire/have. Characters still learn abilities as before by equipping job-specific weapons, armour, and items, and clearing battles to net Ability Points, which go towards Mastering the abilities in equipped items, such as a sword or piece of headgear. Once they have mastered the ability, they can use it in their job, without having the item it was learnt from equipped on them, allowing them to work on another ability in the job (switching to another piece of equipment with a new ability to master). Eventually, characters can use any abilities they've mastered when using a different job, for example a black mage who fights as a thief, may equip the ability to use black magic alongside the abilities of the thief; players unlock other jobs for clan members as before by acquiring a set number of abilities in a job, though some jobs are unavailable until a certain quest for the job is completed. When setting abilities to use, a player may set them under certain categories as before; by default, apart from attack, a player has access to the Action abilities of the current job they are in, with a second Action ability they can customise from either any other job, or for items. Players may also use reaction abilities (such as counter) from other jobs though one can only be set, and passive abilities, which can be used with other jobs as well, once mastered (i.e. a white monk can use a shield after mastering the Shield bearer ability), but again only one can be equipped. In this way, a player can tailor-make a clan member to prepare them for whatever fights are in store.\r\n\r\nClan privileges, as stated earlier, are not acquired through normal means, but by taking on Clan Trials, special quests that require Clan Points to pay for them. When a trial is taken on, the player must select a title for the trial, the higher the title, the more challenging the goal of the trial. Completing it bestows benefits when completed, depending on the difficulty of the title; there are five titles for each trial, but only one can be taken at a time. Completion of a title's goal include changes to clan talents (either increasing one and decreasing its counterpart, or improving all), with some trials also decreasing the prices at pubs and shops for quests and items, while certain titles need to be passed to acquire the new privileges.\r\n\r\nGrimoire of the Rift is compatible with its predecessor, Final Fantasy Tactics Advance. With Advance inserted into Slot 2, a player can begin A2 with the Clan Privilege \"Libra\" already known. This ability is also available later through a clan trial in the game. The player may also acquire a privilege during the early beginnings of the game depending on how they answer a set of a questions.",
  "banner_url": "/games/banner/final-fantasy-tactics-a2-grimoire-of-the-rift.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:29:30.791589Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 14009
}