{
  "name": "ISLAND",
  "slug": "island",
  "year": 2018,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Visual novel"
    }
  ],
  "aliases": [],
  "description": "ISLAND is an intricate visual novel with multiple routes and endings. Through use of the game's flowchart system, players navigate through the story and uncover clues to unravel the mysteries of Urashima, the titular island.\r\n\r\nThe story of ISLAND revolves around Sanzenkai Setsuna, a young man who wakes up on the shore of Urashima with no memories of his past. During the game, you'll explore Setsuna's relationship with three girls on the island, Rinne, Karen, and Sara. As he uncovers the hidden secrets of Urashima's past - and future - Setsuna must fight against fate to protect that which he treasures most.\r\n\r\nWill you be able to discover the truth and save Urashima, or find yourself lost among the ISLAND's many dead ends?\r\n\r\nWorld and Background\r\n\r\nUrashima is a small island, far from mainland Japan. It's a true utopia, blessed with rich natural beauty. But the island harbors a difficult past, and it's about to be erased, silently, from history.\r\nSoot blight syndrome, an endemic disease, has brought about a rift between the island and the mainland. An offshore platform intended for marine research has long been left abandoned; five years ago, three separate incidents brought the once influential Three Families of Urashima to near ruin. Rumors about children being spirited away have become part of the local folklore, alongside another legend, one that has been repeated on the island since time immemorial...\r\n\r\n\"Let me tell you the legend of this island: it's a story of tragic love...\"\r\n\r\nThe key to saving the island lies with three girls, each of whom belongs to one of the Three Families. These girls aren't able to change the fate of the island by themselves, but might they succeed with the help of the young man who's just washed ashore? Claiming that he's traveled back in time, the man immediately sets out on a lonely path, challenging the longstanding traditions of the island, and seeking to change the future. But those aren't his only goals...\r\n\r\nHow will his presence transform the lives of these three girls, the future of the island, and the fate of the world...?",
  "banner_url": "/games/banner/island.jpg",
  "icon_url": "/games/icon/island.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:58.806204Z",
  "steamid": 857450,
  "gogslug": "",
  "humblestoreid": ""
}