{
  "name": "Hot Wheels: Ultimate Racing",
  "slug": "hot-wheels-ultimate-racing",
  "year": 2007,
  "platforms": [
    {
      "name": "Sony PSP"
    }
  ],
  "genres": [
    {
      "name": "Racing"
    }
  ],
  "aliases": [],
  "description": "Ultimate Racing is the first game in the series of Hot Wheels licensees to appear on the PSP platform. Just like the other games, it is a straightforward racing game with a focus on arcade gameplay. The game offers three game modes: Ultimate Challenge: win races to unlock new cars, tracks, challenges and performance upgrades. Arcade Mode: quick play based on the unlocked content from the Ultimate Challenge mode. Multiplayer Mode: quick races or checkpoint-based races for up to four players In Ultimate Challenge, there are six main stages to choose from, with eleven tracks and twenty licensed cars in total. The game starts from a central warehouse where all unlocked cars are stored. These can be upgraded or customized in the garage. Next to the performance upgrades, players can tweak the colors of the body, glass, neon, wheels, and change the wheels and decals. The Arcade Mode is further divided into different challenges: Quick Race, Survival Mode (complete a series of increasingly difficult races and avoid being kicked out), Collector (checkpoint-based races) and Time Trial. Next to regular racing controls such as brakes and acceleration, players can also use NOS (boost) and Slow Motion (slow down time during difficult sections). The use is limited as it depletes a reserve. It can be refilled by passing by obstacles without hitting them or completing tricky jumps. Tracks, with themes such as Volcano, Jungle or Death Valley, are generally filled with obstacles, moving objects or animals. The focus is entirely on racing, there are no weapons or other offensive means and the cars can only be slowed down, unable to sustain damage. There are three different camera settings and ghost cars are supported during time trials.",
  "banner_url": "/games/banner/hot-wheels-ultimate-racing.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-02-03T03:41:34.530026Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}