{
  "name": "Might and Magic VII: For Blood and Honor",
  "slug": "might-and-magic-vii-for-blood-and-honor",
  "year": 1999,
  "description": "\"Might and Magic VII is a role-playing game set in Erathia, a mystical land of magic and adventure. You will guide the actions of a group of four heroes - armored swordsmen, daring thieves, gifted archers and wielders of arcane sorcery - as they explore the land, sea and subterranean passages in search of treasure and glory. Your characters will begin their journey possessing only the most basic skills and equipment, and are barely deserving of the title \"adventurer.\" As they continue, however, they will acquire personal abilities, enchanted artifacts, deadly weapons, and powerful knowledge, all of which they will need to face the greater challenges ahead... to one day epitomize a true adventurer.\"\r\n\r\nFor Blood and Honor is the seventh installment in the Might and Magic series of role-playing games, and a sequel to both the third and the sixth one plot-wise. It uses the same 3D engine as its immediate predecessor in the series, and also allows the player to generate and control a party of four characters and alternate between real-time or turn-based battle systems. As opposed to the human-only party of the previous game, the player can choose between humans, elves, dwarves, and goblins. The class and skill system from the sixth game returns as well, with a few minor adjustments.\r\n\r\nThis installment of the series places an emphasis on moral decisions, allowing the player-controlled party to ally with different factions and ultimately choose either a good or an evil path. There are also side quests in the game, some of which are time-sensitive and require the player to consult an in-game calendar. The card mini-game Arcomage is introduced as well.",
  "banner_url": "/games/banner/might-and-magic-vii-for-blood-and-honor.jpg",
  "icon_url": "/games/icon/might-and-magic-vii-for-blood-and-honor.png",
  "is_public": true,
  "updated": "2019-05-12T04:06:59.685145Z",
  "steamid": null,
  "gogslug": "might_and_magic_7_for_blood_and_honor",
  "humblestoreid": ""
}