{
  "name": "Lunar: Dragon Song",
  "slug": "lunar-dragon-song",
  "year": 2005,
  "description": "Lunar: Dragon Song, known in Japan and Europe as Lunar Genesis (ルナ-ジェネシス- Runa Jenesisu), is a role-playing video game developed by Japan Art Media for the Nintendo DS handheld console. The game was originally released in Japan by Marvelous Interactive on August 25, 2005, with an English-language version made available in North America by Ubisoft Entertainment on September 27, 2005, and a European version on February 17, 2006 by Rising Star Games. As the first original Lunar series title in ten years, it was also the first traditional role-playing game available for the Nintendo DS, utilizing several new features such as combat taking place across of two screens and the use of the system's built-in mic to issue commands.\r\n\r\nThe game takes place a thousand years before the events of the first Lunar game, Lunar: The Silver Star, and centers on Jian Campbell, a young delivery boy and adventurer who must save the world from the rising menace of the Vile Tribe, a race of powerful magicians who wish to gain control of the goddess Althena and take over the world. Largely panned by critics, the game has received negative reviews due to a number of gameplay additions often seen as tedious and debilitating, such as the inability to target specific enemies in combat, as well as the decision to not include series mainstays such as voice acting and full-motion video sequences.\r\n\r\nLunar: Dragon Song is a traditional two-dimensional role-playing video game with an overhead, isometric viewpoint. Players may move the game's characters in eight directions using the Nintendo DS D-pad or stylus across of a number of different environments and completing story-based objects to move the plot forward. The game includes several differences to other games in the Lunar series, including a simplified world map that allows players to instantly travel to adjacent locations, and a condensed menu accessible from the bottom screen. A card collection system first seen in Lunar Legend is expanded to allow the cards to be used for beneficial effects, such as granting special abilities and changing game mechanics. Using the Nintendo DS wireless connection, two players can participate in a multiplayer game using cards obtained through normal gameplay called Scratch Battle. By scratching off sections of each card, a player can \"damage\" their opponent by revealing numbers on its surface.\r\n\r\nUnlike previous Lunar games that took a strategy-based approach to combat, Lunar: Dragon Song relies on a strictly traditional turn-based system where the player inputs commands at the start of each combat round with the appropriate actions taking place in accordance with a character's speed. While a player may freely select any character to use items or supportive magic on, specific enemies cannot be targeted by attacks, with the character artificial intelligence instead choosing the target itself. Game producer and Japan Art Media president Mitsuru Takahashi stated that the game's battle system was made intentionally simplistic to \"speed up\" combat sequences, as well as streamline the battling process. A player's party may consist of no more than three characters, each of which are switched in or out automatically at certain points throughout the story, with no way to actively switch between them. Before going into battle, a player may choose one of two different modes: Combat and Virtue. Virtue Mode allows a player to earn experience points known as \"Althena Conduct\" after winning a battle which go towards gaining levels which grant characters increased statistics and new skills. Combat Mode instead yields items.",
  "banner_url": "/games/banner/lunar-dragon-song.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:14.269822Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13979
}