{
  "name": "La-Mulana",
  "slug": "la-mulana",
  "year": 2012,
  "description": "LA-MULANA is an “Archaeological Ruin Exploration Action Game,” bringing the classic appeal of adventure with the punishing difficulty of retro-inspired gaming. Search inside ancient ruins, seeking out the “Secret Treasure of Life” – which sleeps in the sprawling ruins of “LA-MULANA” and is said to be the beginning of all civilization. Unfortunately, priceless artifacts very rarely give themselves up easily. \r\n\r\nApart from the plethora of traps lying in wait, there are also monsters on the prowl, protecting the ruins. Head for the innermost depths of the ruins while solving a variety of mysteries, fending off monsters, and disarming traps. Forging ahead will be no simple task – the further into the depths you reach, the more difficult the mysteries become. The guardians of LA-MULANA do not take their job lightly. \r\n \r\nLA-MULANA on Steam is the PC port version of the acclaimed remake for WiiWare. One of the first NIGORO games, LA-MULANA was originally created back in the creators’ “amateur” days and has been renown worldwide. \r\nThis game was created based on “that old-time feeling.” The creators wished to play the sort of games that enthralled them back in the day, only with more volume. The operability and difficulty level are certainly not “new school”. However, this game is highly recommended to gamers seeking out that feeling of total immersion that allows you to go full-on head-to-head with a game not found in somewhat lighter terms. \r\n\r\nComing up on it's ninth birthday, LA-MULANA continues to captivate, frustrate and annihilate new and old players alike. Whether it's your first time falling into the ruins or your 900th of getting decimated by Mushussu, we thank you for donning your explorer's hat, hoisting the whip and diving into our game. \r\n\r\nGood luck. You're going to need it.",
  "banner_url": "/games/banner/la-mulana.jpg",
  "icon_url": "/games/icon/la-mulana.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:46.970504Z",
  "steamid": 230700,
  "gogslug": "la_mulana",
  "humblestoreid": "",
  "id": 1640
}