{
  "name": "1080° Avalanche",
  "slug": "1080-avalanche",
  "year": 2003,
  "platforms": [
    {
      "name": "GameCube"
    }
  ],
  "genres": [
    {
      "name": "Sports"
    }
  ],
  "aliases": [],
  "description": "Danger is the name of the game in 1080° Avalanche. Huge air, massive drop-offs, deep powder and the nastiest tricks come together in one of tightest snowboarding games available. 1080° Avalanche is a worthy successor to the Nintendo 64 version of the game, with a wide variety of play modes, challenges and secrets to keep you on your toes (or heels, if you're turning the other way).\r\n\r\nFeatures:\r\n   *  Constantly changing environments make every run an adrenaline-packed thrill ride. Contend with massive avalanches, rockslides, cave-ins, bridge collapses and environments teeming with wildlife and skiers.\r\n   *  A sick trick system lets you flip, spin, grab, grind and tweak your way to glory.\r\n   *  Game modes include Match Race, Gate Challenge, Time Trial, Multiplayer and Trick Attack.\r\n   *  Race against your friends in intense four-player races. Connect up to four Nintendo GameCubes in LAN mode for the ultimate race!\r\n\r\n\r\n1080° Avalanche is teeming with challenges. In Match Race mode, your goal is to beat an opponent to the bottom of the mountain in a variety of difficulty levels. Stick tricks on the way down to increase your rider's speed and power. There are multiple routes to find on each run, so be sure to scour the landscape for grindable trees and hidden shortcuts.\r\n\r\nOne of the best things about 1080° Avalanche is the element of surprise. Huge drop-offs can easily catch you off-guard, and if you don't land just right you're toast. Rockslides, natural wildlife, dizzying drops, and sudden weather changes keep things interesting, but nothing compares to the incredible avalanche sequences which will definitely get your heart racing.",
  "banner_url": "/games/banner/1080-avalanche.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-04-05T08:11:12.857219Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}