{
  "name": "Hyperdevotion Noire: Goddess Black Heart",
  "slug": "hyperdevotion-noire-goddess-black-heart",
  "year": 2016,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "RPG"
    },
    {
      "name": "Strategy"
    }
  ],
  "aliases": [],
  "description": "In this chibi-style* strategy role-playing game you'll amass an army of game-referencing allies, fight on trap-laden maps, and beef up Lily Rank for crazy damage. But look out for status ailments or you might be (literal) tofu! You ain't seen the Neptunia characters like this before!\r\n*”Chibi-style” – Adorable anime characters miniaturized to have charmingly big heads and daintily tiny bodies.\r\n\r\nKey Features\r\n\r\n    A 1080p Moe Army Awaits! Lead your loveable and cute moe army into SRPG battle and fight off hordes of enemies in turn-based strategy - now in high definition! You'll have to strategize to dodge laser beams, flaming pits, and more!\r\n    Link up with the “Lily System” The more often characters are in battle together, the higher their bond becomes. Activating the “Lily Boost” grants special stats and abilities, while “Lily Points” can be used to activate ultra-special moves and even goddess transformations. Don’t be shy to build up those battle relationships and seal it all with a kiss!\r\n    Check your Status! All kinds of funky things can happen in the heat of battle and characters can be hit with status ailments that are both boon and burden. You can get pixelated, zombie-fied, or even turned into a block of tofu! Some status changes come with their own benefit and cost, so keep this in mind during a fight.\r\n    Item Customization! You’ll get tons of replay value with so many ways to boost your gear’s stats! The more enemies you defeat, the more items you can get to customize your gear in whatever way you see fit. Let the great experiment begin!\r\n    Livin’ the Noire Life! Life’s not all about grid-based battles. Sometimes Noire just wants to relax at home, and with the “Sim Noire” mode you’ll be able to do just that! Customize the place by buying furniture and accessories with in-game points, and make Noire feel like the goddess she is – unlocking extra scenes in the process.",
  "banner_url": "/games/banner/hyperdevotion-noire-goddess-black-heart.jpg",
  "icon_url": "/games/icon/hyperdevotion-noire-goddess-black-heart.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:53.594922Z",
  "steamid": 415480,
  "gogslug": "",
  "humblestoreid": ""
}