{
  "name": "Phoenix Wright: Ace Attorney: Trials and Tribulations",
  "slug": "phoenix-wright-ace-attorney-trials-and-tribulation",
  "year": 2007,
  "description": "Phoenix Wright: Ace Attorney − Trials and Tribulations[a] is a visual novel adventure video game developed and published by Capcom. It was originally released for the Game Boy Advance in 2004 in Japan, and has since been released for several platforms, including a Nintendo DS version that was released in 2007 in Japan and North America and in 2008 in Europe. It is the third game in the Ace Attorney series, following Phoenix Wright: Ace Attorney (2001) and Justice for All (2002).\r\n\r\nThe story follows defense attorneys Phoenix Wright and Mia Fey, who defend their clients in five episodes. Among other characters are Phoenix's assistant and Mia's sister Maya Fey, her cousin Pearl, and prosecutor Godot. The gameplay is split into courtroom sections, where the player cross-examines witnesses and tries to discover contradictions in their testimonies, and investigations, where they gather evidence and talk to witnesses.\r\n\r\nThe game was directed and written by Shu Takumi as the last game in an Ace Attorney trilogy; he also wanted it to be the final entry in the series, as he felt he had explored Phoenix's character fully. Because he was satisfied with the gameplay in Justice for All, he did not introduce any new gameplay mechanics in Trials and Tribulations. Flashbacks were used as a major theme in the game; this originated in Takumi trying to come up with a way of handling dialogue-integrated tutorials, and deciding to use a flashback to a case from when Mia was a rookie attorney.\r\n\r\nThe game has received generally favorable reviews, with reviewers liking the story, writing, character designs and music, but with some criticizing the lack of new gameplay mechanics. Additionally, the Wii version was criticized for using resized graphics from the Nintendo DS version, without any modifications to make them appear better on a larger screen. The Nintendo DS version was a commercial success in North America, with pre-orders being more than double the amount Capcom had estimated.\r\n\r\nTrials and Tribulations is a visual novel adventure game[1] in which the player takes the roles of Phoenix Wright and Mia Fey, defense attorneys who defend their clients in five different episodes.[2][3] The gameplay remains unchanged from Justice for All, the previous title in the series.[2][4]\r\n\r\nFrom the start, only one episode is available to play; when the player completes an episode, a new one is unlocked. The episodes are divided into chapters, which consist of investigations and courtroom sessions.[5] During investigation sections, the player aims to find evidence for use in the courtroom sessions; the game moves on to the next chapter within the episode when the player has gathered enough evidence. The player moves and performs actions through a menu with four options: \"examine\", which lets them move a cursor over the environment and examine items; \"move\", which shows a menu with locations the player can move to; talk, which shows a list of topics the player can discuss with witnesses in the area; and present, which lets the player show evidence or character profiles to a witness.[6] Some witnesses do not want to discuss certain subjects, leading to a lock symbol appearing over the subject. By showing the witness a magatama, the player is able to see the secret they are trying to hide in the form of locks, called a \"Psyche-Lock\"; by presenting correct evidence or character profiles, the player can break the locks and be able to discuss the subject.[7]\r\n\r\nDuring the courtroom sections, the player defends their client and cross-examines the witnesses. They can move back and forth between the statements in each testimony; if they find a contradiction between a statement and the evidence, they can point out the contradiction by presenting a relevant piece of evidence or character profile. The player can also choose to question a statement, which sometimes leads to changes in the testimony.[8] A life bar, representing the judge's patience, is shown in the upper right corner of the screen. If the player presents incorrect evidence or profiles, the bar will decrease; if it reaches zero, the player loses and their client is declared guilty. The bar will also decrease if the player makes mistakes while trying to break psyche-locks; however, the player can not lose while trying to break psyche-locks. 50% of the life bar gets restored when the player manages to break a psyche-lock, and it gets fully restored when the player completes an episode.[9]",
  "banner_url": "/games/banner/phoenix-wright-ace-attorney-trials-and-tribulation.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:43.878045Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 14001
}