{
  "name": "Book of Demons",
  "slug": "book-of-demons",
  "year": 2016,
  "description": "Book of Demons is hack & slash distilled to its purest form. Devilishly charming and fun as hell. Slay the armies of darkness in the dungeons below the Old Cathedral and save the terror-stricken Paperverse from the clutches of the Archdemon himself. The game is the first installment of Return 2 Games - a series of original mid-core titles, inspired by the early golden days of PC gaming.\r\n\r\nDecide the length of quests!\r\n- Have only 5 minutes for a game? No problem! Book of Demons allows you to set the length of each quest, thanks to our Flexiscope™ system. It learns your way of playing and gives you the best experience, making Book of Demons the first truly accessible hack & slash!\r\n\r\nBuild your own deck of devastating skills!\r\n- Collect powerful skill cards, combine them depending on the enemies you're facing and assemble your favorite set of devastating powers! But be warned: efficiency of each card will greatly depend on the situation you're in, so be prepared to make constant adjustments!\r\n\r\nRelive the classic with a good laugh!\r\n- Book of Demons is a universal tale of good and evil about saving the world from total destruction and ultimate devilry! Sounds familiar? Well, how about retelling the story in a different way, with a humorous twist of a parody?\r\n\r\nBe a part of a one-of-a-kind adventure!\r\n- Never explore the same dungeon twice - in Book of Demons every level is a procedurally generated, randomly-populated adventure of its own! You won't get bored by the diversity of monsters either - there are over 70 kinds of creatures waiting to be slain: lurking scorpions, snake archers, mad goatmen, not-so-sexy succubi... you get the idea.\r\n\r\nHack & slash in the world of Paperverse!\r\n- Book of Demons is indeed a dark fantasy hack & slash, but unlike other action role-playing games, it's set in the pop-up book world of Paperverse. The paper-cut universe is one of the hallmarks of Return 2 Games - a series of mid-core games, inspired by the early golden days of PC gaming. Book of Demons is the first installment of the Return 2 Games series.\r\n\r\nLooking for even more challenge?\r\n- Slaying the Archdemon won't be the end of the story. In Book of Demons, you can master the campaign with 3 different classes (Warrior, Rogue or Mage), revisit your favorite quests in Freeplay mode or rise to the challenge and explore the dungeons on higher difficulty levels (the last one is called Massacre, with good reason).",
  "banner_url": "/games/banner/book-of-demons.jpg",
  "icon_url": "/games/icon/book-of-demons.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:36.537285Z",
  "steamid": 449960,
  "gogid": 1580300418,
  "gogslug": "book_of_demons",
  "humblestoreid": "",
  "id": 10276
}