{
  "name": "Fatal Fury: King of Fighters",
  "slug": "fatal-fury",
  "year": 1991,
  "platforms": [
    {
      "name": "Neo Geo"
    },
    {
      "name": "Sega Genesis / Mega Drive"
    },
    {
      "name": "Sony PSP"
    },
    {
      "name": "Super Nintendo"
    }
  ],
  "genres": [
    {
      "name": "Beat'em up"
    }
  ],
  "aliases": [],
  "description": "Fatal Fury: King of Fighters (Japanese: 餓狼伝説 ～宿命の闘い～ Hepburn: Garō Densetsu Shukumei no Tatakai, \"Legend of the Hungry Wolf: The Battle of Destiny\") is a 1991 head-to-head fighting game released by SNK for the Neo Geo arcade and home platforms. Fatal Fury was SNK's first fighting game for the Neo Geo system and served as the inaugural game in their Fatal Fury series, as well as the first game to depict the fictional \"King of Fighters\" tournament (which became the basis for the later The King of Fighters games). Many of SNK's mainstay characters, including the Bogard brothers Terry and Andy, friend Joe Higashi, and their nemesis Geese Howard, made their debut in this game.\r\n\r\nThe gameplay follows the typical formula of most fighting games: the player competes against their opponent in best two-out-of-three matches. The play controls consists of an eight directional joystick and three attack buttons: punch, kick and throw. Each of the playable characters has special techniques that are performed by inputting specific commands in combination with the joystick and buttons. The input methods for special moves are shown to the player during the course of the game (after every bonus round), as opposed to being given in an instruction card in the game's cabinet.\r\n\r\nThe most novel aspect of Fatal Fury were the addition of two-lane battles. Many stages featured two rows, a background row and a foreground row. Players can change between rows at any time other than in the Single Player Mode, where they have to wait for the CPU opponent to change rows before they can in almost every stage. The player is not required, however, to do so.\r\n\r\nWhen a second player joins during the middle of a one-player fight, instead of postponing the current battle for a match between the two players, the game will make both players team-up against the current CPU opponent in a two-on-one match before their battle takes place.\r\n\r\nAfter every second match in the single player tournament, the player will participate in a bonus round mini-game involving an arm wrestling match against a machine. The player must tap the A button rapidly to win these mini-games.",
  "banner_url": "/games/banner/fatal-fury.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:29.232796Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}