{
  "name": "PlayStation All-Stars Battle Royale",
  "slug": "playstation-all-stars-battle-royale",
  "year": 2012,
  "description": "PlayStation All-Stars Battle Royale is a crossover fighting game with characters from different PlayStation titles along with some from third-party titles, similar to Nintendo's Super Smash Brothers series. Up to four characters fight in small arenas that are in 3D but shown from a side-view. Games are not won by merely fighting until a character loses all its health. Instead, dealing damage is rewarded through orbs that then appear in the stage. When collected they build up a power meter near the bottom of the screen. Once enough power has been gathered, one of the three levels of super moves can be executed, used to kill characters and earn points.\r\n\r\nGame modes include a single-player arcade mode against random characters, with a specific rival character battle at the end and then a final battle against the main antagonist Polygon Man, the former Sony PlayStation mascot. There's also a challenge single-player mode where specific objectives need to be completed. Multiplayer modes include matches with a time-limit (gain the most kills), stock based matches (last one standing) and matches with a kill limit to win the game. Cross-platform matches between the PS3 and Vita version are supported and a code to download a copy of the Vita version is provided for free with the PS3 version (cross-buy).\r\n\r\nEach character has a specific set of moves, throws and special actions. Stages are often built with multiple levels of platforms with the camera zooming in or out dynamically. The environments are also based on popular franchises (each stage always has two different influences combined) and they often include environmental elements that influence the gameplay and can hurt the characters. In addition offensive items can be picked up to deal more damage. Additional costumes can be unlocked for each of the characters.\r\n\r\nThe base game contains 20 playable characters:\r\n\r\n-Big Daddy \r\n-Cole MacGrath\r\n-Colonel Radec \r\n-Dante \r\n-Evil Cole MacGrath \r\n-Fat Princess \r\n-Heihachi Mishima \r\n-Jak and Daxter \r\n-Kratos \r\n-Nariko \r\n-Nathan Drake \r\n-PaRappa \r\n-Raiden \r\n-Ratchet and Clank \r\n-Sackboy \r\n-Sir Daniel Fortesque \r\n-Spike \r\n-Sweet Tooth \r\n-Toro Inoue \r\n\r\nOther franchises referenced through the stage design or items include:\r\n\r\n-Buzz! series\r\n-Hot Shots Golf / Minna no Golf series\r\n- LocoRoco series\r\n-ModNation series\r\n-Patapon series\r\n-Resistance series\r\n-Warhawk\r\n-WipEout series",
  "banner_url": "/games/banner/playstation-all-stars-battle-royale.jpg",
  "icon_url": "",
  "is_public": false,
  "updated": "2020-06-27T23:23:09.238324Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 37545
}