{
  "name": "0 A.D.",
  "slug": "0-ad",
  "year": 2014,
  "platforms": [
    {
      "name": "Linux"
    }
  ],
  "genres": [
    {
      "name": "Real-time strategy"
    }
  ],
  "aliases": [],
  "description": "0 A.D. is a free, open-source, historical Real Time Strategy game currently under development by Wildfire Games, a global group of volunteer game developers. Lead a civilization set in the imaginary year of 0 A.D., develop a thriving city, raise a mighty army and contend with rivals for hegemony of the world. History is yours for the taking!\r\n\r\nIntense Gameplay:\r\n* Cross-platform: 0 A.D. is set to run on Windows, Linux and OS X.\r\n* Unique civilizations: In 0 A.D. each civilization is unique in its appearance and gameplay, including units, structures, and technology trees.\r\n* Citizen soldiers: Some infantry and cavalry units can not only fight, but also gather resources and construct buildings, making them substantially more versatile than in typical RTS games.\r\n* Combat experience matters: The more time your citizen soldiers spend fighting your enemies, the higher they go up the ranks. With each rank, they become stronger, but they also get worse at civilian tasks.\r\n* Technology tradeoffs: Some technologies are arranged in pairs, and within each pair, you can only research one technology at most in each game. This choice is irreversible, so choose carefully!\r\n* Unit formations: Arrange your units in historical battle formations from the Phalanx to the Testudo and gain bonuses, such as increased armor. However, beware the costs that may come with them, such as lower speed! (As of August 2012, this feature has not been implemented yet.)\r\n\r\nRealism and Authenticity:\r\n* Real world map realism: Random maps are based upon real geography of the ancient world with realistic plants, animals and terrain.\r\n* Authentic historical details: Designs of units, buildings and technologies all reflect the hallmarks of each civilization. We even give them names in the original ancient Greek, Latin, Punic, Celtic, etc.\r\n* Planned lifelike naval warfare: Ships will be on a much larger and more lifelike scale than seen in other games. They will move more realistically and even be able to ram other ships.\r\n\r\nMake the game your own:\r\n* Translation and locale support: Play 0 A.D. in over a dozen languages.\r\n* Powerful map editor: Draw landscapes with a palette of hundreds of terrains, build majestic cities and set the position of the sun in the Atlas Editor, your tool to design intricately detailed maps in 0 A.D.\r\n* Excellent moddability: From new computer opponent behaviors to extra civilizations, easily create your own modifications (mods) of 0 A.D. by editing game files, all freely available in standard, open formats.",
  "banner_url": "/games/banner/0-ad.jpg",
  "icon_url": "/games/icon/0-ad.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:07.295849Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}