{
  "name": "Halcyon 6: Lightspeed Edition",
  "slug": "halcyon-6-lightspeed-edition",
  "year": 2017,
  "description": "LIGHTSPEED EDITION\r\nHalcyon 6: Lightspeed Edition brings together the original Halcyon 6 base game along with all of the additional content (Combat & Customization, Diplomatic Diversions, Loot’em Up, and Morale Booster updates) released since launch in Sept 2016 as well as brand new Lightspeed Edition optimizations and features as follows:\r\n\r\nStreamlined Campaign\r\nGreatly speeds up progression and tightens the campaign to an action and adventure packed 12 hrs depending on your play style and pace.\r\n\r\nStreamlined All Systems\r\nFor faster progression, including economy, starbase, resources, and officer levelling.\r\n\r\nNew Officer Progression System\r\nWith 6 subclasses, 3 Prestige classes, new skill tree, and over 20+ new Prestige/Epic powers.\r\n\r\nNew Ship Loadout and Config Screen\r\nWill let you customize loadouts (and save them) for your ships just before entering combat\r\n\r\nNew Difficulty Mode\r\nCalled Vice Admiral and slightly increased difficulty across the board\r\n\r\nEnhanced Combat\r\nIncludes 25+ new alien faction space combat abilities, more combos for both players and enemies, increased faction weaknesses and resistances, and other balancing tweaks\r\n\r\nNew UI Overhaul\r\nDesigned for greater readability and usability. Many many UI quality of life enhancements to all areas of the game, too many to list here.\r\n\r\nHalcyon 6\r\nOn the edge of Terran space lies Halcyon 6, a derelict starbase left behind by a mysterious precursor race. Your mission is to reclaim the derelict station and rebuild it.A mysterious alien force is making a beeline towards Earth and this starbase is the best chance for the New Terran Federation to establish new alliances, research new technologies and otherwise figure out a way to stop the impending invasion.\r\n\r\nUsing only the resources you can salvage from the derelict station and gathered from nearby star systems, it’s up to you to rebuild the starbase to lead the Terran Republic’s scientific research, exploration and diplomatic efforts on the edge of known space.\r\n\r\nHalcyon 6: Lightspeed Edition is a passion project whose design is inspired by our years spent playing classic games like Star Control, Master of Orion, X-COM, Civilization and new classics like FTL.\r\nBase Building: spend resources to build station facilities (rooms) to enhance your production and technological capabilities, or build ships to help you control more territory\r\nExploration: assign your fleets to nearby star clusters, where they can handle emerging enemy threats, do missions for alien factions or secure bonus resources\r\nCrew Management: assign crew to station facilities to greatly improve their output efficiency, or to ships where they can contribute in unique ways to combat, missions and events\r\nDeep Tactical Combat: fight tactical ship or ground battles to resolve hostile events, create a foothold in the sector and ultimately defeat the enemy mothership!\r\nStory Events: based on game criteria like rooms-built, alien diplomacy scores or officer traits/skills, the game will produce story events (often with multiple choice outcomes) that can lead to combat, time-related applied bonuses/negatives, officer attribute changes or any number of crazy in-game stories.",
  "banner_url": "/games/banner/halcyon-6-lightspeed-edition.jpg",
  "icon_url": "/games/icon/halcyon-6-lightspeed-edition.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:44.153635Z",
  "steamid": 651660,
  "gogslug": "halcyon_6_lightspeed_edition",
  "humblestoreid": "",
  "id": 13607
}