{
  "name": "Myth: The Fallen Lords",
  "slug": "myth-the-fallen-lords",
  "year": 1997,
  "description": "Myth: The Fallen Lords is the first real-time strategy game set in a truly 3D world. For the first time a game of battle actually looks and feels like you're down in the trences, hand-to-hand with the enemy. The game's 3D engine supports an ultrarealistic physics model, so that arrows arc gracefully and bounce off armor and limbs fly through the air trailing gore. No detail is spared in bringing the action of a fantasy battlefield to bloody life, and the unrestricted point of view lets you rotate, zoom, and view the carnage from any angle.\r\n\r\nYou command many types of warriors, from a handful to hundreds at a time, who battle with fire, steel, and supernatural powers. Their enemy: the Fallen Lords, a band of ancient and terrible sorcerer-generals who lay waste to the land with legions of vicious beasts and the tireless undead. Surviving them requires quick reflexes, tactical cunning, and ruthless determination. You must use the terrain to your advantage, maintain discipline over the troops, and deal with the mounting horror as the eternal cycle of mythic bloodshed begins anew... \r\n\r\n* Stunning Landscapes - A wide variety of smoothly sloping 3D terrains are the setting; rainy swamps and thick forests, ruined cities and snowy mountain passes, landscapes as deadly as they are beautiful.\r\n\r\n* Fortified with Realism - The ground is charred and cratered by explosions, water splashes and reflects your passage, dropped weapons and scraps of armor litter the battlefield, explosions ripple the ground and heads roll downhill.\r\n\r\n* Unrelenting Gameplay - The troops are yours to charge and retreat, wheel through maneuvers and charge into the bloody fray. Flexibility and discipline are key to survival.\r\n\r\n* Multiplayer Mayhem - Get on bungie.net for free Internet multi-player games against friends, enemies and total strangers: King of the Hill, Capture the Flag, territories and many more, even in teams.\r\n\r\n* A Legendary Saga - A rich and complex story unfolds, illustrated with strategic maps and movie-quality animated clips. Battle betrayal in your own ranks while rivalries amongst the Fallen strengthen your hand and ancient myths return to life.",
  "banner_url": "/games/banner/myth-the-fallen-lords.jpg",
  "icon_url": "/games/icon/myth-the-fallen-lords.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:29.300801Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}