{
  "name": "Deus Ex: Human Revolution - Director's Cut",
  "slug": "deus-ex-human-revolution-directors-cut",
  "year": 2013,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "FPS"
    },
    {
      "name": "RPG"
    }
  ],
  "aliases": [],
  "description": "You play Adam Jensen, an ex-SWAT specialist who's been handpicked to oversee the defensive needs of one of America's most experimental biotechnology firms. Your job is to safeguard company secrets, but when a black ops team breaks in and kills the very scientists you were hired to protect, everything you thought you knew about your job changes.\r\n\r\nKey Features:\r\n\r\n-    A divided near-future: discover a time of great technological advancement, but also a time of chaos and conspiracy. Mechanical augmentations of the human body have divided society between those who can afford them, and those who can’t. Opposing forces conspire from the shadow to control the destiny of mankind: a human revolution is coming.\r\n\r\n-    A perfect mix of action and role-play: the game uniquely combines action-packed close-quarters takedowns with intense shooting, offering a vast array of character augmentations and upgrades for the many weapons at your disposal. Unlock new abilities and increase your stealth, social, hacking or combat skills: the game rewards all styles of play and approaches. Determine how you want your character to evolve, based on how you want to play the game.\r\n\r\n-    Choices and consequences: shoot your way through the enemies, sneak up behind them without being traced, hack systems to retrieve crucial information, or use your social skills to extract information from key characters – there are always choices, multiple approaches, multiple paths and multiple tools at your disposal. Choose your playing style and face the consequences of your actions: you decide how the story unfolds in his enhanced storyline featuring the full integration of \"The Missing Link\" and \"Tongs Mission\". Find more ways to defeat the new and improved Boss Fights, use the Newgame+ feature to replay the story with your previously acquired augmentations. Learn more about the game with the developers commentaries in ENGLISH ONLY and the original \"Making of\" video.",
  "banner_url": "/games/banner/deus-ex-human-revolution-directors-cut.jpg",
  "icon_url": "/games/icon/deus-ex-human-revolution-directors-cut.png",
  "is_public": true,
  "updated": "2019-03-30T01:16:14.999617Z",
  "steamid": 238010,
  "gogslug": "",
  "humblestoreid": ""
}