{
  "name": "Blue Toad Murder Files: The Mysteries of Little Riddle",
  "slug": "blue-toad-murder-files-the-mysteries-of-little-rid",
  "year": 2009,
  "description": "Blue Toad Murder Files™: The Mysteries of Little Riddle is a one to four player co-operative episodic download game published by Relentless Software.\r\nSet in the sleepy village of Little Riddle, the main aim of the game is to follow clues to find the murderer. Along the way you'll also encounter a variety of different and challenging puzzles which help you move through the peaceful world of Little Riddle.\r\nAs one of the detectives you move around the village by selecting locations on the map. Visit the doctor at his surgery and hear his flimsy alibi. Meet with the Station Master and learn his motive. Exploring the village and meeting the villages is key to unraveling The Mysteries of Little Riddle. The villagers have information and puzzles to solve that you must complete to reveal the truth!\r\nWith each step of the investigation a puzzle is played and further clues about the case are revealed. Pay attention to what transpires – you will regularly be questioned on your knowledge of the case, and only observant detectives will learn the truth behind the events of their day.\r\nWhodunnit? At the end of every episode you will be asked to choose your suspect before the true culprit is revealed and exposed in all their criminal capacities!\r\n\r\nKey features:\r\n* Six separate episodes\r\n* Thrilling cliff hanger at the end of every episode\r\n* Over 90 puzzles, Whodunnits and cross-examinations\r\n* Opportunity to play as one of the four unique members of the Blue Toad Detective Agency\r\n* 1 – 4 co-operative multiplayer gameplay\r\n* A story of mystery and intrigue",
  "banner_url": "/games/banner/blue-toad-murder-files-the-mysteries-of-little-rid.jpg",
  "icon_url": "/games/icon/blue-toad-murder-files-the-mysteries-of-little-rid.png",
  "is_public": false,
  "updated": "2019-01-23T08:28:39.695921Z",
  "steamid": 90400,
  "gogslug": "",
  "humblestoreid": "",
  "id": 1793
}