{
  "name": "Ring of Red",
  "slug": "ring-of-red",
  "year": 2000,
  "description": "Ring of Red (リング・オブ・レッド) is an alternate history turn-based strategy video game released by Konami for the PlayStation 2 console. \r\n\r\nThe game is based on an alternate history theory that after the defeat of Nazi Germany and Fascist Italy near the end of World War II, Japan was conquered and occupied by both Soviet and American forces - rather than solely by the US, as in actual history. The occupation created two countries, consisting of the north governed by a pro-communist government and the south by a pro-democracy government with Hokkaidō occupied by Soviet forces. Tensions between the two Japan's were at an all-time high during the Cold War with a Japanese War (similar in cause to the actual Korean War) taking place with Armored Fighting Walkers, giant walking mechas being used with great success by both the North Japanese and South Japanese militaries.\r\n\r\nCombat is split between a turn-based battlefield for moving units, and a real-time mode for combat. The latter includes the AFWs moving through their attack patterns and support troops that have their own abilities.\r\nIn each mission, players deploy their units on a map. Each square contains terrain that provide movement and defense bonuses or penalties. Both sides consist of units made up of a single AFW and three squads of infantry. The player and the enemy take turns in moving their units around the map in order to complete certain objectives, such as pursuing a unit, capturing a town or protecting a convoy. Some missions have branching objectives that give different bonuses.\r\n\r\nPlayers can engage in combat by moving within distance of an enemy unit, depending on the range the AFW is in prior to combat. If players are successful in destroying the enemy AFW, the enemy unit is removed from the map and players gain experience points. If the enemy destroys a player AFW, the entire unit is removed until the next mission.\r\n\r\nIn addition to combat, players can capture cities, which can provide more troops for recruitment and heal friendly troops, and can dedicate turns to repairing their units. Each mission has parameters which result in player defeat, such as not completing the mission within the time limit or losing Weizegger's AFW.\r\n\r\nRing of Red features a day/night cycle. Each move takes a certain amount of time, which influences how often units can be issued orders, which in turn affects what time of day combat takes place. In addition, there is simulated weather and natural disasters.",
  "banner_url": "/games/banner/ring-of-red.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-06-17T00:18:21.541260Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 27964
}