{
  "name": "Out of the Park Baseball 19",
  "slug": "out-of-the-park-baseball-19",
  "year": 2018,
  "description": "Out of the Park Baseball 19, the latest edition of the world's best-rated sports strategy game franchise, is a baseball fan's dream come true. The game is officially licensed by MLB, MiLB and the MLBPA!\r\n\r\n\"OOTP is an astonishing accomplishment!\" - Boston Red Sox Principal Owner John W. Henry\r\n\r\nStep into the shoes of a GM and/or manager to own the future or rewrite the past of your favorite real-world baseball franchise. Build the team the way you want. Start a new career with your favorite 2018 MLB team or go back through almost 150 years of baseball history and run any team from the past! You can even set up your own fictional baseball universe or compete in online leagues against other OOTP players. Make your move!\r\n\r\nThe brand new 2018 MLB roster set will include all projected Opening Day MLB rosters as well as the complete minor league system down to the rookie leagues and even future draft classes. On top of this, 8 international leagues (Japan, South Korea, Taiwan, Australia, Italy, The Netherlands, Mexico and Cuba) and several international and US independent leagues return to OOTP 19 with accurate and projected 2018 rosters.\r\n\r\nDiscover new talent, draft the next superstar, negotiate with free agents, enter trade talks with other teams, build your dynasty and guide a franchise into an infinite future! As a manager, dive into the more hands-on management and set your team's lineups, pitching staffs, in-game strategy and call the shots from the dugout. You can oversee your league at a high level, or play out each game in the redesigned 3D game mode, managing play by play or even pitch by pitch. OOTP has it all covered!\r\n\r\nNew features in OOTP 19 include:\r\n\r\n    Vastly improved 3D gameplay mode, with animated 3D players, improved ballpark models and a completely redesigned in-game interface. Playing games in OOTP 19 is a completely new experience!\r\n    A beautifully redesigned interface. We have completely revamped the look of the game and improved many screens throughout the game. Three new skins are included and you can now choose between six different fonts in order to customize the look and feel even further.\r\n    New scouting system, with completely rewritten scouting reports and streamlined rating systems, making it easier than ever to evaluate players.\r\n    Ultra-realistic AI, with improved handling of two-way players, in-game strategy decision making, trade evaluation and much more.\r\n    Tournaments have been enhanced with two exciting new features: the ability create a standalone tournament bracket, plus the option to draw any teams in history into a tournament. The possibilities are endless!\r\n    User Voting for End-of-Season Awards. You can now cast a full ballot for all the end-of-season awards, including the MVP Award, the Cy Young Award and other awards. Improved decision-making by the AI can lead to some close races for awards.\r\n    A completely customizable manager home screen, giving you total control over your virtual front office.\r\n    800 new fictional team logos for your own custom baseball world are now included.\r\n    Improved player morale / team chemistry system\r\n    Improved player creation & development system\r\n    Improved game recaps, enhanced play-by-play text and league news\r\n    Countless small tweaks that enhance the user experience: for example, delayed substitutions for injured players while playing out games, so you won'?t have to replace your injured pitcher right away if your team is going to bat. Many other small changes are included too.\r\n    And much more...\r\n\r\n    Coming later this Summer: PERFECT TEAM, the new and exciting online competition mode in Out of the Park Baseball. Stay tuned for an open beta and more information!\r\n\r\n    Out of the Park Baseball 19 - Make your move!\r\n\r\n    Major League Baseball trademarks and copyrights are used with permission of MLB Advanced Media, L.P. Minor League Baseball trademarks and copyrights are used with the permission of Minor League Baseball. All rights reserved.\r\n\r\n    OFFICIALLY LICENSED PRODUCT OF MAJOR LEAGUE BASEBALL PLAYERS ASSOCIATION - MLBPA trademarks and copyrighted works, including the MLBPA logo, and other intellectual property rights are owned and/or held by MLBPA and may not be used without MLBPA's written consent. Visit www.MLBPLAYERS.com, the Players Choice on the web.",
  "banner_url": "/games/banner/out-of-the-park-baseball-19.jpg",
  "icon_url": "/games/icon/out-of-the-park-baseball-19.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:39.033157Z",
  "steamid": 619290,
  "gogslug": "",
  "humblestoreid": ""
}