{
  "name": "Mushroom Kingdom Fusion",
  "slug": "mushroom-kingdom-fusion",
  "year": 2012,
  "description": "Mushroom Kingdom Fusion is a (as yet unfinished: v0.6) non-profit fan-made platforming video game that is based on Super Mario Bros. It is a Crossover with elements, characters, and settings from a multitude of other video games.\r\nThe game consists of mechanics primarily from the SNES and Game Boy Advance renditions of Super Mario Bros. 2, Super Mario Bros. 3, and Super Mario World. Enemy characters include standard Mario-universe enemies, demonic beings, alien creatures, and human soldiers. The music includes the usual Mario series music, along with tracks from the Halo series and other games featured in MKF. The game features items from the Mario series and weaponry originally used by the Covenant races in Halo, in addition to suit items that bestow upon the main playable characters the guise and abilities of certain characters from the Mega Man universe.\r\n\r\nCharacters featured in MKF include Mario, Luigi, and Wario plus a roster of characters from other video game franchises (such as Sonic the Hedgehog, The Legend of Zelda, Ninja Gaiden, and Mega Man).\r\n\r\nThe game design is influenced by franchises such as the Sonic, Doom, and Mega Man series and other Nintendo titles. Other game franchises featured include (but are not limited to) Metal Slug, Castlevania, and Ghosts 'n Goblins; some obscure game titles represented are R-Type and E.V.O.: Search for Eden.\r\n\r\nJudgeSpear, the game's founding developer, stepped down from the project due to increasingly polarized views of the game's content and the inclusion of many different game elements, far removing the game from the original concept of just Mario visiting other game worlds, plus several disagreements with the other team members. A spinoff fangame project, Super Mario Fusion Revival, was founded to revive that original concept.",
  "banner_url": "/games/banner/mushroom-kingdom-fusion.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:28.033324Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}