{
  "name": "Eldevin",
  "slug": "eldevin",
  "year": 2014,
  "description": "Eldevin is the award winning indie story-driven Free to Play MMORPG (Massively Multiplayer Online Role Playing Game) from Hunted Cow Studios. Join thousands of other players and explore the mystical lands of Eldevin. Featuring more than 160 realms, each filled with unique creatures and characters for you to encounter. Explore vast open plains or descend underground into hidden caves and dungeons, making friends or foes of the various factions as you carry out your epic quest to defend Eldevin Kingdom.\r\nFeatures\r\n\r\n    Rich storyline involving hundreds of epic quests.\r\n    Huge world to explore with many cities, areas, dungeons and secrets.\r\n    6 Talent Trees featuring over 200 talents.\r\n    Real-time combat system.\r\n    Use strategy and tactics to defeat epic Foes and Bosses.\r\n    Engage in PvP combat with your friends and enemies.\r\n    Your decisions and actions will affect future encounters and possibilities.\r\n    Class-less combat system; players in Eldevin are free to learn any of over 100 unique abilities.\r\n    Train in 14 professions to craft your own weapons, armor, items and amenities.\r\n    16 group-based dungeons and dozens of in-depth story-driven solo instances.\r\n    Hundreds of items, including over 40 unique sets, to obtain and collect.\r\n    Level up to 49 and enjoy awesome end-game activities.\r\n\r\nLore\r\nEldevin Kingdom, for generations, has been a green and peaceful land. All that changed ten years ago with the discovery of the Elemental Spheres. Once thought to be mere legend, these powerful magical artifacts had an immediate affect on the kingdom, plunging it into confusion and chaos. The royal family decreed that the Spheres be scattered to the corners of the world lest they cause more destruction. They were too late. The presence of the Spheres corrupted the Champions protecting them. Now Tristan, Emperor of the Infernal Empire, has set his sights on conquering the Spheres. Only the Kingdom of Eldevin stands in his way.",
  "banner_url": "/games/banner/eldevin.jpg",
  "icon_url": "/games/icon/eldevin.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:21.862420Z",
  "steamid": 298160,
  "gogslug": "",
  "humblestoreid": ""
}