{
  "name": "Avernum 3",
  "slug": "avernum-3",
  "year": 2002,
  "description": "Spiderweb Software, a maker of fantasy role-playing games for Windows and Macintosh, announces the final game in the Avernum trilogy. Avernum 3 features an enormous scenario, with well over 100 towns, villages and dungeons. There is a fascinating story and a dynamic world which changes according to the actions of the player. Refugees move from town to town. People die. If nothing is done, towns will crumble into dust.\r\n\r\nAvernum was a prison, an enormous warren of tunnels and caverns, far below the surface world. The surface is ruled by the Empire, the all-powerful masters of the known world. Misfits, petty criminals, and those with the wrong opinions were sent into Avernum for the rest of their lives. At least, that’s what happened once.\r\n\r\nThen the Avernites assassinated the leader of the Empire and spent years in a brutal war with the surface tyrants. The Avernite rebels won. Now, at last, they are beginning their campaign to leave their caves and return to the surface.\r\n\r\nYou are the scouts. You will be the first envoys to the surface. Instead of the sunlit paradise you dreamed of, you will find a world ravaged by mysterious plagues and hordes of bizarre monsters. Soon, the Empire will ask you to help solve the problem. Your enemies will become your allies as you race to find the source of the destruction.\r\n\r\nFail, and you will never return to the surface. There will be nothing left to return to.\r\n\r\nAvernum 3 is a massive and open-ended game. You can save the world or work as a merchant. You can buy a house or go on one of many side adventures. You can hurry to save the cities, or sit back and watch them crumble. Whatever you choose, Avernum 3 promises a massive and engaging adventure which will gladly absorb all the hours you can spare.",
  "banner_url": "/games/banner/avernum-3.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-05-31T00:17:35.192355Z",
  "steamid": null,
  "gogid": 1207663373,
  "gogslug": "avernum_3",
  "humblestoreid": "",
  "id": 12024
}