{
  "name": "Contra 4",
  "slug": "contra-4",
  "year": 2007,
  "description": "ontra 4 (魂斗羅 デュアルスピリッツ (Contra: Dual Spirits).[1][2] is a 2D action game for the Nintendo DS and the eleventh original installment in the Contra series. The game was released in North America on November 13, 2007.[3] Contra 4 was produced by Konami Digital Entertainment in America and developed by WayForward Technologies, making it the first Contra game developed by them, as well as the first original Contra game for a portable platform since the 1991 Game Boy game Operation C. As the game's title indicates, Contra 4 was designed to be a direct sequel to the Contra games for the Nintendo Entertainment System and Super NES (Contra, Super C, and Contra III: The Alien Wars), with a gameplay model similar to those games, and was also in celebration of the 20th anniversary of the original Contra.\r\n\r\nA mobile phone port was released on November 19, 2007.[4] No European or Australian version of the game has ever been released.\r\n\r\nThe plot is set in 2638, two years after the events of Contra III: The Alien Wars and three years before the events of Contra: Hard Corps. With the Red Falcon alien threat defeated and Alien Wars finished, the Earth is peaceful once again. However, a similar alien entity calling itself Black Viper begins launching attacks against the human race, causing mass destruction over the planet. After strange readings are detected at the Galuga archipelago (the setting of the original Contra), the Earth Federation sends their four strongest Contra Force commandos on a final strike mission to destroy the Black Viper and its army of aliens, robots, and mutants.\r\n\r\nThe continuity of Contra 4 is based on the Japanese canon that was adapted into the English localization of series with the release of Contra: Shattered Soldier. However, the game's producers took a number of liberties with the established canon by integrating elements of the American localizations of the older games, thus fusing the two versions together. The alien Black Viper was originally mentioned only in the North American manual of Operation C, whereas the original plot of that game (released as simply \"Contra\" in Japan) was about an unnamed superpower creating new weapons using an alien cell. In the timeline presented in the manual and official website, the events of Operation C are interpreted as a previous mission of \"Mad Dog\" and \"Scorpion\" - two new characters created specifically for Contra 4, against the Black Viper. In actuality, \"Mad Dog\" and \"Scorpion\" were the names used for Bill and Lance for the North American NES games (see playable characters section for details). Additionally, Operation C was originally a solo mission of Lance Bean, aka Scorpion (as the game was one-player only).",
  "banner_url": "/games/banner/contra-4.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:57.840051Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}