{
  "name": "Airline 69: Return to Casablanca",
  "slug": "airline-69-return-to-casablanca",
  "year": 2003,
  "description": "Airline 69: Return to Casablanca continues in the same vain as the developer's previous Wet Attack: The Empire Cums Back and is a managerial strategy game with erotic elements. The game is set in 1942 and the player takes the role of the pilot Wayne whose aircraft is shot down over Casablanca. Fortunately he survives and even gains a love interest: the secret agent Chou-Chou who hid in said aircraft. The goal of the game is to gain a license for an own airline and keep Chou-Chou happy.\r\n\r\nAt first, the player has only the option to do small-time trading: talking to the various people of Casablanca, buying one of the 24 wares (each trader has the same ground prices which have to be lowered with haggling and the player can only purchase one item per ware at a time) and selling it for a profit. Later, when the player takes over the bordello and receives the airline license, more managerial options become available. However, progression is not only based on earning enough money but also on buying information from the same traders. Depending on the current progression, more information becomes available which means all persons have to checked regularly. Additionally the player needs click on the correct interactive screen elements.\r\n\r\nLocations are reached by choosing them from the city map and (just like the characters) are represented with drawn comics graphics. Females are usually depicted naked and with large breasts; the animations in those screens mostly show sexual acts. As managerial game most of the time is spent in those screens and the menus which are opened by clicking on the associated spots and persons. The only exception are the mini games: to keep Chou-Chou happy the player both has to buy her presents and solve the sex mini game (using the correct sex tool on one of her four erogenous zones) and airline missions involve playing a basic vertically scrolling shooter.",
  "banner_url": "/games/banner/airline-69-return-to-casablanca.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:16.780658Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}