{
  "name": "Age of Wonders III",
  "slug": "age-of-wonders-iii",
  "year": 2014,
  "description": "Age of Wonders III is a turn-based strategy game and is mechanically similar to Master of Magic. The background story is a war between the progressive Commonwealth Empire, this faction is lead by the humans which increases their reach with methods similar to the Roman Empire, and the conservative Elven Court which oppose the Commonewealth's expansion. Each faction has a story campaign with six missions each. Additionally there are scenarios, free play with randomly generated maps and a map editor.\r\n\r\nThe game has two gameplay layers. The first is the overworld (on many maps accompanied with a full underworld) where the player moves the squads (up to six units each) around. Here the goal is to explore, extending the reach of influence by conquering/founding cities, finding treasures, solving side quests and generally ensuring the safety against attacks. Regarding city management, the player has a few options (mostly by constructing buildings) to influence which of three resources - noble metal (basically money), mana (used for global magic) or knowledge (used to research new technologies and spells) - is produced (of course influenced by what the nearby terrain offers) and how satisfied the population is. Diplomacy is used to integrate neutral factions into the empire, but overall this plays a minor role. Heroes, on the other hand, are very important: those units can equip found items, gain experience points, level up and gain powerful abilities. \r\n\r\nThe second layer is the hex-based combat which is fought on separate screens. Each squad has a certain amount of action points which is used to move, attack or use skills/magic. Positioning plays a major factor and a squad's effectiveness stays the same during combat, even if members die. Combat results can be calculated without player input.\r\n\r\nThe game's complexity comes mostly from size: there are overall about 250 units which all have different attacks, active and passive skills, have resistances and are vulnerable against other things. There are also various different spells; both individual ones used in combat and global ones which are used on the strategy maps and use the global mana resource. Those may give bonuses, harm enemy cities or even change the terrain.",
  "banner_url": "/games/banner/age-of-wonders-iii.jpg",
  "icon_url": "/games/icon/age-of-wonders-iii.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:33.730174Z",
  "steamid": 226840,
  "gogslug": "age_of_wonders_3",
  "humblestoreid": "",
  "id": 3391
}