{
  "name": "Dead Rising 2: Off the Record",
  "slug": "dead-rising-2-off-the-record",
  "year": 2011,
  "description": "Dead Rising® 2: Off the Record sees Frank West – photojournalist and original hero of the Dead Rising® Willamette incident – take center stage as players experience a re-imagining of the Fortune City outbreak. Forget what you know about Dead Rising® 2, \"Frank West is back in the game!\"\r\n\r\nThe new \"Off the Record\" storyline means an all new Dead Rising 2 experience. Frank will face off against more twisted enemies, build more outrageous combo weapons, follow his own unique mission structure and explore brand new areas of Fortune City to get his biggest scoop yet. Join Frank as he indulges in the insanity of \"Uranus Zone,\" Fortune City’s very own theme park. Full of deadly rides and crazy attractions, the sci-fi themed Uranus Zone is a true zombie-killing paradise.\r\n\r\nFrank’s come-back means the return of his trusty camera, with players able to earn Prestige Points (PP) for specific photo opportunities that are graded against criteria such as horror, drama, erotica and brutality.\r\n\r\nIn addition to the new scenario and gameplay enhancements, Dead Rising 2: Off the Record offers a suite of technical updates including load time optimizations, improved network performance and a host of system upgrades to deliver a more satisfying Dead Rising experience.\r\n\r\nKey Features:\r\n* Frank West is back – The original Dead Rising hero returns to get the scoop on the Fortune City outbreak\r\n* Fortune City but not as you know it – Experience a re-interpretation of the Fortune City outbreak through the eyes and camera of photojournalist Frank West:\r\n- New story and missions unique to Frank West\r\n- New environments including Fortune City’s latest attraction, “Uranus Zone”\r\n- New enemies and more psychotic Psychos\r\n- New crazy and hilarious combo-weapons\r\n- New items and vehicles\r\n* Say \"Cheese!\" – Capture those classic, violent, scary and hilarious Dead Rising moments, earn Prestige Points and complete all new missions with Frank's new and improved camera feature.\r\n* Upgraded Experience – Full of technical improvements, system enhancements and feature upgrades to create a faster, smoother, more satisfying Dead Rising.",
  "banner_url": "/games/banner/dead-rising-2-off-the-record.jpg",
  "icon_url": "/games/icon/dead-rising-2-off-the-record.png",
  "is_public": true,
  "updated": "2019-06-23T15:39:56.630035Z",
  "steamid": 45770,
  "gogslug": "",
  "humblestoreid": "dead-rising-2-off-the-record"
}