{
  "name": "Basingstoke",
  "slug": "basingstoke",
  "year": 2018,
  "description": "Basingstoke is a tense roguelike that mixes stealth and arcade action. Explore the smouldering ruins of apocalyptic Basingstoke, UK, a world of extreme peril where reanimated undead and ferocious alien monsters roam!\r\n\r\nScavenge and Craft\r\nLoot and craft as you explore. Lob a tasty sausage roll as a diversion, or poison a kebab for bait. Sneak up and knock a monster out with a whack from a cricket bat, or slice them up with a chainsaw. Tranquillize them with a dart fired from a homemade blowpipe, or set them alight with a DIY flamethrower. There's over a hundred useable items to loot or craft!\r\n\r\nNo Second Chances\r\nUse stealth to sneak, weapons to attack, or if all else fails, run! But be very careful - one bite and you'll be ripped apart to become a tasty snack for monsters! Violence is your last resort. Sneaking, skullduggery, and ambush are your tactics.\r\n\r\nWhat is Basingstoke?\r\nBasingstoke is a town in England, renowned for its charming mix of hand crafted and procedurally generated features. Explore, above and below ground, and enjoy its many attractions. Rob a parking ticket machine, vandalise a keep left sign, go shopping at the OMNImart24/7... or if things get a bit much, hide in a wheelie bin.\r\n\r\nUnlockable Characters\r\nAs you progress you'll unlock new characters. Start as a Tourist and capture those special moments with your selfie stick or splurge at the shops with your OmniBank GoldCard. Play as the Thief and use your Locksmith gadget to crack security panels and break safes. Each character has specialist equipment, unique crafting recipes... and hats!\r\n\r\nAchievements and Trading Cards\r\nThe Royal Mint have issued a special commemorative set of Basingstoke themed coins to celebrate The Apocalypse. 1p, 2p, 10p, 20p and 50p coins can be yours, as well as an especially shiny pound coin. Collect them all, and a full range of achievements, trading cards, profile backgrounds and emoticons! Unfortunately we're not allowed to show you a picture in the store, you'll have to earn them by playing :)",
  "banner_url": "/games/banner/basingstoke.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:31.892613Z",
  "steamid": 336940,
  "gogslug": "basingstoke",
  "humblestoreid": ""
}