{
  "name": "Gabriel Knight 2: The Beast Within",
  "slug": "gabriel-knight-2-the-beast-within",
  "year": 1995,
  "platforms": [
    {
      "name": "MS-DOS"
    },
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Adventure"
    }
  ],
  "aliases": [],
  "description": "The Beast Within: A Gabriel Knight Mystery is a direct sequel to Gabriel Knight: Sins of the Fathers, the first in the supernatural mystery adventure series telling the story of a bookstore owner and writer Gabriel Knight, the last offspring of generations of Schattenjaegers (shadow hunters), whose task is to fight the evil forces that abound in the world.\r\n\r\nAfter leaving New Orleans, Gabriel moves to the Ritter Castle in Bavaria, Germany, his family heritage. One day, a group of peasants approach the castle, and the elder tells Gabriel about a terrible death of a little girl, who was killed by a vicious wolf. Suspecting the wolf could be a supernatural creature, the peasant asks the Schattenjaeger to purge the evil. The investigation brings Gabriel and his assistant Grace Nakimura to the mysterious Hunter Society and to Bavaria's dark past.\r\n\r\nThe game utilizes a cast of live actors and full-motion video technology: the actors are filmed over photorealistic images of Munich and its surroundings, and nearly every interaction with the environment leads to a FMV sequence. Despite its visual style, The Beast Within is not an interactive movie, but a full-fledged adventure game with many dialogues, detective work to do, and puzzles to solve. Unlike the first game, it is entirely controlled through point-and-click actions - all the icons have been replaced by a single cursor. Both Gabriel and Grace are available as playable characters during different chapters of the story.",
  "banner_url": "/games/banner/gabriel-knight-2-the-beast-within.jpg",
  "icon_url": "/games/icon/gabriel-knight-2-the-beast-within.png",
  "is_public": true,
  "updated": "2019-11-23T00:00:19.950296Z",
  "steamid": 496760,
  "gogslug": "gabriel_knight_2_the_beast_within",
  "humblestoreid": ""
}