{
  "name": "King's Field",
  "slug": "kings-field",
  "year": 1996,
  "description": "The powerful and holy Moonlight Sword was stolen from King Alfred of Verdite. Prince Alexander, one of the king's closest friends, embarks on a journey to retrieve the sword. During his voyage a terrible storm overcomes his ship, and it sinks to the bottom of the sea. Alexander miraculously survives and is washed ashore on the mysterious island of Melanat. He has to explore the island, aware of the monsters roaming it, and find the sword.\r\n\r\nKing's Field (originally dubbed King's Field II) is the second game in the series, and the first one to become localized in Western countries. Like its predecessor, it is a first-person 3D action role-playing game with a heavy emphasis on dungeon crawling. The game takes place in world consisting of interconnected areas, which gradually open up as the player acquires keys and other means to enter them. Most of the time the player is free to explore large areas, though he may encounter powerful enemies he is yet unable to defeat.\r\n\r\nThe player character can attack physically with melee or ranged weapons (bows), as well as cast magic. Physical attacks and spells are each assigned to a different button. Character growth is handled by repeatedly executing the same types of attacks and applying certain items to raise attributes. New in this installment is the learning of magic from special crystals. Most of the creatures encountered in the game are hostile, with only a few offering help such as procuring different types of crystals needed to make healing potions. Every NPC in the game, whether hostile or friendly, can be killed by the player. Alexander can sprint now, though doing this depletes his hit and magic points and he must rest for a while to recover them. It is also possible to teleport between areas.",
  "banner_url": "/games/banner/kings-field.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2020-04-13T06:44:17.165488Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}