{
  "name": "Dead Synchronicity: Tomorrow Comes Today",
  "slug": "dead-synchronicity-tomorrow-comes-today",
  "year": 2015,
  "platforms": [
    {
      "name": "Linux"
    }
  ],
  "genres": [
    {
      "name": "Point-and-click"
    }
  ],
  "aliases": [],
  "description": "Darkness.\r\n\r\nAnd then there was light… but not enough for Michael to find out who he is and what happened to the world out there. The “Great Wave”, the “dissolved”... are just hollow words in his looted mind.\r\n\r\n\"Dead Synchronicity: Tomorrow Comes Today\" is the first part of the \"Dead Synchronicity\" series: \r\nHelp Michael face a dying reality, a universe that’s fading away. Face a merciless world that gets sick and vanishes. Face no past, no present, no future. Face the impending moment of “dead synchronicity”.\r\nAnd you’d better hurry. Because, otherwise... what will you do when Time dissolves itself?\r\n\r\nA terrible pandemic is turning all of humanity into “the dissolved” - the sick whose deliria provide them with supernatural cognitive powers... but also steer them towards a gruesome death.\r\n\r\nThe root of this illness seems to be “the Great Wave”, an inexplicable chain of natural disasters that destroyed all energy sources and communications and plunged the world into a chaos ruthlessly controlled by both the authorities and the army alike.\r\n\r\nMichael, a man with no past, will have to recover his identity and decode the events that brought the world to the edge of collapse. Because, if he doesn’t hurry, he won’t be able to avoid the impending moment of “dead synchronicity”, when Time itself dissolves…\r\n\r\nDead Synchronicity: Tomorrow Comes Today is a point and click adventure that features a stunning dystopian plot, a distinctive, expressionist 2D art style, and an atmospheric soundtrack. \r\nThe game pays homage to classic adventures (The Secret of Monkey Island, Broken Sword, Day of the Tentacle...) but revolves around a more mature theme, along the lines of games such as I Have no Mouth and I Must Scream or Sanitarium.",
  "banner_url": "/games/banner/dead-synchronicity-tomorrow-comes-today.jpg",
  "icon_url": "/games/icon/dead-synchronicity-tomorrow-comes-today.png",
  "is_public": true,
  "updated": "2019-05-14T04:36:06.438388Z",
  "steamid": 339190,
  "gogslug": "dead_synchronicity_tomorrow_comes_today",
  "humblestoreid": ""
}