{
  "name": "DarkStar One",
  "slug": "darkstar-one",
  "year": 2006,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Action"
    }
  ],
  "aliases": [],
  "description": "Darkstar One offers a fantastic amount of freedom of choice. The story-based missions gradually lead you deeper into the galaxy to new races, new technologies and ever stronger opponents. Explore a vast array of solar systems in search of hidden artifacts of ancient races, essential objects for upgrading your ship--the Darkstar One.\r\nIn addition to artifacts, acquire credits to purchase better equipment, such as weapons and shields. Earn credits in a myriad of ways: by taking on assignments, bounty hunting, piracy, smuggling, trading, escorting, transporting, rewards and more.\r\n\r\n-    A vast, simulated universe with many unique races, space ships and battle tactics.\r\n-    Elaborate story, related by more than fifty minutes of video sequences.\r\n-    Configure and upgrade your ship, Darkstar One, any way you choose--build a fast attack ship with many light weapons or a near-invincible cruiser with heavy weaponry.\r\n-    Over two hundred different weapons, shields and equipment items.\r\n-    Rockets, torpedoes and mines feature special tactical uses: mines can fire at opponents or distract approaching missiles.\r\n-    The \"Spell Weapon\": a special weapon with a powerful effect similar to certain spells in role-playing games. This weapon becomes increasingly versatile throughout the game and greatly increases tactical options.\r\n-    Acquire weapons from other races - Mount distinctive weapons from other races on \"Darkstar One,\" each featuring unique functions that require different battle tactics.\r\n-    Embark on special missions - explore canyons or even underground on unknown worlds.\r\n-    Freedom of choice - earn credits in many ways: fighting, piracy, assignments, smuggling, trading, escorting, transporting, rewards, and more.\r\n-    Play as the \"good\" or the \"bad\" guy and take advantage of political disputes.",
  "banner_url": "/games/banner/darkstar-one.jpg",
  "icon_url": "/games/icon/darkstar-one.png",
  "is_public": true,
  "updated": "2019-10-14T00:29:45.867260Z",
  "steamid": 12330,
  "gogslug": "darkstar_one",
  "humblestoreid": ""
}