{
  "name": "Metro 2033",
  "slug": "metro-2033",
  "year": 2010,
  "description": "It’s been twenty years since the War started and ended. It lasted for a couple of hours and did not end in a victory for any side. There were no sides left after it ended.\r\n\r\nThe Moscow Metro did fulfill its alternative purpose as an enormous bomb shelter – it did so almost perfectly. Most of the people who hurried inside at the sounds of an air raid alert survived. They seem to be the only ones who did.\r\n\r\nThe humanity was all but extinguished in the apocalypse it brought upon itself, its last remains reduced to hiding in holes waiting for an unlikely miracle – or, which seems much more probable after all those years, simply waiting for the last supplies to run out. After all, there is little hope of ever getting out of the Metro, for the world outside turned into a poisoned nightmare where a human cannot survive without a gas mask. Having a gasmask does not make continued survival all that much more probable – many areas are still too irradiated to enter, and the Surface in general is teeming with hideous creatures born of radiation.\r\n\r\nGrudges and enmity are sure to arise in times of need, and in this world they blossom like never before. The survivors, who could probably stand a chance of overcoming all the hardships and ridding the world above of the mutants, were they united, nevertheless break up into antagonistic groups. These groups vary in numbers, power and beliefs, some of them control whole Metro lines, while the others are basically independent station-cities. But, regardless of how powerful or impotent such a “state” is, they are vying for control of the now-scarce resources.\r\n\r\nAnd this is the harsh and unforgiving world as you, Artyom, know it. You know of no other, since you were born a few years before the War and the memories of the time when you still lived outside are vague at best and growing ever weaker, displaced with horrors that are your daily routine now. Ever since you came to live in the Metro, you never left the confines of the station which became your home, but an impending danger forces you to leave. You will have to brave untold dangers, traverse pitch-dark tunnels and irradiated ruins of the once beautiful city to find a way to help your home station in its hour of desperate need, and, perhaps, do something much greater than that.",
  "banner_url": "/games/banner/metro-2033.jpg",
  "icon_url": "/games/icon/metro-2033.png",
  "is_public": true,
  "updated": "2019-02-19T02:58:27.353911Z",
  "steamid": 43110,
  "gogslug": "",
  "humblestoreid": ""
}