{
  "name": "Black & White 2",
  "slug": "black-white-2",
  "year": 2005,
  "description": "The sequel to Lionhead's open-ended god game, Black & White, attempts to offer more focused gameplay and larger scale. The player assumes yet again the role of a God and chooses if he will be Good, Evil or something in between.\r\n\r\nAs a deity that interferes directly with mortal affairs, the player will help his followers, the Greeks, survive and prosper in a mythical land. A good god will improve the city of his followers and eventually attract the inhabitants of neighbouring hamlets, be they neutral or even hostile. An evil god will recruit armies and conquer them.\r\n\r\nThe player once again has an animal avatar of his choice (between Lion, Ape, Wolf and Cow) which can be trained or left to its own devices. Its A.I. is much more advanced now and revolves around \"lessons\" learned. Each action it considers to do can be encouraged or discouraged by the player (by slapping or petting) so that a creature does something always/frequently, occasionally, rarely or never. The Creature can harvest, build, entertain, fight, specialize in one of these fields or just wander aimlessly, eat rocks and trees, gag and poop randomly. Depending on its alignment it will also eat or help villagers accordingly.\r\n\r\nThe divine being can also summon Miracles powered, as always, by faith. The ultimate goal is defeating the ruthless Aztecs by conquering or befriending the other two races (Norse and Japanese). The player also discovers three kinds of scrolls in the game. Gold ones are those that advance the plot, Silver ones are optional quests granting Tribute points which can be invested in buying new features and Bronze ones are tutorial scrolls.",
  "banner_url": "/games/banner/black-white-2.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-09-11T17:34:38.131288Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 21914
}