{
  "name": "Project: Gorgon",
  "slug": "project-gorgon",
  "year": 2018,
  "description": "WHAT IS PROJECT: GORGON\r\n\r\nProject: Gorgon is a new Massively Multiplayer Online Game brought to you by Eric Heimburg and his wife Sandra Powers. Eric Heimburg, Project: Gorgon creator and lead developer, has over a decade of experience working as a Senior and Lead Engineer, Developer, Designer and Producer on successful games such as Asheron’s Call 1 and 2, Star Trek Online and other successful Massively Multiplayer Online Games. Sandra also has extensive experience working as a Producer on Asheron’s Call 1, Asheron’s Call: Throne of Destiny, EverQuest II, and EverQuest II: Echoes of Faydwer.\r\n\r\nGO ON AN ADVENTURE\r\n\r\n Project: Gorgon is a 3D fantasy MMORPG (massively-multiplayer online role-playing game) that features an immersive experience that allows the player to forge their own path through exploration and discovery. We won't be guiding you through a world on rails, and as a result there are many hidden secrets awaiting discovery. Project: Gorgon also features an ambitious skill based leveling system that bucks the current trend of pre-determined classes, thus allowing the player to combine skills in order to create a truly unique playing experience.\r\n\r\nAN IMMERSIVE WORLD\r\n\r\n When you play Project: Gorgon, we want you to feel as if you’re immersed in a whole new virtual world. Rather than trying to manage this with just graphics and excessive backstory, we’ve designed the game with dozens of gameplay features that make you feel like you’re really there, interacting with the world, such as:\r\n\r\n       - If you are on fire, you can jump into a lake to put it out. This type of mechanic can have subtle effect on your strategies, especially when you are fighting a fire mage!\r\n       - You can drop items on the ground, and other players can pick them up. What’s so great about that? Imagine laying down a trail of literal (virtual) breadcrumbs to guide your friends (or lure your enemies) into the woods.\r\n       - Shopkeepers keep inventory, so you can buy items that other players have sold to them. Want to help out new players? Sell your cast-off items to the shopkeeper in the new player zone and watch the new players go to town.\r\n       - Each non-player (NPC) you meet has their own goals and interest, and reward players that choose to be their friend.\r\n       - You can inscribe messages onto items, write books, and even leave notes for other players. Make your name as an in-game poet, or pronounce your greatness to the world!\r\n\r\n\r\n    UNIQUE EXPERIENCES\r\n\r\nIn Project: Gorgon you will kill monsters, a lot of them, and you will be taking their loot. In order to keep the experience fun and interesting we’ve developed unique combat experiences to keep the fights feeling fresh. The loot is randomly generated, monsters have unique abilities, and dungeons have puzzles, traps and terrifying bosses! The combat skills are entirely free-form. You can learn as many combat skills as you want, and use any two of them at the same time to create your own personal “class.” Project: Gorgon will feature dozens to choose from, but some examples include:\r\n\r\n       - Battle Chemistry: Create huge explosions, inject yourself with mysterious mutagens or program a pet golem, it’s your decision!\r\n       - Unarmed Combat: Grapple and control enemies using a situational-aware combo system that varies based on where you are and what day it is.\r\n     -   Animal Handling: Tame animals and train them to become ferocious fighters. Then breed your best and sell their offspring to other players.\r\n      -  Necromancy: Seek out corpses and graveyards to raise an undead army. No graveyard around? Well, there are always the corpses of your friends.\r\n       - That’s just a few, there’s also Sword Fighting, Combat Psychology, Staff Fighting, Sigil Scripting, Mentalism, and more.\r\n       - Player Choices are important in Project: Gorgon. You can learn as many skills as you want, but sometimes power comes with downsides. You can become infected with lycanthropy and gain access to very powerful skill sets. You’ll be able to roam the world in a pack or as a lone wolf. However, when there is a full moon (which is tied to the real world lunar calendar) you’ll be stuck in your beast form. New opportunists come open, but others will be closed. There’s no cure for lycanthropy.\r\n\r\nYou can become a Druid, which will give you great power but you have to vow to drop everything when there’s an emergency involving nature. It could be a forest fire, a monster invasion or even a pesky insect. Nature never lets you ignore your duties, ever.\r\n\r\nCan you bear heavy burdens in exchange for greater power?\r\n\r\nCommunity is a critical aspect of Project: Gorgon and we will strive to establish a strong, engaged community and we plan on supporting our players through:\r\n\r\n      -  Live events with a focus on story.\r\n      -  Mechanisms for player-create quest content.\r\n      -  Player housing (limited instanced).\r\n      -  Player-managed shops and stalls.\r\n      -  In-game communication tools like bulletin boards.\r\n      -  Bookshelves where you can write and submit your own books and stories (and players can vote on their favorites).",
  "banner_url": "/games/banner/project-gorgon.jpg",
  "icon_url": "/games/icon/project-gorgon.png",
  "is_public": true,
  "updated": "2019-10-11T02:44:49.538307Z",
  "steamid": 342940,
  "gogslug": "",
  "humblestoreid": "",
  "id": 14795
}