{
  "name": "Little Racers STREET",
  "slug": "little-racers-street",
  "year": 2014,
  "description": "Top-down racing evolution has arrived!\r\n\r\nLittle Racers STREET fuses the fun-oriented simplicity of top-down racing games with the excitement of street racing, and the results couldn't be better!\r\n\r\nExperience thrilling high speed races, and drift like never before along more than 200 different events. With varied weather conditions affecting handling, you'll need precise driving to reach the first places, and success!\r\n\r\nTwo cities featuring over 60 different tracks will put your skills to test in the career mode. Start from scratch, and purchase or improve your cars as you keep winning racings and climbing the driver rankings. Complete the challenges to earn special rewards and unlock the high tier cars!\r\n\r\nPick the right car for each race, from an impressive selection of 40+ cars divided in 6 performance tiers. From the slow and steady Panzer to the allmighty Fetuccini Langostino, you'll really feel the difference!\r\n\r\nThe online multiplayer mode for up to 12 players is fully integrated with the career mode: Race with your friends and earn credits you can spend on new cars and upgrades!\r\n\r\nYou also can try the time trial mode and try to improve your best laps or compete against your friends, and check your position in the world leaderboards.\r\n\r\nFeatures:\r\n*    Approx. 200 events on 60 different tracks.\r\n*    Spectacular drifting physics and handling.\r\n*    Weather effects (Rain,Snow,Night...) that greatly affect handling.\r\n*    40+ cars available for purchase and customization, with 6 performance tiers.\r\n*    50+ additional challenges with specific rewards.\r\n*    Time trial mode with ghost car features and leaderboards\r\n*    Extensive career mode offering hours of content\r\n*    Smooth online multiplayer experience for up to 12 players, integrated with career mode and supporting AI racers.\r\n*    2 Huge cities to drive on ",
  "banner_url": "/games/banner/little-racers-street.jpg",
  "icon_url": "/games/icon/little-racers-street.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:11.837817Z",
  "steamid": 262690,
  "gogslug": "",
  "humblestoreid": "",
  "id": 1830
}