{
  "name": "PlaneShift",
  "slug": "planeshift",
  "year": 2002,
  "description": "PlaneShift is a Role Playing Game immersed into a 3D virtual fantasy world, completely made and maintained by volunteers! Passionate RPG gamers gathered to create an open and freely available game. You will have no surprises of premium content which will limit your gameplay or unbalance the game. There are no limitations in skills, ranks, abilities, items you can gain with your free account. There are no time limits or additional constraints. Donations are gladly accepted. Servers and bandwidth are provided by sponsors.\r\n\r\nPlaneShift is Open Source for the client and server code, and we accepts contributions from the community. We need your help to make this game better.\r\n\r\nAt the present state of development, PlaneShift is not a complete game, but it has all the functionalities needed to be enjoyable to play, including combat, magic, crafting, and quests. The game is still under heavy development, so you may easily find bugs, glitches and missing features. Our model is to keep the game open for the public, so you can give feedback on the features you want us to develop and you can shape the future of the game. PlaneShift is anyway enjoyable and has hundreds of active players.\r\n\r\nThe following list represents some of the features of the final product. Please remember that today PlaneShift is still under heavy development.\r\n\r\n* 10 playable races with unique traits!\r\n* Unlimited professions through a skill system,\r\n* Original magic system with six Ways of magic,\r\n* Hundreds of spells,\r\n* Many cities and outdoors to explore,\r\n* A great number of quests to test your wit and skill,\r\n* Monsters and NPCs with good AI that produce game events,\r\n* A world that evolves with or without player interaction,\r\n* Create your own house or castle,\r\n* Politics and economy,\r\n* ... and much much more!",
  "banner_url": "/games/banner/planeshift.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:45.836773Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 4117
}