{
  "name": "Fear Effect 2: Retro Helix",
  "slug": "fear-effect-2-retro-helix",
  "year": 2001,
  "description": "The year is 2048, and a new terrifying disease known as EINDS (Environmentally Induced Nucleotides Degeneration Syndrome) is rapidly spreading, having already claimed over one billion victims. The disease attack directly the human cell DNA, and no cure is known. Crime flourishes, and scientists fear that the DNA manipulation may lead to unforeseen disasters that would eventually destroy mankind.\r\n\r\nFour people with different pasts and motivations arrive in Hong-Kong. Hana Tsu-Vachel is a young woman of French and Chinese descent, who was once a member of the criminal Triad organization, and now takes high-risk assignments in order to buy back her contract. Royce Glas is a former commander in the US military and an ex-member of a secret organization, now a mercenary, persecuted by his former employers. Jacob \"Deke\" Decourt is a professional killer from Australia, whose life purpose is to enjoy his bloody work. Rain is a mysterious young woman, found by Hana during one of her missions, lying unconscious in a garden. The search for a cure against EINDS leads these people to exotic locations, where Chinese folk tales and ancient legends co-exist with our reality.\r\n\r\nFear Effect 2: Retro Helix is a prequel to Fear Effect, describing events that lead up to the beginning of the previous game. The gameplay is very similar to that of the predecessor, combining shooting, puzzles, and action set pieces. While the first game only featured a survival horror-style character-dependent control scheme, the prequel allows the player to switch to 3D camera-dependent controls. The game is more puzzle-oriented than the first Fear Effect, and contains more locations to explore. A few new weapons and items have been added.\r\n\r\nThe visual style of the preceding game is also present in this installment: the player navigates unshaded 3D anime-like character models over backgrounds, which are composed of pre-rendered images and looping or streaming full-motion video.",
  "banner_url": "/games/banner/fear-effect-2-retro-helix.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-12-17T02:28:13.930054Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}