{
  "name": "Exoplanet: First Contact",
  "slug": "exoplanet-first-contact",
  "year": null,
  "description": "Exoplanet: First Contact is a balanced Action/RPG mix focused on exploring and interaction with the game’s world. There will be no complicated statistic and numbers. We take everything necessary from Action-games and nothing unnecessary from RPGs. \r\n\r\nSetting: \r\nThe game is set in a Space Western universe - a subgenre of science fiction, that transposes themes of American Western books and films to a backdrop of futuristic space frontiers. \r\n\r\nIn Exoplanet: FC we have brought together distinctive elements of the Wild West, futuristic technologies and feudal society of a distant human colony, placed on a wild and dangerous planet named K'Tarsis. \r\n\r\nThe planet is going through dark times of crisis and chaos after a massive wave of gold rush. K'Tarsis is now a ghost colony with no law and order except of the rule of gun and fist. Colonists must struggle to survive in an aggressive environment and fight the uprising natives and criminals of all kind. \r\n\r\nGameplay: \r\nRPG means non-linear Story developed according to the player choises. The RPG-system is flexible and give the player many options for building a viable character. You can create a multiclass or a specialised hero without sinking in numbers and statistics. \r\n\r\nAction is represented by 3rd person shooter with deep gunplay and tactical variability. You can combine different weapons and devices with the interactive environment objects to create effective combos. Each player can find different tactics suitable for his favorite combat style to complete a mission. \r\n\r\nPlayers who feel ready to face some challenge will find diplomacy, crafting and using interactive environment very important for completing quests and missions on higher difficulty settings. \r\n\r\nStory: \r\nYou start your adventures on K'Tarsis as Jack Sharp, a space nomad, who has lost his starship and was enslaved by some criminals. You must recover your freedom and get revenge on your foes. Explore the dangerous planet and its darkest secrets! Find legendary treasures of mysterious race of so called \"Dark Wanderers\"! You will become a part of epic events and fascinating stories! Be prepared to make hard choices and be ready to face consequences! It's up to you - be a hero or a villain! \r\n\r\nFeatures: \r\n* Interactive environment as a gameplay component. For example you can catch a poisonous bug and throw it as a sticky grenade, causing chaos and fun! \r\n* Non-linear story and various gameplay options. You can choose your tactics. Lead this world to peace and order or cause war, violence and destruction. \r\n* Combo attacks with the use of interactive environment. For example you can grab, throw and shoot an explosive canister over a group of enemies to cause an effective area of effect damage. \r\n* Fascinating story and charismatic characters. \r\n* Exoplanet FC is a beginning of an epic space saga!\r\n\r\nSoftware: \r\nProprietary Software: self-developed Sahara Engine and World Editor with necessary toolset and utilities. ",
  "banner_url": "/games/banner/exoplanet-first-contact.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:29:26.747796Z",
  "steamid": 531660,
  "gogslug": "",
  "humblestoreid": "",
  "id": 3922
}