{
  "name": "LEGO Minifigures Online",
  "slug": "lego-minifigures-online",
  "year": 2014,
  "description": "LEGO Minifigures Online is an online game for LEGO fans of all ages, where you get to collect awesome Minifigures, build your own unique team and go on exciting adventures through classic LEGO worlds! Smash your enemies with your awesome guitar riffs as the Rock Star, or transform yourself into a spider with Spooky Girl! There are over one hundred Minifigures to collect and play with in LEGO Minifigures Online! You can even use codes found in real Minifigures bags to unlock and play with them in-game! \r\n\r\nExplore amazing, classic LEGO worlds, stretching from pirate-infested tropical islands to the vacuum of space. Battle dragons, sea monsters, dinosaurs, aliens and much more, as you go through unique and colorful locations brimming with things to see and do! \r\n\r\nPlay online with thousands of players from all over the world, or just team up with your closest friends; LEGO Minifigures Online features full-cross platform play, allowing gamers on PC, Mac, Linux, iOS and Android to play together in the same, persistent online world. You can even switch device and continue where you left off! The game is KidSafe certified and fully COPPA compliant, ensuring a safe and secure online experience for everyone.\r\n\r\nKey Features:\r\n* An online game for LEGO fans of all ages; play together with your friends and thousands of other LEGO fans from all over the world! \r\n* Play together across platforms; play on an iPhone with your dad on a high-powered PC, and switch freely between PC, Mac, Linux, iOS and Android! \r\n* Collect more than 100 Minifigures and build your own team -- Minifigures have their own unique personalities and awesome powers! \r\n* Explore classic LEGO worlds, from pirate islands to alien planets, and discover their unique stories and gameplay! \r\n* Smash all sorts of enemies, from dragons to sea monsters, to minotaurs and aliens, and gain experience to make your Minifigures even more powerful! \r\n* Use the codes found inside real Minifigures collectible bags to unlock and play with Minifigures in-game! \r\n* KidSafe certification and full COPPA compliance ensures a safe and secure online experience for everyone.",
  "banner_url": "/games/banner/lego-minifigures-online.jpg",
  "icon_url": "/games/icon/lego-minifigures-online.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:09.617421Z",
  "steamid": 324790,
  "gogslug": "",
  "humblestoreid": ""
}