{
  "name": "Bokuten - Why I Became an Angel",
  "slug": "bokuten-why-i-became-an-angel",
  "year": 2019,
  "description": "Nestled between the mountains and the ocean somewhere sits the harbor town of Inogo City, a prosperous place with an atmosphere of the exotic.\r\nIt is this city, watched over by the church at the summit of the highest mountain, where a boy and a girl first meet.\r\n\r\nThe boy's name is Kirinokojima Tomoe. A lonely young man, who believes neither in love nor in happiness.\r\nThe girl's name is Aine. One who sings of love to fill the world with happiness, who was born for that very purpose... an angel.\r\n\r\nTo anyone who saw him, Kirinokojima Tomoe would have seemed to lead a singularly boring life.\r\n\r\nHe didn't even attempt to befriend others, nor did he have a girlfriend, unsurprisingly. He was involved in no hobbies or interests to speak of.\r\nWaking in the morning only to go off to school, returning home only to sleep. An utterly ordinary, routine life, each day no different from the day before or after it.\r\n\r\nBut he was not in the least unhappy with his life. For him, a life of \"nothing\" was also one of \"nothing to lose\".\r\nWish for something, and you would only end up getting hurt.\r\nAfter all, he'd already sampled enough of the world's bitterness for one lifetime.\r\n\r\nUntil, like a herald of the end of that tranquil existence, an angel appeared.\r\n\r\n\"Angels\". The protectors of human loves. The ones who spin the \"red thread\", and those who play its melody.\r\n\r\n\"Love can never bring people happiness.\", said Tomoe.\r\n\"That's not true at all! Falling in love makes your heart feel all light!\", Aine replied.\r\n\r\nTomoe, who soon found himself aiding the \"acting angel\" with whom he couldn't see eye to eye on anything in her work, is is drawn alongside Aine into deep involvement with others' romantic lives...\r\nThe many shapes of love, and the forms of happiness that pass before our eyes every day.\r\nThis is their journey to find the true meaning of happiness.\r\nAnd at that journey's end, his own reason for living on...",
  "banner_url": "/games/banner/bokuten-why-i-became-an-angel.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-01-01T06:51:49.521018Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 30897
}