{
  "name": "Evolve Stage 2",
  "slug": "evolve-stage-2",
  "year": 2015,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Tactical shooter"
    }
  ],
  "aliases": [],
  "description": "Evolve is the winner of over 60 awards, and now you can play it free with Evolve Stage 2! \r\n\r\nIn a savage world of man vs nature, are you the hunter or the hunted? \r\n\r\nTurtle Rock delivers Evolve Stage 2, the next-generation free multiplayer shooter that pits four hunters against a single, player-controlled monster. \r\n\r\nProve you’re the apex predator in unique 4v1 matches, progress your account and characters, and dominate the far-off world of Shear.\r\nAll content is available in-game and can be unlocked through play, for free. No buy in or box required. Evolve Stage 2 is ready for everyone. \r\n\r\nKey Features and New Features: \r\nStage 2:\r\nWe’ve made improvements across-the-board including improved matchmaking, enhancements to all characters, visual improvements to maps, optimized performance, and improved player experiences. It’s a free game, but it’s also a much better game. \r\n4v1:\r\nGrab three friends and hunt a monster or stalk lowly humans as an ever-evolving beast. Whichever side you choose, you have access to powerful weapons and abilities that deliver balanced, competitive gameplay. \r\nHunt Together or Die Alone:\r\nChoose a hunter that fits your play style. Whether you play as the Trapper, Support, Assault, or Medic, every role is vital and teamwork is key in surviving an encounter with the monster. \r\nBeast of Prey:\r\nAs the monster – the lone predator – you are the boss battle. Use savage abilities and an animalistic sense to wreak havoc, kill the humans, and prove you are the dominant species. \r\nSavage Planet:\r\nNeither flora nor fauna are friendly on planet Shear. Fall victim to natural hazards or use them strategically against your prey. \r\nCharacter Customization:\r\nLevel up to unlock new upgrades, skins and perks for your favorite class: hunter or monster. Earn your infamy on the leaderboards and become the apex predator",
  "banner_url": "/games/banner/evolve-stage-2.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:26.505410Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}