{
  "name": "Deus Ex: The Fall",
  "slug": "deus-ex-the-fall",
  "year": 2014,
  "description": "OVERVIEW:\r\nDeus Ex: The Fall is set in 2027– a golden era for science, technology and human augmentation, but also a time of great social divide and global conspiracy. Powerful corporations have seized control from governments and command the drug supply needed by augmented humans to survive.In this chaos Ben Saxon, a former British SAS Mercenary who underwent physical augmentation, is desperate for the truth behind the drug conspiracy. Betrayed by his private military employers, the Tyrants, not only is his own life at risk but for all augmented humans, time is running out…\r\nDeveloped in collaboration with the original DEUS EX: HUMAN REVOLUTION® team at Eidos-Montréal and N-Fusion; Deus Ex: The Fall includes full Steam Achievements, Mouse & Keyboard control configurations, and Control Pad support.\r\nFEATURES:\r\nThis is a port of the original DEUS EX: THE FALL experience, first released on iOS and Android in 2013 – action, stealth, hacking, and social gameplay. A prequel story to Deus Ex: Human Revolution that builds on the DEUS EX universe. Fight for survival in a global conspiracy.\r\nSTORY DRIVEN ACTION-RPG:\r\n\r\n    The search for the truth spans from mafia hideouts in Moscow to the slums of Panama\r\n    Every action has a consequence\r\n    Hours of gameplay with multiple ways to play\r\n\r\nTHE DEUS EX EXPERIENCE:\r\n\r\n    Play the way you want- high-impact action or stealth\r\n    Original, immersive storyline\r\n    Numerous side quests\r\n    Fully explorable environments\r\n    Social and hacking skills\r\n    High impact action and combat\r\n    Unique visual design\r\n\r\nPC STEAMWORKS OPTIMIZATIONS:\r\n\r\n    Full Mouse & Keyboard control scheme (please note keyboard bindings are not configurable)\r\n    Microsoft Controller support\r\n    28 Steam achievements\r\n    Steam Trading Cards and Badges\r\n    Adjusted Artificial Intelligence\r\n    Revised game tutorial\r\n    Removal of auto-target options\r\n    Revised aiming reticule\r\n    Removal of in-game purchase options, with rebalanced game economy\r\n    Revised cover options - now matches Deus Ex: Human Revolution (HOLD or Toggle)\r\n    Resolution, Anti-Aliaising and Vertical Sync options",
  "banner_url": "/games/banner/deus-ex-the-fall.jpg",
  "icon_url": "/games/icon/deus-ex-the-fall.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:10.862311Z",
  "steamid": 258180,
  "gogslug": "",
  "humblestoreid": "",
  "id": 2308
}