{
  "name": "Anthem",
  "slug": "anthem",
  "year": 2019,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "RPG"
    }
  ],
  "aliases": [],
  "description": "On a world left unfinished by the gods, a shadowy faction threatens all of humankind. The only thing that stands between these villains and the ancient technology they covet are the Freelancers.\r\nJoin with up to three other players and assemble high-tech, hand-crafted, uniquely powerful suits of armor. Explore vast ruins, battle deadly enemies, and claim otherworldly artifacts. With every mission, you and your Javelin grow in power. Fight the dangers of an ever-changing world. Rise united to defeat evil. Triumph as one.\r\n\r\nAnthem™ invites you to experience a co-operative Action-RPG set in a new and mysterious world from BioWare™ and EA.\r\n\r\nKEY FEATURES\r\n\r\nIndividual heroes unite to triumph as one: The heart of Anthem is a connected, social experience. Join with up to three other players in cooperative adventures that reward both teamwork and individual skill. Each player’s choice of Javelin exosuit will shape their contribution and strategic role on the team. Set out together on an expedition, or drop a contract to call in friends to assist with difficult challenges. As you explore, you will discover a gripping story filled with unique and memorable characters. Seamless and intelligent matchmaking will ensure you can quickly and easily find other players to adventure alongside.  \r\n\r\nChoose from an arsenal of customizable exosuits: Every time you enter the world as a Freelancer, you will access your collection and select a powerful Javelin exosuit – armor designed to provide its pilot with incredible offensive and defensive capabilities. Use massive weaponry and devastating powers. Shrug off blows that would shatter bones. Move at incredible speed, rocket across the skies, or safely roam watery depths. As you play, you will constantly progress both your own abilities as a Javelin pilot and the combat and traversal capabilities of your exosuits.\r\n\r\nPersonalize your Javelins to showcase your accomplishments:  As you rank up and defeat powerful foes, you’ll gather loot and complete milestones in the game, unlocking amazing personalization options that turn your Javelins into visual testaments to your ability and achievement.\r\n\r\nExplore an ever-changing world of danger and mystery: Powered by Frostbite, Anthem’s visually spectacular, evolving, and open world features unpredictable conditions, hazards, and enemies. As a live service experience, Anthem will change and grow over time – introducing new stories, challenges, and events. This world is both beautiful and deadly – and will strategically challenge you with each new expedition you embark on with your Freelancer team.",
  "banner_url": "/games/banner/anthem.jpg",
  "icon_url": "/games/icon/anthem.png",
  "is_public": true,
  "updated": "2019-02-19T02:55:06.286504Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}