{
  "name": "Metal Gear Solid: Portable Ops",
  "slug": "metal-gear-solid-portable-ops",
  "year": 2006,
  "description": "Metal Gear Solid: Portable Ops is the first real Metal Gear game on the PSP, unlike the two preceding Metal Gear Ac!d games with turn-based strategy gameplay.\r\n\r\nIt's been six years since the events in Snake Eater. Snake has been captured and imprisoned in an abandoned missile silo in Colombia, and with no support this time. At least, not at first. With the help of a fellow prisoner, Snake escapes and the game truly begins.\r\n\r\nPortable Ops is a classic Metal Gear game in almost every sense. The controls will be familiar to anyone who has played previous console entries in the series. Snake can peek around corners, sneak up behind guards... they even carried over CQC (Close Quarters Combat) from Snake Eater.\r\n\r\nWhat really sets Portable Ops apart (aside from being on the PSP) is the pacing, and a few changes to the gameplay mechanics. The game is played out in missions, which are specific to certain areas. Most of the areas are not that large, which sometimes means seeing \"Mission Complete\" in only a matter of minutes. The ability to play through the game in segments really lends itself to the handheld format. If you only have five minutes, choose a quick mission, knock it out, save and you are done. Being able to return to each area whenever you want to procure more supplies means that even once you finish your mission, you will be coming back.\r\n\r\nGathering supplies is also essential due to the main new mechanic found in Portable Ops: recruiting. While Snake starts out on his own, he can enlist disgruntled guards, frustrated technicians, stubborn doctors and more. These soldiers can be used in your \"Sneaking Unit\" (the team you take into battle for each mission), or in one of the many support units, with certain soldiers having a more natural talent for certain areas. If you put someone who has medical bonuses in your Medical unit, they can produce rations, help your troops recover faster between missions and more. Technicians can create new items for your team, and Spies can steal ammo and give you intel on specific maps, which can open up new side missions or allow you to grab some heavy weaponry.\r\n\r\nMissions themselves range from recon to rescue to demolitions and beyond. You can only take four troops into a mission, and usually one of them has to be Snake. However, you don't have to always use Snake during the mission, he just has to be present. You can only control one character at a time, while the rest of the team hides safely inside boxes (usually right by the entry point). On the field, the soldier you use can make a big difference. Many times you can totally bypass a building's defenses just by playing as a guard. If you do not do anything to draw attention to yourself, you can oftentimes walk right past the enemy, plant some TNT, and walk away.\r\n\r\nSeveral soldiers even have special abilities that come in handy during a mission, such as being able to transfer extra items you pick up directly to your truck (each character is limited to four inventory slots), or drag unconscious enemies twice as fast.\r\n\r\nThe game supports multiplayer for up to six player simultaneously, over WiFi Ad Hoc and Infrastructure, with game modes such as Team Death Match, Death Match and Capture Mission.",
  "banner_url": "/games/banner/metal-gear-solid-portable-ops.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:22.094694Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 11342
}