{
  "name": "Dandara: Trials of Fear Edition",
  "slug": "dandara-trials-of-fear-edition",
  "year": 2020,
  "description": "The world of Salt hangs on the brink of collapse. The citizens, once free spirits, now stand oppressed and isolated. But not all is lost, for out of this aether of fear arises a heroine, a ray of hope. Her name is Dandara.\r\n\r\nWelcome to a unique 2D metroidvania platformer full of mystical creatures and boundless exploration. Defy gravity as you jump across floors, walls, and ceilings alike. Discover the mysteries and secrets hidden throughout the world of Salt and its diverse array of characters. Empower Dandara for combat and survival against enemies bent on oppression.\r\n\r\nAwaken, Dandara, to bring freedom and balance to this directionless world.\r\n\r\nENTER THE HIDDEN REALMS\r\nThe Trials of Fear Edition adds 3 new areas to explore, a new big boss, new powers and mechanics, new music tracks, a new secret ending, as well as many quality of life updates and more!\r\n\r\nUNCOVER THE SALT\r\nThe Trials of Fear Edition adds a whole new focus on story, fleshing out the lore of the Salt and its inhabitants. Find new descriptions, dialogues and cutscenes for existing characters and environments!\r\n\r\nNEW CONTROL SCHEME\r\nWhile we continue to strongly recommend playing with a Microsoft Xbox Controller for Windows® (or equivalent), enjoy a new Mouse and Keyboard control scheme specifically made for PC!\r\n\r\nINNOVATIVE CONTROLS\r\nBuilt natively for both touchscreen and gamepad input, movement and combat interact smoothly and seamlessly.\r\n\r\nBOUNDLESS EXPLORATION\r\nTraverse across the esoteric world of Salt through fast and fluid jumps off any surface, unhindered by gravity, in lovingly crafted environments.\r\n\r\nCHALLENGING PROGRESSION\r\nUse a combination of speed & skill, wits & reflexes, to solve puzzles, earn power-ups, and access areas previously unreachable.\r\n\r\nBEAUTIFUL AND IMMERSIVE WORLD\r\nA visual and auditory wonderland comes to life through gorgeous handcrafted pixel art and original soundtrack compositions.",
  "banner_url": "/games/banner/dandara-trials-of-fear-edition.jpg",
  "icon_url": null,
  "is_public": false,
  "updated": "2020-05-01T05:22:46.452143Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}