{
  "name": "Plants vs. Zombies",
  "slug": "plants-vs-zombies",
  "year": 2011,
  "description": "Plants vs. Zombies is a tower defense video game developed and originally published by PopCap Games for Microsoft Windows and OS X. The game involves homeowners who use a variety of different plants to prevent an army of zombies from entering their houses and \"eating their brains\". It was first released on May 5, 2009, and made available on Steam on the same day.[1][10] A version for iOS was released in February 2010, and an HD version for the iPad.[11] An extended Xbox Live Arcade version introducing new gameplay modes and features was released on September 8, 2010.[4] PopCap released a Nintendo DS version on January 18, 2011 with content unique to the platform.[12] The PlayStation 3 version was released in February 2011 also with added new co-op and versus modes found in the Xbox 360 version. An Android version of the game was released on May 31, 2011 on the Amazon Appstore, while it was also released to the Android Market (now Google Play) on December 14, 2011.[13] On February 16, 2012, a version was released for BlackBerry PlayBook.[5] Later, a BlackBerry smartphone version of the game was released on January 2013 following the launch of BlackBerry 10.[6] Furthermore, both the original Windows and Mac version of the game have been re-released with additional content in a Game of the Year version. In January, 2015, a free ad-supported version of the game was released for iOS.[14]\r\n\r\nThe game received a positive response from critics, and was nominated for multiple Interactive Achievement Awards, alongside receiving praise for its musical score. A sequel, Plants vs. Zombies 2: It's About Time, was released in 2013 for iOS and Android.\r\n\r\nIn Plants vs. Zombies, players place different types of plants and fungi, each with their own unique offensive or defensive capabilities, around a house, in order to stop a horde of zombies from reaching the house of the residents. The playing field is divided into 5 to 6 horizontal lanes, and with rare exceptions, a zombie will only move towards the player's house along one lane (the main exception is if it has taken a bite out of a garlic). Planting costs \"sun\", which can be gathered for free (albeit slowly) during daytime levels and by planting certain plants or fungi. Most plants can only attack or defend against zombies in the lane they are planted in. In later levels, players can purchase upgrades with different offensive and defensive abilities.\r\n\r\nThe game uses several different level types and layouts. The game starts out in a front yard, and progresses to nighttime levels, where the gameplay is more challenging without any replenishing sun unless specific plants are used. Other levels feature the backyard, with a pool added. The final levels are nighttime pool levels (where fog fills the right half of the screen except when specific plants are used), a lightning storm level in pitch black (except when illuminated by occasional flashes of lightning), and rooftop levels (on the final level, the player must face a huge robot operated by a mad scientist who is also a zombie known as Dr. Zomboss). At set points throughout the game, the player is either warned through a letter by zombies or addressed by Crazy Dave to prepare for an ambush, where the game takes on a bowling style, using Wall-nuts to bowl down zombies, or a modified version of regular levels, where random plant types come up on a small selection, and the player can use the plants without spending sun.\r\n\r\nThe player starts with a limited number of seed pack types and seed pack slots that they can use during most levels. The number of slots can be increased through purchases with in-game money. At the start of a level, the player is shown the various types of zombies to expect and given the opportunity to select which seed packs to take into the level. Several plants are nocturnal, such as mushrooms, having a lower sunlight cost, and are ideal for nighttime levels. Certain plants are highly effective against specific types of zombies, such as the Magnet-shroom, which can remove metallic items from a zombie, such as helmets, buckets, ladders, and pogosticks.\r\n\r\nThe zombies also come in a number of types that have different attributes, in particular, speed, damage tolerance, and abilities. Zombies include those wearing makeshift armour, those that are able to jump or fly over plants, and a dancing zombie which has different designs depending on the version that is able to summon other zombies from the ground. At various points, the player will be inundated with a huge wave of zombies.\r\n\r\nIf a zombie reaches the end of a lane for the first time, a lawnmower at the end of that lane will shoot forwards and destroy all the zombies in that lane. However, if a zombie reaches the end of that same lane for a second time, it will reach the player's house. When this happens, the music changes and the other plants and zombies stop moving while that zombie enters the house. Crunching sounds will be heard, accompanied by a scream and a message saying \"The zombies ate your brains!\" The game will then end and display the Game Over dialog box.",
  "banner_url": "/games/banner/plants-vs-zombies.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:46.278530Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 14003
}