{
  "name": "Chessaria: The Tactical Adventure",
  "slug": "chessaria-the-tactical-adventure",
  "year": 2018,
  "description": "Enter the world of Chessaria, the turn-based fantasy game that combines Chess combat and a story-based mission system!\r\nStory\r\nAfter a thousand years of peace and prosperity, the elven city of Silveran is burnt to ashes by a dragon from the north. The bravest warriors will embark on an epic journey through the world of Chessaria to seek justice and unveil the truth behind the attack…\r\nFeatures\r\n\r\n    MISSION-BASED CHESS BATTLES\r\n    - Adventure Mode: Fight & solve puzzles in the 100 levels of the solo campaign.\r\n    - Quick Game: Enjoy Classic Chess and Chess variants in local multiplayer or against the A.I.\r\n    - Online Multiplayer: Fight against your Steam Friends in online battles.\r\n    - Battle with 3 playable armies (High Elves, Dark Elves and Orcs).\r\n    - Lead six heroes against challenging Bosses that will test your tactical skills.\r\n    NEXT GENERATION AI\r\n    - Challenge a new gen A.I. (2700+ ELO) that enables missions like domination, infiltration, assassination.\r\n    A FANTASY WORLD\r\n    - Discover a story that will put in your hands the destiny of the fantasy world of Chessaria.\r\n    BE ENCHANTED\r\n    - Enjoy an emotional soundtrack created by British composer Ben Rawles.\r\n\r\nChessaria introduces an innovative game genre: Chess-Adventure. Browse tactical levels & Chess puzzles that will confront strategy fans looking for a new challenge and delight heroic-fantasy enthusiasts!\r\nShare your suggestions\r\nShare your ideas to improve the game with us. We are great listeners!\r\n\r\n    Community Hub http://steamcommunity.com/app/575340/allnews/\r\n    Suggestions Hub http://steamcommunity.com/app/575340/discussions/4/\r\n    Discord https://discord.gg/BqTydqb",
  "banner_url": "/games/banner/chessaria-the-tactical-adventure.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-04-23T04:10:52.071327Z",
  "steamid": 575340,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 19397
}