{
  "name": "Natural Selection 2",
  "slug": "natural-selection-2",
  "year": 2012,
  "description": "Natural Selection 2 is an immersive, multiplayer shooter that pits aliens against humans in a strategic and action-packed struggle for survival. It seamlessly combines shooter and RTS/strategy gameplay.\r\n\r\nKey Features:\r\n* Two Unique Sides: Whether you play as one of the elite marine Frontiersmen or the vicious alien Kharaa, you must use unique strategies and your abilities to win. Marines form persistent squads to find and destroy alien hives. Aliens can choose a wall-running Skulk, pudgy Gorge, flying Lerk, murderous Fade or gigantic Onos that can smash through doors.\r\n* Real-time Strategy: Commanders play from overhead to lead their team to victory. Build structures anywhere, collect resources and research upgrades. Marines buy weapons at an Armory or build sentry turrets and siege cannons to assault the enemy. Aliens build upgrade chambers, evolve special abilities and plant traps.\r\n* Dynamic Environments: Use a flamethrower to clear the spreading alien infestation. Aliens destroy power nodes knock out the lights and power down marine structures. Random start locations mean you must scout your enemy and before committing to a build. Every game is different.\r\n* Unlimited Variations: WYSIWYG graphical tools and powerful scripting allow you to create new weapons, scenarios or entirely new games. You’ll get all our tools (level editor, cinematic tool and more) as well as the full Lua source code to Natural Selection 2. Version 1.0 is just the beginning – ongoing automatic updates keep the game fresh by adding new maps, weapons and abilities. Steam Workshop support and auto-downloading makes playing and distributing mods automatic - and gameplay always fresh. ",
  "banner_url": "/games/banner/natural-selection-2.jpg",
  "icon_url": "/games/icon/natural-selection-2.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:30.319204Z",
  "steamid": 4920,
  "gogslug": "",
  "humblestoreid": ""
}