{
  "name": "Blood Omen 2: Legacy of Kain",
  "slug": "blood-omen-2-legacy-of-kain",
  "year": 2002,
  "description": "Following the events of Legacy of Kain: Blood Omen, over 200 years the vampire Kain has assembled an army of vampires to take over the world of the humans. Fighting across Nosgoth, goal is to make his way to the great city of Meridian and take control of this stronghold. However, upon reaching the gates of the city, the army is challenged by the Serafan Order, an organized force of vampire hunters and its leader, the magical Serafan lord. Kain engages the Serafan lord in single combat, is struck down and defeated. Kain's sword, the Soul Reaver, is claimed by his enemy. Unconscious for 200 years, Kain awakes under the care of the vampire Umah to a world he barely recognizes. Having lost his army, the vampires have been hunted down by the Serafan and only a few remain. The city of Meridian is ruled under martial law by the Serafan Order and demands great things of it's citizens. Strange glyph magic is used to power machines and fuel industry and at the same time is deadly to vampires and used as wards throughout the city. Kain swears vengeance on the opponent who defeated him and seeks to reclaim his place as ruler of the vampires.\r\n\r\nThe Legacy of Kain: Blood Omen 2 is a third person action game with adventure elements, more similar in perspective to Soul Reaver than the first Blood Omen game. The player controls from behind Kain's shoulder and may move him in different directions, attack, jump, use dark gifts, and grab on to ledges. Kain's life energy steadily depletes and must be replenished constantly by drinking blood. Blood is found by consuming any living creature nearby, often requiring defeating an enemy through combat first. As Kain consumes blood, his meter is filled up. Once full, Kain gains additional health. Kain also learns new dark gifts throughout the game by defeating boss creatures. Some gifts include: the ability to blend into mist, fire projectiles, use projectile telekinesis or make a great horizontal leap. Many of these abilities can be used to perform stealth kills which will instantly defeat a foe. Kain will fight using his bare hands or by picking up daggers, swords, axes, and other weapons. These weapons all attack differently, eventually breaking, and may also be thrown at enemies from afar.\r\n\r\nThe Serafan uses glyph magic, partially because it is deadly to vampires. Kain will often encounter areas where he is barred from progress because of glyph barriers and must find a way around them. Additionally, glyphs function similar to electricity in that they power machines and switches. Many of the puzzles featured in Blood Omen 2 involve needing to create a glyph circuit in order to deliver power to a specific point. Glyph energy glows as it travels down it's connection, allowing the player to see exactly where the energy spark is.",
  "banner_url": "/games/banner/blood-omen-2-legacy-of-kain.jpg",
  "icon_url": "/games/icon/blood-omen-2-legacy-of-kain.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:39.134028Z",
  "steamid": 242960,
  "gogslug": "",
  "humblestoreid": "",
  "id": 3455
}