{
  "name": "Laser Arena",
  "slug": "laser-arena",
  "year": 2000,
  "description": "From Wikipedia\r\nLaser Arena is an FPS PC game designed to simulate laser tag. Play modes include Free for All (Deathmatch), Team Match, Duel, Domination, and Mega Target. Players have three \"health canisters\", and every hit diminishes one of them. After three hits, the player counts as \"dead\" and has to respawn after a delay. The game is based on a heavily modified Quake engine,[1][2][3] and despite being a budget-title, features some elements that were unique at the time of release. For example, the game models \"Lasertag Grenades\" which emit a vast number of shots in all directions, tagging every player in the vicinity.\r\n\r\nThe \"Mega Target\" game mode is rather novel in that it requires players to hit three targets strewn across the playing arena, before they are allowed to enter a \"core\" in which they shoot a final target to score a point. As an added element, automated defense turrets shoot at enemy players, and some can be converted to fight for your team by shooting at a sensor above the turret. This disables the turret for a few seconds and, if it's a convertible turret, makes it fight for your side until an enemy deactivates/converts it again.\r\n\r\nThe game does not feature different weapons, instead the player can collect powerups that increase the firing rate or the hit damage (thus reducing an enemy's energy canisters by two instead of one) for a limited time.\r\n\r\nThe graphics engine offers Glide, OpenGL, and software rendering. Multiplayer supports up to 8 players either competitively or against bots via LAN or GameSpy. Although not officially supported, the game is moddable, and a single mod named \"LaserArena Enhanced\" exists, improving textures and sounds as well as adding some useful keybinds that were not available in the original game.",
  "banner_url": "/games/banner/laser-arena.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-06-10T12:03:16.548429Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}