{
  "name": "Divinity: Original Sin 2 - Definitive Edition",
  "slug": "divinity-original-sin-2",
  "year": 2016,
  "description": "The Divine is dead. The Void approaches. And the powers lying dormant within you are soon to awaken. The battle for Divinity has begun. Choose wisely and trust sparingly; darkness lurks within every heart.\r\n\r\nWho will you be?\r\nA flesh-eating Elf, an Imperial Lizard or an Undead, risen from the grave? Discover how the world reacts differently to who - or what - you are.\r\nIt’s time for a new Divinity!\r\nGather your party and develop relationships with your companions. Blast your opponents in deep, tactical, turn-based combat. Use the environment as a weapon, use height to your advantage, and manipulate the elements themselves to seal your victory.\r\nAscend as the god that Rivellon so desperately needs.\r\nExplore the vast and layered world of Rivellon alone or in a party of up to 4 players in drop-in/drop-out cooperative play. Go anywhere, unleash your imagination, and explore endless ways to interact with the world. Beyond Rivellon, there’s more to explore in the brand-new PvP and Game Master modes.\r\n\r\n    Choose your race and origin. Choose from 6 unique origin characters with their own backgrounds and quests, or create your own as a Human, Lizard, Elf, Dwarf, or Undead. All choices have consequences.\r\n\r\n    Unlimited freedom to explore and experiment. Go anywhere, talk to anyone, and interact with everything! Kill any NPC without sacrificing your progress, and speak to every animal. Even ghosts might be hiding a secret or two…\r\n\r\n    The next generation of turn-based combat. Blast your opponents with elemental combinations. Use height to your advantage. Master over 200 skills in 12 skill schools. But beware - the game’s AI 2.0 is our most devious invention to date.\r\n\r\n    Up to 4 player online and split-screen multiplayer. Play with your friends online or in local split-screen with full controller support.\r\n\r\n    Game Master Mode: Take your adventures to the next level and craft your own stories with the Game Master Mode. Download fan-made campaigns and mods from Steam Workshop.\r\n\r\n    4K Support: an Ultimate 4K experience pushing RPGs into a new era!",
  "banner_url": "/games/banner/divinity-original-sin-2.jpg",
  "icon_url": "/games/icon/divinity-original-sin-2.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:14.104661Z",
  "steamid": 435150,
  "gogslug": "divinity_original_sin_2",
  "humblestoreid": ""
}