{
  "name": "Caller's Bane",
  "slug": "callers-bane",
  "year": 2013,
  "description": "Scrolls is a turn-based strategy game played with collectible cards called scrolls. It is played on a battlefield that consists of five rows each consisting of six hexes. The playing field is split into two parts where each player can place his units. Each player also have five idols that are placed on the far ends of the battlefield. To win a game the player has to destroy three of the opponent's idols.\r\n\r\nWhen starting out the player has a hand of scrolls and will get one new scroll after every turn. Casting scrolls cost resources which the player can earn by sacrificing scrolls. Once all resources have been spent the turn has to be ended. There are four kinds of scrolls: creatures, structures, spells and enchantments. Creatures and structures are the ones that can be placed on the battlefield. Creatures are used to attack the enemies and destroy idols while structures can be used to block enemy attacks and to strengthen other units. In addition to having attack and health ratings, creatures also have a countdown rating that decides when it will attack. When it reaches zero, the creature will at the end of the turn attack the nearest enemy or idol in its row. Spells and enchantments have various effects on units placed on the battlefield. Spells usually have an instant impact on a unit while enchantments leads to permanent changes such as affecting a unit's ratings.\r\n\r\nThe game features single player and multiplayer modes. In single player there are tutorials, trials and skirmish. Trials are custom games that works like puzzles with special rules and win conditions while skirmish matches can be played against three different computer levels (easy, medium or hard) and are meant for practice and trying out decks. Multi player consists of ranked matches where players can climb in rating, earn badges and attempt to reach a high place in a ladder. There is also a judgment mode that is played over a series of matches with special judgment decks.",
  "banner_url": "/games/banner/callers-bane.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:44.399998Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}