{
  "name": "Fade to Silence",
  "slug": "fade-to-silence",
  "year": 2019,
  "description": "Fade to Silence is a single-player and co-op survival adventure set in a post-apocalyptic world that is frozen in an eternal winter. Snow and ice have shaped a merciless landscape. Nature is corrupted. Monstrous creatures out of an Eldritch horror dream roam the frozen wasteland.\r\n\r\nAs the player you take the role of Ash, a natural but tormented leader. In that role you explore a post-apocalyptic, frozen wasteland to gather the resources necessary to establish a refuge for survival. With dwindling resources, simple tasks like upgrading equipment and collecting materials quickly require an expedition to scavenge the necessary items. In the search for survival materials, you must navigate a vast territory, in which you will encounter Eldritch monsters and an even greater foe: the unrelenting winter. While freezing temperatures constantly take their toll on Ash, the deadliest event is that of a blizzard. If caught by surprise, it takes every ounce of skill, determination and luck to survive.\r\n\r\nIn order to survive and overcome all challenges, you need to attract followers, bringing them into your refuge. Each individual skillset and character traits grants access to higher tier resources and gear. Without followers, you can scavenge only the barest necessities, crafting only makeshift tools and weapons.\r\n\r\nFade to Silence introduces the many dynamics of a harsh winter climate to a complex, character-driven, group survival experience. The dynamic weather system adds to the immersion of survival in a cold, corrupted world. Survival depends on how well you read weather patterns, and if you come to the right conclusion: either to look for shelter or to press home. The dynamic snow displacement leaves a realistic path by both player character and NPC. This telltale sign will tell you regions where it is good to hunt and regions where monsters are roaming.",
  "banner_url": "/games/banner/fade-to-silence.jpg",
  "icon_url": "/games/icon/fade-to-silence.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:42.043190Z",
  "provider_games": [
    {
      "name": "Fade to Silence",
      "slug": "1986871555",
      "service": "gog"
    }
  ],
  "steamid": 706020,
  "gogid": 1986871555,
  "gogslug": "fade_to_silence",
  "humblestoreid": "",
  "id": 23009
}