{
  "name": "Pokemon Revolution Online",
  "slug": "pokemon-revolution-online",
  "year": 2014,
  "description": "Hello prospective trainer, and welcome to PRO (Pokémon Revolution Online)!\r\n\r\nA project that aims to concretize the Pokémon MMO dream that many avid Pokémon fans have been hunting for, PRO is a free-to-play, fan-made, massively multiplayer online game that is predicated around the official Pokémon games.\r\n\r\nThe goal of PRO is to overlap a balance between the features of the main-series Pokémon games, and translating it well to an MMO environment. It strives to maintain the beloved features of the handheld games, while also making changes that are needed to acclimate to the continuity and player-interaction balance that is only healthy for an MMO environment.\r\n\r\nWritten in C#, PRO aims to be the most completely developed custom-engine Pokémon MMO. While PRO's team strives to maintain the core features true to the beloved franchise, it also has its crosshairs on engineering unique content and gameplay features that will provide a fresh, unprecedented gameplay experience—regardless of what Pokémon game(s) you may have previously played.\r\n\r\nAmbitious on taking a divergent path from other Pokémon MMOs before it, Shane founded PRO in September of 2014, and they have made immediate strides in developing the project as its closed-playtesting phase went underway thereafter. Development has advanced every day as it was progressively ushered closer to its public release—a release that was fittingly preceded by many months of intensive playtesting, as playtesters and staff collaborated to ensure that the game was eventually released in an impeccable state. \r\n\r\nWith a multiregional team, staff members come from a diverse range of time zones, and thus there are personnel working around the clock to develop, refine and fix the content and gameplay aspects that distinctively define PRO's identity.\r\n\r\nAfter months of outlying the public spotlight of Pokémon MMOs, PRO made immediate strides towards publicity as the vault was opened for public playtesting in January of 2015. As the web services also just went live, the more prominently accessible forums and IRC chat housed a rapidly growing community, as a microcosm of Pokémon enthusiasts found their way to the newly publicized Pokémon MMO.\r\n\r\nAfter a final wipe of all account-side data obtained during its playtesting stage, PRO made its full release in August of 2015, sparking a frenzy with the masses of eager players that have awaited its release after what was a growing pain—both for its staff and prospective players—in preparing its release.\r\n\r\nIn addition to unique content that has been and will be concocted by the PRO team, content-oriented familiarities will be found from any generational subset of the Pokémon game(s) you may have played—including PRO-custom islands (Orange Islands, Sevii Islands, and so on), in addition to the mainland regions. Starting in Kanto in a progressionally linear system, you will travel into other regions in generational succession upon completion of each region, specifically Johto and Hoenn regions (up until this point). When making the transregional transition into new regions, your Pokémon will be temporarily stored away; they will be made reclaimable later as you complete the region, while you start afresh as you (re-)explore each region from scratch as you did in the handheld games.\r\n\r\nPRO will never be complete; subjected to the continuity of an MMO complexion, it will always be an ever-evolving work in progress. In addition to modernizing the Pokémon, items, content and mechanics in accordance to the most up-to-date standards of the Pokémon franchise as its new generations come to fruition, PRO's staff has its everlasting goal of improving, expanding and needfully fixing incompletions or imperfections that can exist. While PRO's staff strives to ensure utmost quality for the game, it acknowledges that nothing is infallible; as such, it encourages its players, who are the best to determine what is desirable in a game, to raise up suggestions on the forums for where they feel it needs improvement.\r\n\r\nJump into the community and acquaint yourself with syndicate of Pokémon fans—be it on the in-game chat, the Forums, or its IRC Live Chat—as you all realize the Pokémon adventure you dreamed of—doing so collectively!.",
  "banner_url": "/games/banner/pokemon-revolution-online.jpg",
  "icon_url": "/games/icon/pokemon-revolution-online.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:47.187815Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 11955
}