{
  "name": "Quackshot: Starring Donald Duck",
  "slug": "quackshot-starring-donald-duck",
  "year": 1991,
  "description": "While Donald is flipping through some books in Scrooge McDuck's library, a map falls out of a book relating to the treasure of King Garuzia, ruler of the Great Duck Kingdom in ancient times.[8] The map leads to the location of the king's most prized possession, hidden in a secret place shortly before his death.[9] Donald thinks this is his path to riches.[10] Unfortunately Big Bad Pete overhears and pursues Donald throughout the game hoping to steal the treasure.[11]\r\n\r\nTeamed with his nephews Huey, Dewey, and Louie, and using the partial map from the library, Donald begins his search in Duckburg, with the trail being directed to an Aztec pyramid in Mexico. Outside the pyramid, he is directed by a \"sweet seniorita\" to obtain a \"hero key\" from an explorer back in Duckburg to open the pyramid. Inside the pyramid, Donald meets Goofy, who gives him a strange note and a plunger to help him reach higher places, and tells him that Gyro Gearloose is looking for him back in Duckburg.[12] Travelling across the rooftops of Duckburg to meet Gyro, Donald is given Gyro's latest invention, bubblegum ammo that can break through walls. The last location on the partial map is Count Dracula's castle in Transylvania, where Donald encounters a ghost who tells him that the Count carries the real treasure map.[13]\r\n\r\nAfter defeating Dracula, Donald receives a more complete map. In India, Donald enters the palace of the Maharajah, where she challenges him to defeat the tiger in her garden in exchange for a Sphinx Tear.[14] Donald succeeds and receives the Sphinx Tear, which is the key to open a temple in Egypt. Donald is able to solve the \"Riddle of the Sphinx\" using the note Goofy had given him, and obtains the Scepter of Ra before escaping in a mine cart. From there, he journeys to the South Pole, where he finds a key frozen in ice, and uses the Scepter of Ra to melt the ice and grab the key. The key unlocks the hold of a Viking ship, which contains an ancient diary with the secret to locating the treasure. The ship is haunted by ghosts, and the Viking captain sends Donald below decks to get rid of them. After defeating a skeletal Viking warrior, Donald returns to the deck, where the captain informs him that the diary is hidden in ice near the South Pole, and gives him an \"ancient Viking plunger\" that attaches to flying creatures.[15] Donald then returns to the South Pole, hitching a ride on one of Pete's bird minions to reach the diary.\r\n\r\nHowever, upon finding the diary, Pete shows up, holding Donald's nephews hostage in exchange for the diary.[16] After giving Pete the diary, Donald travels to Pete's hideout to defeat Pete and get the diary back. The diary reveals that the map, when dipped in water, will reveal the location of the Great Duck Treasure.[17] Donald flies to the island where the treasure is hidden and manages to evade its traps in order to reach the treasure vault. After defeating the ancient spirit guarding the treasure, Donald opens the vault only to find a simple stone statue.[18] When the disappointed Donald returns home, Huey, Dewey and Louie accidentally break the statue, which reveals a golden jeweled necklace was hidden inside. Donald gives the necklace to Daisy and the two fly off into the sunset together.",
  "banner_url": "/games/banner/quackshot-starring-donald-duck.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:52.551562Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13699
}