{
  "name": "MINDNIGHT",
  "slug": "mindnight",
  "year": 2017,
  "description": "MINDNIGHT is a FREE TO PLAY online multiplayer game of social deduction for 5 to 8 players, a take on the classic party games such as Werewolf and The Resistance. It is a game of deceit, accusations and unpredictability. It challenges the player's ability to lie and detect other players that are lying.\r\n\r\nHOW TO PLAY\r\nPlayers are assigned a random role to be either Agents or Hackers. In order to win the game with your team you must capture three nodes.\r\n\r\nIn each round, there are three phases. The Talking Phase, The Voting Phase and the Mission Phase.After a team proposal for a mission node, each player on the proposed and voted team must secretly perform an action on the mission node. Agents may only secure the node. Hackers may either secure or hack based on their preference.\r\n\r\nHackers have the objective to hack three nodes while Agents need to secure three nodes from the total of five. As a hacker you know who your fellow hackers are, but as an agent, you know only who you are.\r\n\r\n‰‰ Secure. Seek. Subvert. ¬þ±±\r\n\r\nBe an agent attempting to secure the city network, or be a hacker attempting to compromise and defeat them. Utilize your communication, manipulation, and deduction skills to persuade others and win the game. You’ll never play the same game twice.\r\n\r\nSet in a future cyberpunk San Francisco, in 2038, cities have crushed the open internet. Networks are locked by security nodes and need to be maintained by NTF agents. Hackers have been searching for a way to break into them for years.\r\n\r\nSave or corrupt the network by working together. Remember...in the future, anyone could be compromised. Who can you trust? ±\r\n\r\nThe game is a tribute to social party games such as The Resistance and Werewolf. As MINDNIGHT is heavily inspired after these games, we are looking into other table-top deduction social games to bring new features and modes along the way through updates. MINDNIGHT is a game that was created initially in a internal game jam.",
  "banner_url": "/games/banner/mindnight.jpg",
  "icon_url": "/games/icon/mindnight.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:23.805840Z",
  "steamid": 667870,
  "gogslug": "",
  "humblestoreid": ""
}