{
  "name": "Moho",
  "slug": "moho",
  "year": 2000,
  "description": "MoHo - (C) 2000 Lost Toys Ltd\r\n-----------------------------\r\nFor the latest information on MoHo, visit:\r\nhttp://www.losttoys.com/moho\r\n\r\n\r\nMultiplayer\r\n-----------\r\nMoHo Multiplayer works best with one player on Keyboard \r\nand one on a joystick.  Remember to set up the controls\r\nfor both players before you start a multiplayer game!\r\n\r\n\r\nSound and Music volumes\r\n-----------------------\r\nOn some configurations, it is occasionally possible that\r\nchanging the volume of music or sound effects in the \r\ngame has no effect.  Under these circumstances, you can\r\nadjust the volume of CD Audio and Samples in the Windows\r\nVolume Control Panel before starting the game.\r\n\r\n\r\n\r\nMoHo - (C) 2000 Lost Toys Ltd\r\n-----------------------------\r\nDie neuesten Infos über MoHo finden Sie unter:\r\nhttp://www.losttoys.com/moho\r\n\r\n\r\nMultiplayer\r\n-----------\r\nDer MoHo Multiplayermodus funktioniert am besten wenn\r\nein Spieler das Keyboard und ein Spieler einen Joystick\r\nbenutzt. Beachten Sie, dass Sie die Kontrollen für beide\r\nSpieler einstellen müssen bevor Sie das Multiplayer-Spiel\r\nstarten.\r\n\r\n\r\nSound- und Musiklautstärke\r\n-----------------------\r\nIn einigen Fällen kann es vorkommen, dass Änderungen an\r\nder Musik- oder Soundeffektlautstärke keine Auswirkung\r\nzeigen. In diesem Fall können Sie die Lautstärke der\r\nAudio CD Musik und der Soundeffekte über den Windows\r\nLautstärkeregeler vor dem Spielstart einstellen.\r\n\r\n\r\n\r\nMoHo - (C) 2000 Lost Toys Ltd\r\n-----------------------------\r\nPour connaître les dernières informations sur MoHo,\r\nvisitez:\r\nhttp://www.losttoys.com/moho\r\n\r\n\r\nMultijoueurs\r\n------------\r\nEn mode multijoueur, MoHo fonctionne mieux avec un joueur\r\njouant au clavier et un au joystick. Rappelez-vous de\r\nbien paramètrer les contrôles pour les deux joueurs avant\r\nde commencer une partie multijoueur!\r\n\r\n\r\nVolume des effets sonores et de la musique\r\n------------------------------------------\r\nSur certaines configurations, il peut occasionnellement\r\narriver qu'un changement du volume des effets sonores\r\nou de la musique n'est aucun effet. En de telles\r\ncirconstances, nous vous conseillons d'ajuster le volume\r\ndu CD audio et des samples directement sur le Panneau\r\n\"Contrôle du Volume\" dans Windows avant de commencer \r\nune partie.",
  "banner_url": "/games/banner/moho.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-10-22T22:01:59.668185Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}