{
  "name": "Command & Conquer: Generals – Zero Hour",
  "slug": "command-conquer-generals-zero-hour",
  "year": 2003,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Real-time strategy"
    }
  ],
  "aliases": [],
  "description": "It's Zero Hour, and time to unleash the absolute latest in modern weapons technology in a quest to become the world's most powerful General. In Command & Conquer™ Generals: Zero Hour, the first expansion pack to Command & Conquer Generals, players will wage a global war for control of the modern world and face the ultimate challenge by squaring off against the world's most elite commanders. Selecting from a variety of new units and an arsenal of new high-tech weaponry, players will use whatever it takes to remove enemy Generals from power. To emerge victorious, even the most experienced C&C Generals' veteran must discover new tactics and strategies to take full advantage of-and learn to defend against-the world's most lethal weapons. With the addition of new units, structures, and upgrades-plus enhanced controls, Battle Honors, and a variety of new online features-Command & Conquer Generals Zero Hour gives players the firepower they'll need for global domination. With 15 new missions, players may be tasked to destroy the U.S. fleet in the Mediterranean, root out a splinter cell in Cairo, infiltrate a U.S. intelligence building, or send in special operatives to capture weapons of mass destruction. An all-new Generals Challenge mode allows players to control any of 9 new armies in battle against 9 AI generals. The ultimate goal will be to successfully make their way through all 9 enemy Generals, and unlock a select number of their armies for play in Skirmish and Online modes and prove once and for all they are the Ultimate Modern Warfare General.",
  "banner_url": "/games/banner/command-conquer-generals-zero-hour.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-09-11T17:36:29.907648Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}