{
  "name": "Drakengard 3",
  "slug": "drakengard-3",
  "year": 2014,
  "description": "Drakengard 3 takes place roughly one hundred years before the events of Drakengard, acting as a prequel to the first two games in the series. Despite being a prequel, Drakengard 3 mostly follows separate timelines unrelated to the events of Drakengard. In earlier times, the land was ravaged by conflict between warlords. At the height of the carnage, five mysterious figures called Intoners appeared and using their ability to utilize magic through song, defeated the warlords and ended the conflict. Due to this, they become worshiped as deities and became rulers of various regions of the land. An unspecified time later, in the game's present, the strongest Intoner, One, wishes to unite the five once again and bring stability to the land. The source of the Intoners' power is an evil magical flower. Zero (ゼロ Zero), the main protagonist and antihero, was saved from death to be used as an instrument for mankind's destruction. Zero wishes to destroy all those affected by its power, herself and 'sisters' spawned when Zero attempted suicide and ensure the safety of the world.\r\n\r\nThe player controls Zero, who is now considered a traitor by the Intoners and their followers because of her mission to kill them. Aiding her on her quest is the dragon Mikhail (ミハイル Mihairu), who aids her and is her mount in aerial battle. The other five Intoners are: One (ワン Wan), the current ruler of the Intoners; Two (トウ Tou), the more cheerful member of the group and ruler of the Country of Sand; Three (スリイ Surii), ruler of the Country of Forest and an obsessive over dolls; Four (フォウ Fou), ruler of the Country of Mountain and the only virgin of the group; and Five (ファイブ Faibu), ruler of the Country of Sea and a woman consumed by greed for everything. Traveling with Zero on her quest are the disciples,[Note 2] a group who formally served the Intoners and accompany Zero after their original mistresses are killed.[19] They include: Cent (セント Sento), a dumb and overconfident man, as well as the lover of the Intoner Two; Octa (オクタ Okuta), an old and cunning man obsessed with sex; Decadus (デカート Decāto) a gentlemanly warrior with a masochistic streak; and Dito (ディト Dito), a sadistic young man. Each of the disciples helps the Intoner summon angels and daemons into battle. The game is narrated to the player by Accord (アコール Akōru), an android created by the \"old world\" to monitor and document all timelines.",
  "banner_url": "/games/banner/drakengard-3.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:16.936601Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}