{
  "name": "Journey: The Quest Begins",
  "slug": "journey-the-quest-begins",
  "year": 1989,
  "platforms": [
    {
      "name": "MS-DOS"
    }
  ],
  "genres": [
    {
      "name": "Adventure"
    }
  ],
  "aliases": [],
  "description": "Have you mettle enough to make siege on the Dread Lord himself?...We shall see.\r\n\r\nIf you've ever been spellbound by a fantasy story, captivated by a role playing game, or enthralled by interactive fiction, Journey will rouse your imagination to new heights.\r\n\r\nJoin us in our Journey. Travel beyond the known boundaries of interactive software into a new world of computer storytelling. Marc Blank - the pioneering co-author of the enormously popular Zork and Enchanter trilogies - weaves a fabulous tale of great adventure, drawing from the highest art of storytelling and the excitement of role playing games to create a fascinating new kind of computer entertainment.\r\n\r\nIn Journey, you become part of a mesmerizing epic created in the tradition of J.R.R. Tolkien's The Lord of the Rings. For five long years, failed crops, tainted water, and sickness have blighted a peaceful land. Brave villagers have set forth to find relief for their suffering region, but none have returned. Now, yet another small band is preparing to begin the odyssey. You'll share the adventures of Tag, Praxix, Bergon, Esher, and Minar as they solve puzzles, overcome obstacles, explore unknown lands.\r\n\r\nPass into the world of Journey with ease. The game is simple to learn: your challenge lies in choosing the right path, casting the best spell, and knowing whether to lie or tell the truth. Your imagination will be taxed more and more with each passing day as the difficulties become increasingly complex.\r\n\r\nAs the story unfolds, you become acquainted with the characters and their personalities. Each character acts on his own, sometimes advancing the quest, sometimes hindering it. You help them decide where to explore and what actions to take, taking part in their strategies and problem-solving.\r\n\r\nThe intrigue of a masterfully told story. The thrill of being a part of a great adventure. The challenge of leading the tale to its climactic conclusion. This is what makes Journey a uniquely compelling entertainment.\r\n\r\nEnter an exciting new realm of storytelling\r\n\r\n    A whole new brand of computer entertainment\r\n    Completely menu driven: can be played with just a mouse, joystick, or keyboard\r\n    Easy to learn yet challenging to play\r\n    More than 100 beautifully drawn on-screen illustrations\r\n    An engrossing tale gracefully told by Marc Blank, the co-creator of Zork and Enchanter.",
  "banner_url": "/games/banner/journey-the-quest-begins.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-08-21T06:59:04.059849Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}