{
  "name": "King's Quest II: Romancing the Stones (2002)",
  "slug": "kings-quest-ii-romancing-the-stones-2002",
  "year": 2002,
  "description": "King's Quest II: Romancing the Throne is the sequel to Quest for the Crown, and was designed by Roberta Williams in 1985. The game revisited Graham, now King of Daventry, and followed him on his journey through the land of Kolyma. Graham’s ultimate mission this time was to rescue the beautiful maiden, Valanice, from her quartz tower imprisonment and marry his Queen. King's Quest II: Romancing the Throne was made with Sierra On-Line’s AGI engine and featured the same 16-color CGA graphics and text parser as its predecessor. Due to the commercial failure of Sierra On-Line’s official SCI remake of King’s Quest I, no plans were ever made to upgrade King's Quest II in the same fashion.\r\n\r\nDespite this, many people regarded this sequel as being the King’s Quest game most in need of an update. Players were generally discontented, believing the puzzles did not vary widely from the previous game and that the storyline was sparse. Additionally, as with King’s Quest I, the graphics (which were impressive for their time) soon grew painfully outdated.\r\n\r\nThe King's Quest II: Romancing the Stones remake follows in the tradition of AGDI's King's Quest I: Quest for the Crown remake, containing updated graphics and the familiar Sierra Point-and-Click interface system. But this time there is also an added storyline, deeper plot, fleshed-out characters, clever puzzles, enhanced artwork, music, atmosphere, depth, culture, and more - basically, the whole nine yards!\r\n\r\nSince its initial release in December, 2002, AGDI’s King's Quest II remake has been downloaded over 451,400 times! The original speech add-on pack was downloaded more than 172,450 times, and the digital music add-on pack over 202,000 times, again proving that there is still vast interest in the adventure gaming genre!",
  "banner_url": "/games/banner/kings-quest-ii-romancing-the-stones-2002.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:04.687237Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}