{
  "name": "Fire Emblem: Shadow Dragon",
  "slug": "fire-emblem-shadow-dragon",
  "year": 2009,
  "description": "Fire Emblem: Shadow Dragon[b] is a tactical role-playing game developed by Intelligent Systems and published by Nintendo for the Nintendo DS handheld video game console. It is a remake of the Famicom title Fire Emblem: Shadow Dragon and the Blade of Light, the first entry in the Fire Emblem series. It released in 2008 in Japan and Europe, and in North America and Australasia the following year.\r\n\r\nShadow Dragon retells the events of Shadow Dragon and the Blade of Light. Set on the continent of Archanea, the story follows Marth, prince of the kingdom of Altea, as he is forced into exile from his lands when the evil wizard Gharnef and resurrected Dark Dragon Medeus begin their conquest of the continent. Forming new alliances with neighboring kingdoms, Marth must form a new army to retrieve the mystical Falchion sword and Fire Emblem shield to defeat both Gharnef and Medeus. The gameplay follows the Fire Emblem standards of turn-based battles played out on grid-based maps. Returning features include a character class system which evolves based on character usage, and permanent death for units defeated in battle.\r\n\r\nDevelopment began in 2007, overlapping with the final months of development on Fire Emblem: Radiant Dawn. Many staff from earlier entries returned, including director Tohru Narihiro and original composer Yuka Tsujiyoko, who handled the remixed and expanded soundtrack with Saki Kasuga. Character artwork was redrawn by Daisuke Izuka, with special contributions by Masamune Shirow. First announced in late 2007, it was announced for an international release the following year, localized by external company 8-4. It was met with critical and commercial success worldwide, with many calling it a high-quality port of the original despite lacking originality.\r\n\r\nFire Emblem: Shadow Dragon is a tactical role-playing game where players take control of main protagonist Marth and his army on missions across the continent of Archanea.[1] The gameplay and general game information is separated between the two screens of the Nintendo DS: the map is located on the bottom screen, while the top screen features story sequences, unit statistics (stats) and battle animations.[2] The game is divided into chapters, with each chapter being the stage for a single large-scale battle that advances the story and can lead to the recruitment of new units. \"Gaiden\" (side story) chapters are progressively unlocked depending on how many units have been lost in battles.[3] Prior to each chapter, players can prepare for battle, including changing a unit's currently assigned weapons, forging new weapons, and managing the inventory.[4] The game also features limited multiplayer functionality. Using the DS' Wi-Fi Connection or normal wireless internet, players can engage in voice chat with other players, engage multiplayer matches with groups of five units each, and loan units for in-game currency.[1][4]\r\n\r\nBattles take place on a grid-based battlefield, with objectives which range from clearing enemy groups to capturing points of importance. Each map has unique terrain to be negotiated in battle ranging from mountains to rivers and flat plains. Viewed from an overhead perspective, there are castles and locations such as shops that the player can visit, the latter of which provides a means for obtaining items.[1][4] Each chapter has a different set of victory conditions, which can be related to the number of turns taken or how the enemy force is dealt with.[1] Battles play out using a turn-based system where each unit on both sides is given their chance to move and act. During battle, the combat screen appears, showing the fight from a sidelong perspective. Both sides move at least once, after which the combat screen fades.[1][4] Battles between individual units are governed by the series' recurring Weapons Triangle, a rock–paper–scissors system where certain weapons have advantages over others — lances are stronger than swords, swords are stronger than axes, and axes are stronger than lances.[4] As they participate in battles, each unit gains experience points (EXP) from their actions: they raise their experience level by one when they have accumulated 100 EXP. EXP can be earned in both normal battles and challenge fights in special arenas.[1][4] Players can save at the end of each chapter or outside battle. They also have a single mid-chapter save available.[1][3] All units are subject to permanent death: If a unit dies in battle, they are removed from the rest of the campaign.[1]\r\n\r\nUnits each have a character class which determines their weapon, skill set, movement and attack range, and how much effect they have on other units, whether they used passive or aggressive skills.[3] There are thirty classes available to choose from: these include mounted units such as the Pegasus Knight, Sorcerers and Healers that wield magic for attack and healing respectively, soldiers who wield swords and axes, and archers who specialize in long distance attacks. The only class that is character exclusive is the Lord class, which is used by Marth.[1][4] Limitations are placed on how many of one class can be used in a single battle.[3] When a unit has reached Level 10, their class can be evolved along a select number of routes using an item called a Master Seal.[1] Units can also be re-classed, changing to a completely different class or back to their original class at the player's discretion: the re-class options has limits as there are only a limited number of available classes for a unit to change into. If a class change is reversed, all the unit's previous stats will be retained.[1][3] Each unit's weapon, which is directly associated with its class, has its level raised based on the amount of usage, while also decreasing its durability — unless merged with another identical item, the weapon will break after its maximum amount of uses.",
  "banner_url": "/games/banner/fire-emblem-shadow-dragon.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-04-24T05:50:36.463454Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13956
}