{
  "name": "Alien: Isolation",
  "slug": "alien-isolation",
  "year": 2014,
  "description": "Discover the true meaning of fear in Alien: Isolation, a survival horror set in an atmosphere of constant dread and mortal danger. Fifteen years after the events of Alien™, Ellen Ripley’s daughter, Amanda enters a desperate battle for survival, on a mission to unravel the truth behind her mother's disappearance. \r\n\r\nAs Amanda, you will navigate through an increasingly volatile world as you find yourself confronted on all sides by a panicked, desperate population and an unpredictable, ruthless Alien. \r\n\r\nUnderpowered and underprepared, you must scavenge resources, improvise solutions and use your wits, not just to succeed in your mission, but to simply stay alive. \r\n\r\nOvercome an ever-present deadly threat – Experience persistent fear as a truly dynamic and reactive Alien uses its senses to hunt you down and respond to your every move. \r\n\r\nImprovise to survive – Hack systems, scavenge for vital resources and craft items to deal with each situation. Will you evade your enemies, distract them or face them head on? \r\n\r\nExplore a world of mystery and betrayal – Immerse yourself in the detailed setting of Sevastopol, a decommissioned trading station on the fringes of space. Encounter a rich cast of inhabitants in a world scarred by fear and mistrust. \r\n\r\nWhen she left Earth, Ellen Ripley promised her daughter Amanda she would return home for her 11th birthday. Amanda never saw her again. \r\n\r\nFifteen years later, Amanda, now a Weyland-Yutani employee, hears that the flight recorder of her mother’s ship, the Nostromo, has been recovered at the remote trading station Sevastopol. The temptation for her to finally understand what happened is too much to resist. When the crew arrive at Sevastopol, they find something is desperately wrong. It all seems to be connected to an unknown menace, stalking and killing deep in the shadows. \r\n\r\nIn order to uncover the truth about her mother, Amanda is forced to confront the same terrifying thing that separated them.",
  "banner_url": "/games/banner/alien-isolation.jpg",
  "icon_url": "/games/icon/alien-isolation.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:18.673625Z",
  "steamid": 214490,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "alien-isolation",
  "id": 4016
}