{
  "name": "Mount & Blade: Warband",
  "slug": "mount-blade-warband",
  "year": 2010,
  "description": "In a land torn asunder by incessant warfare, it is time to assemble your own band of hardened warriors and enter the fray. Lead your men into battle, expand your realm, and claim the ultimate prize: the throne of Calradia!\r\nMount & Blade: Warband is the eagerly anticipated stand alone expansion pack for the game that brought medieval battlefields to life with its realistic mounted combat and detailed fighting system.\r\n\r\n* Graphical overhaul: Support added for HDR, FSAA, depth of field, soft particles, tone mapping, and many other effects\r\n* New models with greater detail and high-quality textures\r\n* Multiplayer battles with up to 64 players. Multiplayer modes include Deathmatch, Team Deathmatch, Capture the Flag, Conquest, Battle, and Siege\r\n* A campaign allowing you to become the ruler of a faction and convince lords to become your vassals\r\n* The ability to upgrade your companions to vassals by granting them lands\r\n* The ability to marry a lady of the realm for romance or cold political gain. Try to win a lady’s heart through poetry or bravery\r\n* Improved mechanics for soldier morale: Soldiers will break and run away if their morale gets too low\r\n* Pick any projectile off the battlefield for use as additional munitions\r\n* New motion-captured combat animations\r\n* Numerous improvements to the combat system: Your shield will still stop arrows even if you are not actively defending\r\n* The ability to play multiplayer matches on random maps as well as hand-designed ones\r\n* Multiplayer equipment system: Earn money by fighting opponents or accomplishing goals\r\n* The ability to use most throwing weapons in close combat: Switch to using a javelin as a short spear when the enemy gets close\r\n* Spend gold on more powerful equipment, using a carefully balanced system that will make combat more exciting without giving too much of an advantage to the leading team",
  "banner_url": "/games/banner/mount-blade-warband.jpg",
  "icon_url": "/games/icon/mount-blade-warband.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:49.419396Z",
  "steamid": 48700,
  "gogslug": "mount_blade_warband",
  "humblestoreid": "",
  "id": 73
}