{
  "name": "Astebreed",
  "slug": "astebreed",
  "year": 2014,
  "description": "Humanity Fights A Losing Galactic War!\r\nTheir Only Hope: a Young Pilot and a Girl Forever Changed.\r\n\r\nYou are Roy Becket, a young pilot with dreams of becoming as skilled as his adoptive father. When a galactic war with an ancient mechanical alien race reaches its boiling point, Roy is forced to spring into action and take control of an otherworldly bipedal war machine in hopes of saving what's left of humanity.\r\n\r\nJoining Roy is a young girl who claims to have escaped the clutches of the nefarious aliens. Forever altered through horrible experimentation, she now possesses the very abilities humanity will need to push back the doomsday clock.\r\n\r\nTogether, they must battle an unrelenting army alone and reunite their shattered family.\r\n\r\nThe End of All Things is in sight. At the edge of eradication stands Astebreed.\r\n\r\nArcade Shooter Evolved:\r\nAstebreed takes the classic arcade shooter and breathes new life into it. Using lovingly crafted 3D models, cutting edge particle effects, and tried-and-true Japanese mecha designs, Astebreed delivers an unparalleled atmosphere of beautiful destruction.\r\n\r\nA Full Arsenal:\r\nRoy has a considerable arsenal to combat his foes, as well. Armed with the mysterious Lucis device, Roy's mech can shoot from a distance, paint targets for precision homing attacks, and even get close for a killing blow with a powerful blade attack. No enemy shall escape your wrath, no matter where they hide.\r\n\r\nDynamically Changing Perspective:\r\nYour enemies are not always ahead of you. Your enemies swarm, fly and intercept, and Astebreed's dynamic perspective always keeps the action in view. Seamlessly switching between veritcal, horizontal, and 3D shooter, Astebreed will keep you guessing what your next threat will be, without ever interrupting the action.",
  "banner_url": "/games/banner/astebreed.jpg",
  "icon_url": "/games/icon/astebreed.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:34.961690Z",
  "provider_games": [
    {
      "name": "Astebreed Definitive Edition",
      "slug": "1207665523",
      "service": "gog"
    },
    {
      "name": "Astebreed",
      "slug": "astebreed",
      "service": "humblebundle"
    }
  ],
  "steamid": 283680,
  "gogid": 1207665523,
  "gogslug": "astebreed",
  "humblestoreid": "astebreed",
  "id": 2416
}