{
  "name": "Path of Building",
  "slug": "path-of-building",
  "year": 2016,
  "description": "# Path of Building\r\n\r\nWelcome to Path of Building, an offline build planner for Path of Exile!\r\n## Features\r\n* Comprehensive offence + defence calculations:\r\n  * Calculate your skill DPS, damage over time, life/mana/ES totals and much more!\r\n  * Can factor in auras, buffs, charges, curses, monster resistances and more, to estimate your effective DPS\r\n  * Also calculates life/mana reservations\r\n  * Shows a summary of character stats in the side bar, as well as a detailed calculations breakdown tab which can show you how the stats were derived\r\n  * Supports all skills and support gems, and most passives and item modifiers\r\n    * Throughout the program, supported modifiers will show in blue and unsupported ones in red\r\n  * Full support for minions\r\n* Passive skill tree planner:\r\n  * Support for jewels including most radius/conversion jewels\r\n  * Features alternate path tracing (mouse over a sequence of nodes while holding shift, then click to allocate them all)\r\n  * Fully intergrated with the offence/defence calculations; see exactly how each node will affect your character!\r\n  * Can import PathOfExile.com and PoEPlanner.com passive tree links; links shortened with PoEURL.com also work\r\n* Skill planner:\r\n  * Add any number of main or supporting skills to your build\r\n  * Supporting skills (auras, curses, buffs) can be toggled on and off\r\n  * Automatically applies Socketed Gem modifiers from the item a skill is socketed into\r\n  * Automatically applies support gems granted by items\r\n* Item planner:\r\n  * Add items from in game by copying and pasting them straight into the program!\r\n  * Automatically adds quality to non-corrupted items\r\n  * Fully intergrated with the offence/defence calculations; see exactly how much of an upgrade a given item is!\r\n  * Contains a searchable database of all uniques that are currently in game (and some that aren't yet!)\r\n    * You can choose the modifier rolls when you add a unique to your build\r\n    * Includes all league-specific items and legacy variants\r\n  * Features an item crafting system:\r\n    * You can select from any of the game's base item types\r\n\t* You can select prefix/suffix modifiers from lists\r\n\t* Custom modifiers can be added, with Master and Essence modifiers available\r\n  * Also contains a database of rare item templates:\r\n    * Allows you to create rare items for your build to approximate the gear you will be using\r\n    * Choose which modifiers appear on each item, and the rolls for each modifier, to suit your needs\r\n    * Has templates that should cover the majority of builds (inb4 'why is there no coral amulet?')\r\n* Other features:\r\n  * You can import passive tree, items, and skills from existing characters\r\n  * Share builds with other users by generating a share code\r\n  * Automatic updating; most updates will only take a couple of seconds to apply\r\n  * Somewhat more open source than usual (look in %ProgramData%\\Path of Building if you're interested)",
  "banner_url": "/games/banner/path-of-building.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-04-30T03:58:37.311997Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 26909
}