{
  "name": "Black Squad",
  "slug": "black-squad",
  "year": 2017,
  "description": "Battleye support, dedicated servers, great shooting mechanics and amazing netcode.\r\nBlack Squad is a military first-person-shooter game using the Unreal Engine 3 to show realistic graphics and dynamic visuals.\r\nAbsolutely no Pay-to-Win. Welcome to the best F2P shooter on the market.\r\nEasy to adapt and a shooting game oriented for mass military lovers.\r\n\r\nOne of the Most Played games on Steam\r\nHundred Thousands of players worldwide connect and are enjoying Black Squad. And even if you’re playing 10th hour of play or even thousands of hour, there’s always something new to learn, practice and discover. Black Squad drives you to play the game as we regularly updates to improve the gameplay, features, and items.\r\n\r\nNo money needed, just pure skills\r\nYou got the skills? Then Black Squad will be the perfect FPS in the market with high accessibility, as no additional payment is needed to play the game with all items/weapons purchasable with in game currency. You just need your skills to play better and to improve yourself as a good FPS gamer.\r\n\r\nGame where you can find no boredom\r\nFPS game with diversity of weapons, maps, modes and characters. With all these hundreds of weapons and different maps and modes to choose from; every games contains different stories, strategies and tactics. Black Squad doesn’t limit you on how you style to play the game, you won’t feel any boredom to try all these cool features of the game.\r\n\r\nYou are not alone, team up with your friends\r\nClan matchmaking system ensures you will be matched with the right players each game. Well balanced Clan matchmaking system tests your skill limitation beyond your expectation. Keep on improving your FPS skills with your friends against the other teams, which will match you with the right players each game.",
  "banner_url": "/games/banner/black-squad.jpg",
  "icon_url": "/games/icon/black-squad.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:37.522373Z",
  "steamid": 550650,
  "gogslug": "",
  "humblestoreid": "",
  "id": 12236
}