{
  "name": "Deceit",
  "slug": "deceit",
  "year": 2017,
  "description": "Deceit tests your instincts at trust and deception in a multiplayer first-person shooter. You wake up in an asylum to the sound of an unfamiliar voice, surrounded by five others. A third of your group have been infected with a virus, but who will escape? Whilst traversing the building the power will be going out creating darkness, allowing the infected players to transform into their terror form and strike. Find allies and complete objectives around the map to better your chances of survival.\r\n\r\nThe environment has been specifically setup to cause conflict amongst the group, creating doubt about the true intentions of players. The infected will be trying to cover up their group sabotage attempts, whilst the rest will be keeping an eye out for this suspicious behaviour and attempt to join forces with people they think they can trust.\r\n\r\nAs you progress through the map you'll come across objectives that will help you survive and progress towards the exit. However, you will need to decide which is most important to you, and whether to collaborate or fight with other players over them. With each decision gives players more information and an indication to what team you're likely to be on. However, the perception of each action won't necessarily be seen as a fair representation to others about your intentions as the truth can be easily skewed.\r\n\r\nThere are blackout periods across the map which allow for the infected to transform into what's known as their terror form. In this form they are much faster, stronger, and have night vision, with only one weakness: light. In this form the infected are truly terrifying, and with an array of intense killing animations players will be able to create some scary but also funny moments.\r\n\r\nOverall, the gameplay involves the frenzy of fast paced combat mixed with strategic map positioning, and of course the psychological aspects of determining who is infected.",
  "banner_url": "/games/banner/deceit.jpg",
  "icon_url": "/games/icon/deceit.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:07.543016Z",
  "provider_games": [],
  "steamid": 466240,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13582
}