{
  "name": "F/A-18E Super Hornet",
  "slug": "fa-18e-super-hornet",
  "year": 2000,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Flight"
    },
    {
      "name": "Shooter"
    }
  ],
  "aliases": [],
  "description": "From the designers of Apache Longbow, Hind and F-16 Fighting Falcon comes Super Hornet - Digital Integration’s state-of-the-art flight simulation of the Mc Donnell Douglas F/A-18E Super Hornet. This aircraft is a high performance, multi-role jet fighter capable of precision weapons delivery in day, night and adverse weather conditions.\r\nState-of-the-art flight simulators for the most powerful fighter of the world.\r\n\r\n    High fidelity flight model.\r\n    The most comprehensive and accurately simulated avionics to date.\r\n    2 ultra-realistic war-zones : Barents Sea and Indian Ocean.\r\n    40 missions.\r\n    4 instant action Quickstart missions for air-to-air combat and ground attack.\r\n    Two player co-operative gameplay, head to head action and network gaming for up to 24 players.\r\n    Wingman control\r\n    Carrier take-off and landings, with marshaling deck crew and vehicles.\r\n    State-of-the-art target-rich environments.\r\n    Fully \" active \" virtual cockpit, with comprehensive implementation of cockpit instrumentation, Heads Up Display and \" Headlock \" view for immersive air-to-air combat.\r\n    Vast range of weapons including the latest \" smart \" munitions.\r\n    Auto-pilot, terrain-avoidance and auto-land facility.\r\n    Spectacular rendered animations\r\n    High performance 3D visual engine with dynamic coloured lighting and light source shading\r\n    Integrated MMX and direct 3D support for the latest 3D accelerator cards.\r\n    First true HOTAS control for full control via a flightstick and throttle; you may never need to touch the mouse or the keyboard!",
  "banner_url": "/games/banner/fa-18e-super-hornet.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:27.297769Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}