{
  "name": "Pathfinder: Kingmaker",
  "slug": "pathfinder-kingmaker",
  "year": 2018,
  "description": "With the help of over 18,000 Kickstarter backers, Narrative Designer Chris Avellone and composer Inon Zur, Owlcat Games is proud to bring you the first isometric computer RPG set in the beloved Pathfinder tabletop universe. Pathfinder: Kingmaker puts you in the role of a brave adventurer fighting to survive in a world beset by magic and evil! Take on the role of a canny fighter hacking through enemies with an enchanted sword, a powerful sorceress blessed with magic by the hint of demon blood in her veins, a wise cleric of gods benevolent or malignant, a witty rogue ready to defuse even the deadliest of traps, or any of countless other heroes. The only limit is your imagination!\r\n\r\nThe Pathfinder Roleplaying Game is an evolution of the 3.5 rules set of the world's oldest fantasy roleplaying game, designed using the feedback of tens of thousands of gamers just like you. Whether you’re new to the Pathfinder® universe or you’re a seasoned veteran, Pathfinder: Kingmaker® is the CRPG you’ve been waiting for.\r\n\r\nPathfinder has considerable depth, not only in its lore, but also in its game mechanics and the freedom it offers to develop your own unique character. You can customize your character with a wide range of classes and powers including specialized archetypes, powerful arcane and divine spells, choosing from a multitude of class abilities, skills and feats. Pathfinder allows players to create heroes (or villains) that fit both their individual gameplay styles and their personalities.\r\nThe Story\r\nTo the north lie the Stolen Lands, a region that has been contested territory for centuries. Hundreds of kingdoms have risen and fallen in these lands, and now it is time for you to make your mark—by building your own kingdom! To do so, you’ll need to survive the harsh wilderness and the threat of rival nations… as well as threats within your own court.\r\n\r\nPathfinder: Kingmaker is based on Paizo’s award-winning Pathfinder Adventure Path of the same name. You certainly don’t need to be familiar with the story, but if you are, you will encounter characters you know and love as well as a host of brand-new events, companions, allies, and threats that expand and enhance the original Adventure Path. With help from Paizo and their authors, the story and quests have been expanded by RPG writer Chris Avellone and the Owlcat team, allowing for even more adventure in the already rich narrative of the Stolen Lands.\r\n\r\nWhile Pathfinder: Kingmaker is a single-player game, you won’t be adventuring alone. Kingmaker features a diverse cast of companions and NPCs, including iconic characters from the Pathfinder setting itself. You’ll need to decide who to trust and who to watch carefully, as each companion has an agenda, alignment, and goals that may differ from yours. Your journey will become their journey, and you’ll help shape their lives both in the moment and well into the future.\r\nYour Kingdom\r\nWe chose to adapt the Kingmaker adventure path because it features a host of open-world mechanics, allowing players to experience the story at their own pace as they explore the Stolen Lands, which will challenge you as both an adventurer and a ruler. Most importantly, the game allows you to claim these lands as your own, letting you carve your own kingdom from the wilderness. While classic dungeon crawling and exploration lie at the heart of this adventure, diplomacy, politics, and the ability to lead troops in the field are also part of the challenge. Choose your allies well, and keep them close while exploring ancient tombs and ruins — and while dealing with politics in your own court.\r\n\r\nAs you’ll discover, building a kingdom goes beyond simply building a stronghold: Your kingdom is a reflection of your character and your choices throughout the game. It is a living thing shaped by your alignment, your allies, and your ability to lead your people. Not only can your kingdom expand, opening up new territories and allowing you to build new towns and communities, but your capital city will physically change based on your decisions, your policies, and even whom you choose to ally with. As your kingdom grows, a number of factions and neighboring countries will come to you to seek favor—and to test your strength.\r\n\r\nExplore - Conquer - Rule",
  "banner_url": "/games/banner/pathfinder-kingmaker.jpg",
  "icon_url": "/games/icon/pathfinder-kingmaker.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:51.604823Z",
  "steamid": 640820,
  "gogslug": "pathfinder_kingmaker_imperial_edition",
  "humblestoreid": "",
  "id": 19669
}