{
  "name": "Ace Attorney Investigation: Prosecutor's Path",
  "slug": "ace-attorney-investigation-prosecutors-path",
  "year": 2011,
  "description": "Gyakuten Kenji 2,[a] unofficially known as Ace Attorney Investigations 2, is an adventure video game developed by Capcom. It was released in Japan for the Nintendo DS in 2011 and for Android and iOS in 2017; Capcom does not plan to release the game outside Japan, but a full English fan translation was released in 2015. The game is the sixth entry in the Ace Attorney series, and a sequel to Ace Attorney Investigations: Miles Edgeworth (2009).\r\n\r\nThe game follows prosecutor Miles Edgeworth, detective Dick Gumshoe and the teenage thief Kay Faraday, who investigate five cases; they face off against judge Hakari Mikagami, a rival character who is part of a \"prosecutor purge\" that removes weaker prosecutors from duty. The gameplay is divided into two types of phases: investigations, where the player searches the crime scene for evidence and talks to witnesses, and rebuttals, where they aim to find contradictions in witnesses' testimonies using the evidence found during the investigations.\r\n\r\nThe development team, which included director Takeshi Yamazaki, producer Motohide Eshiro and character designer Tatsuro Iwamoto, created the game for the series' tenth anniversary, and finalized its direction during a five-day stay in the Capcom Manor in 2010. The game took shorter than usual to create, as the developers had the original Ace Attorney Investigations to use as a base, leading to an increased focus on the game's story. Reviewers were positive to the game, citing its story and the new \"logic chess\" gameplay mechanic as highlights. Several Western journalists commented on the lack of a localization and included it on lists of games they wanted to see localized.",
  "banner_url": "/games/banner/ace-attorney-investigation-prosecutors-path.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-08-30T07:15:22.548991Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 29103
}