{
  "name": "Castlevania: Portrait of Ruin",
  "slug": "castlevania-portrait-of-ruin",
  "year": 2006,
  "description": "Portrait of Ruin features a 2D side-scrolling style of gameplay.[1] One of the main features to the gameplay is that players can switch freely between two characters, Jonathan and Charlotte, similar to the \"Julius mode\" from Castlevania: Dawn of Sorrow. Jonathan and Charlotte can combine their powers to perform a powerful attack together known as \"Dual Crush\",[6] and their combined abilities are needed in certain parts of the castle for them to solve puzzles and progress through the story. For example, the player must have both characters board two \"motorcycles\" and alternate between them to dodge obstacles to have both motorcycles intact to crash through a wall.[8]\r\nThe main characters, Jonathan and Charlotte, attacking together.\r\n\r\nAside from Dracula's castle, Jonathan and Charlotte explore other environments such as Egyptian-like deserts and London-like towns via paintings dispersed throughout the castle.[8] During the adventure, the heroes encounter 155 different enemies, which are kept track in a bestiary.[9] Many enemies from previous Castlevania titles make appearances either as standard monsters or bosses for the sections of the castle and paintings. As they progress, the duo learn new skills and acquire equipment and items which allow further exploration in the game.[10]\r\n\r\nLike previous Castlevania games, this game features alternate endings. Portrait of Ruin has two different endings. Both involve Jonathan and Charlotte preventing Dracula from being resurrected, but only one involves the defeat of Brauner, another vampire enemy, and the Actual defeat of Dracula. At one point in the game, the player's actions determine which ending will be obtained. The first ending is normally referred to as the \"bad\" ending because the main objectives of the game's story are not completed; to indicate this, the game will display a \"Game over\" screen instead of the credits. The second ending completes those objectives and allows the player to explore more of Dracula's castle and gain access to more paintings. This ending is considered the canonical ending to the game.",
  "banner_url": "/games/banner/castlevania-portrait-of-ruin.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:47.893220Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}