{
  "name": "America's Army",
  "slug": "americas-army-3",
  "year": 2002,
  "description": "America's Army is a game technology platform used to develop first-person shooter (FPS) video games published in 2002 by the U.S. Army. The game is branded as a strategic communication device, designed to allow Americans to virtually explore the Army at their own pace and according to their interests to determine if soldiering matches their needs, interests and abilities. America's Army represents the first large-scale use of game technology by the U.S. government as a platform for strategic communication, recruitment, and the first use of game technology in support of U.S. Army recruiting.\r\n\r\nThe America's Army concept was conceived in 1999 by Colonel Casey Wardynski; the Army's Chief Economist and Professor at the United States Military Academy.[3] Wardynski envisioned \"using computer game technology to provide the public a virtual Soldier experience that was engaging, informative and entertaining.\"[4] America's Army was managed by two other U.S. Army officers serving with Wardynski at the Office of Economic and Manpower Analysis (OEMA): Major Chris Chambers and Major Bret Wilson. Wardynski approached Michael Zyda and Michael Capps at the Naval Postgraduate School's (NPS) MOVES Institute in Monterey, CA to make this video game vision a reality. Zyda and Capps took a unique approach for developing a major software project in DoD by assembling a team of professional game developers with experience developing major titles and creating a development studio on the campus of NPS.\r\n\r\nThe Windows version 1.0, subtitled Recon, was first released on July 4, 2002. As of January 2014, there have been over 41 versions and updates released, including updates to America's Army: Proving Grounds which was released in August 2013. All versions have been developed on the Unreal Engine. The game is financed by the U.S. government and distributed by free download.\r\n\r\nAccording to game historian Carrie McLeroy America's Army has \"grown in ways its originators couldn't have imagined\".[4] Dozens of government training and simulation applications using the America's Army platform have been developed to train and educate U.S. Army soldiers.[5] America's Army has also been used to deliver virtual soldiering experiences to participants at events, such as air shows, amusement parks, and sporting events around the country. The America's Army series has also been expanded to include versions for Xbox and Xbox 360, arcade, and mobile applications published through licensing arrangements.[6][7]",
  "banner_url": "/games/banner/americas-army-3.jpg",
  "icon_url": "/games/icon/americas-army-3.png",
  "is_public": false,
  "updated": "2019-01-23T08:28:20.697741Z",
  "steamid": 13140,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 769
}