{
  "name": "DROD: Gunthro and the Epic Blunder",
  "slug": "drod-gunthro-and-the-epic-blunder",
  "year": 2012,
  "description": "The Caravel DROD franchise has been in development for over a decade and is beloved by thousands of players across the world. DROD is a thinking man's dungeon crawl. Each room is a unique, hand-crafted puzzle that you solve by clearing out all the monsters. Game mechanics are turn-based, and by making moves as fast or as slow as you like, you can experience the action and solve puzzles at your own pace.\r\n\r\nThis game is designed as an entry-level offering to the DROD world, with both new players and veterans in mind. The level layout is designed to be more forgiving, with multiple hub areas to explore. The game starts easy, has a smooth learning curve and an integrated online hints system. If DROD has seemed too difficult for you to get far into, then you should be pleased by the design that went into this game, making for a delightful blend of fun and challenge. The game features all-new puzzle elements and enhanced level crafting abilities that add more depth to the previous offerings in the franchise.\r\n\r\nIn this game, Beethro Budkin recounts an epic tale of adventure to his nephews about his grandfather, Gunthro Budkin, and his exploits in the dangerous nation of Rasarus. Gunthro is a third-generation smitemaster, and a rather ugly man. Smitemasters are hard-bitten, muscled veteran dungeon exterminators that slay hideous beasties in dark places for a living. You know Gunthro will get the job done, and you'll happily pay him for it because you can tell he's The Guy. When the Rasarun king is slain by an officer of Tueno, Gunthro is recruited by Rasarus to defend his country and reclaim its honor. However, as Gunthro searches deeper, he will find that things are not quite as they seem.\r\n\r\nDuring development, Gunthro and the Epic Blunder brought in a large group of talent. The puzzles and world are crafted by an established team of master level designers from the community, with story conceived by DROD creator Erik Hermansen himself, new game art by Erik and artist Brett Boyette, and a whole set of new music tracks by synthpop artist Jon Sonnenberg. Try it out now and experience all this:\r\n\r\n* Over 350 puzzle rooms, grouped within levels each organized around a different type of puzzle element.\r\n* Hub areas allowing for free exploration of multiple puzzle areas at once.\r\n* An engaging story of war, intrigue, adventure, and stupidity. Find out why!\r\n* Over a dozen monster types, each with varying abilities and behavior.\r\n* Dozens of characters, each portrayed with quality voice acting.\r\n* Layers upon layers of secrets and extra challenges for players ready to take on more.\r\n* Over 60-minutes of new soundtrack composed by synthpop artist Jon Sonnenberg of Travelogue.\r\n* Detailed in-game artwork that shows nine different environments across three nations, including forest, desert, swamp, underground, fortress and frozen areas.\r\n* Super active player community on the Caravel Forum, with large amounts of fan-made game content and modding easily loaded into the game for endless hours of entertainment.",
  "banner_url": "/games/banner/drod-gunthro-and-the-epic-blunder.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:29:18.038037Z",
  "steamid": 314330,
  "gogslug": "",
  "humblestoreid": "",
  "id": 4001
}