{
  "name": "Phantasmagoria 2",
  "slug": "phantasmagoria-2",
  "year": 1996,
  "description": "Curtis Craig is a thirty-year-old man whose distorted childhood is filled with horrors. His father was involved in an illegal, top-secret experiment for a company called WynTech Industries. Nearly nothing is known about the true nature of this experiment; but something in it affected the sanity of Curtis' mother, eventually driving her to suicide. Curtis' father was later shot, leaving the poor little boy with serious behavioural disturbances, and eventually in therapy.\r\n\r\nNow, a year after having been released from the mental institution, Curtis is employed at WynTech Industries, whose manager, Paul Warner, has seemingly taken it upon himself to take care of Curtis. He tries to find the cause of his psychotic episodes and the mysterious murders that break out all around him, all the while discovering more and more about his past life and his father's fate.\r\n\r\nPhantasmagoria: A Puzzle of Flesh is not an actual sequel to the original Phantasmagoria, but rather a follow-up that has similar themes and visual concept. The game is more heavy on puzzles and traditional adventure gameplay than its predecessor. The gameplay involves standard activities found in adventure games, including extended conversations with the characters featuring selectable dialogue topics, collecting and manipulating inventory items with the environment, etc. It is possible (and often necessary) to call characters on the phone, as well as check and answer e-mails accessed by Curtis' computer at his workplace.\r\n\r\nLike its predecessor, the game has a simple point-and-click interface and employs video sequences with live actors as cutscenes. Short movies are usually shown after each action performed by the protagonist.",
  "banner_url": "/games/banner/phantasmagoria-2.jpg",
  "icon_url": "/games/icon/phantasmagoria-2.png",
  "is_public": false,
  "updated": "2020-05-31T00:17:51.803443Z",
  "steamid": 501970,
  "gogslug": "phantasmagoria_2",
  "humblestoreid": "",
  "id": 7316
}