{
  "name": "Rayman: Revolution",
  "slug": "rayman-revolution",
  "year": 2000,
  "description": "Rayman: Revolution (Rayman 2: Revolution in North America), was released on 22 December 2000. It features many enhancements including new minigames and bonus challenges, upgrades to Rayman's abilities, level revisions, new music tracks, the option to switch between the gibberish from other versions and newly recorded real language voices, three new bosses, and Yellow Lum redistribution. The Hall of Doors was replaced with three central hubs, called The Minisaurus Plain, Globox's House and The Rainbow Creek, in which to walk to each level freely, play Ly's bonus challenges unlocked by freeing Revolution-exclusive prisoners called Familiar Spirits, and purchase ability upgrades or the new minigames from the Teensies with the Yellow Lums the player has collected.\r\n\r\nTo date, Revolution is the only edition of Rayman 2 that lets players save when a level has been only partially completed, but like all versions of the game, it still uses manual saves. This is also the only version in which the 1,000th Yellow Lum can be obtained normally, and hence actually changes the total back to 1,000 despite Razorbeard still eating it and the total changing to 999/999. The 1,000th Lum is obtained after beating Clark and receiving the Lumz Radar, a magnet-shaped gadget exclusive to Revolution that helps players track down any missed Yellow Lums.\r\n\r\nHowever, despite the numerous improvements and enhancements to the gameplay, the frame rate is not as smooth as the near-constant 60fps of the Sega Dreamcast version, and certain graphical effects from that version, such as the blue ring trails that accompany a fully charged gold fist orb, are also gone.\r\n\r\nThis port was later released on the PlayStation Network on 1 May 2012 in North America.",
  "banner_url": "/games/banner/rayman-revolution.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:55.121382Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 24841
}