{
  "name": "From Dust",
  "slug": "from-dust",
  "year": 2011,
  "description": "From Dust is the latest original game concept by Eric Chahi, creator of the cult classic, “Another World / Out of this World”.\r\nImmerse yourself in a world as exotically beautiful as it is dangerous! You control the destiny of a primitive tribe against the backdrop of a world in constant evolution—a universe where mighty Nature reclaims what is hers; and your mastery of the elements is your people’s only chance of survival...\r\n\r\nKey Features:\r\n* Ground-Breaking Technology\r\nPlay in the sandbox of one of the most advanced real-time nature simulations, where everything you see and interact with evolves dynamically, offering a constantly renewed experience.\r\n\r\n* Unique Art Direction\r\nDiscover a large variety of environments: Tropical islands, volcanic landscapes, deserts and so much more…\r\n\r\n* Rich Story Mode\r\nExplore 13 breathtaking territories of emergent gameplay. Master the natural forces at play on a mysterious archipelago and help a primitive tribe to recover the lost powers of their ancestors.\r\n\r\n* Confront Mighty Nature\r\nProtect your tribe against Nature’s most devastating attacks. Face down tsunamis, wildfires, earthquakes, volcanoes, torrential rains…\r\n\r\n* Master Godlike Powers \r\nControl the forces of nature to sculpt the world in your image. Hold back lava, stop raging waters, empty lakes, grow forests and raise mountains!\r\n\r\n* Live Up to the Challenge\r\nRace against the clock on 30 additional maps in Challenge Mode. Each scenario is a puzzle-like challenge where time is of the essence...\r\n\r\n* Online leaderboards\r\nCompare your Challenge Mode scores with the community on worldwide leaderboards.",
  "banner_url": "/games/banner/from-dust.jpg",
  "icon_url": "/games/icon/from-dust.png",
  "is_public": true,
  "updated": "2020-04-11T09:10:35.855100Z",
  "provider_games": [],
  "steamid": 33460,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "from-dust",
  "id": 620
}