{
  "name": "Just Cause 2",
  "slug": "just-cause-2",
  "year": 2010,
  "description": "Dive into an adrenaline-fuelled free-roaming adventure. As agent Rico Rodriguez, your orders are to find and kill your friend and mentor who has disappeared on the island paradise of Panau. There, you must cause maximum chaos by land, sea and air to shift the balance of power. With the unique grapple and parachute combo, BASE jump, hijack and create your own high-speed stunts. With 400 square miles of rugged terrain and hundreds of weapons and vehicles, Just Cause 2 defies gravity and belief.\r\n\r\n* UNIQUE VERTICAL GAMEPLAY – Take to the air like no other game. Experience total aerial freedom with the unique parachute and dual grapple\r\n* UNBELIEVABLE ADRENALINE-FUELLED STUNTS – Free fall, base jump, vehicle surf, para sail, skydive, grapple, slingshot, leap between vehicles, hang from helicopters, scale buildings. The impossible is within your grasp.\r\n* UPGRADED DUAL GRAPPLE – Your best tool is now a weapon. Fire two shots with the grapple hook and attach unwilling enemies to high-speed vehicles, hang them upside down from buildings, tether objects in mid air. The possibilities are as vast as your imagination. \r\n* DISCOVER THE SECRETS OF PANAU – Explore the island paradise; from sprawling cities, secluded beaches and towering mountain peaks – more than 400 square miles of your own personal playground.\r\n* EXPERIENCE TRUE FREEDOM – Hundreds of objectives can be completed in any way or order that you choose. When it’s time for a break from Agency business, kick back and enjoy all the attractions that Panau has to offer.\r\n* MASSIVE SELECTION OF VEHICLES – Catch air on a high-speed dirt bike, race across the sea in a power boat, or fire a spread of rockets from an attack chopper – more than 100 land, sea and air vehicles are yours for the taking.",
  "banner_url": "/games/banner/just-cause-2.jpg",
  "icon_url": "/games/icon/just-cause-2.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:01.823566Z",
  "steamid": 8190,
  "gogslug": "",
  "humblestoreid": "just-cause-2",
  "id": 597
}