{
  "name": "I Hate Running Backwards",
  "slug": "i-hate-running-backwards",
  "year": 2018,
  "description": "I Hate Running Backwards is a never-ending adrenaline packed shoot'em down roguelite that puts the emphasis on destruction and fighting never ending waves of enemies while time traveling through procedurally generated, fully destructible worlds! Pick your character and blast away enemies with a high powered arsenal of shotguns, lasers, rocket launchers, singularity cannons and other weapons! Get stronger by earning perks to decimate challenging bosses along the way.\r\n\r\nSam and friends get stuck in mixed space-time continuum and have to battle the giant Ugh-Zan, this time reincarnated as a giant mech, and his armada of deadly monsters. The battle will take them across different time periods and environments - from Aztec jungles to the deserts of Egypt with a deadly boss awaiting at the end of each environment.\r\n\r\nIntense never-ending action will have you destroying wave after wave of enemies on your way to the final boss. You think you're done when you do? Think again! The game loops and sends even tougher enemies at you. Lucky for you that the arsenal of weapons you pick up along the way is more than enough to help you deal with the threat.\r\n\r\nKEY FEATURES\r\n\r\n    Swing like you mean it! - Deflect rockets, bullets, bombs and cannon balls by swinging your mighty melee weapon! Destroy enemies with it! Destroy the environment with it! The more you swing, the more fun it gets!\r\n    Do you feel special, punk? - Break Special Weapon crates to get one of more than 40 Special Weapons in the game, ranging from the Shrapnel Umbrella to the allmighty Jericho!\r\n    Are you Serious? - Play as Sam “Serious” Stone, or other action game heroes in an endless mega-epic battle to destroy as many aliens and monsters as possible. If you’re going down, how many can you take with you?\r\n    Shoot ‘em down! - Turn the shoot ‘em up genre upside down with Sam doing what he hates the most - running backwards!\r\n    Monsters! Monsters everywhere! - Fight against horde after horde of enemies! Endless waves of monsters are coming straight for you! How long can you survive?\r\n    More powah! - Collect power ups that give you additional edge in combat!\r\n    Who’s with me? - Fight side by side with a friend in the couch co-op multiplayer mode for 2 players. Remember to leave some ammo for your buddy.\r\n    Who else is with me? - Unlock various and unique characters that bring their own special abilities to the battlefield.\r\n    Destructible environment - Watch as you and your foes destroy everything in your path while battling each other.\r\n    Guns blazin’ - Dual wield your weapons to glory! Combine Main and Special weapons and turn yourself into the ultimate death machine!\r\n\r\nAre you a Twitch streamer? Good news! I Hate Running Backwards has a unique twist for you!\r\nActivate Kill the Streamer mode and let your Twitch chat spawn enemies to try and kill you!\r\n\r\nKEY TWITCH FEATURES\r\n\r\n    Spawn hordes of enemies! - Your Twitch chat can spam numbers to spawn enemies that rush to kill you!\r\n    Shoot The Drone - Use the Twitch drone to shoot at the Streamer!\r\n    Spawn Werebulls! - Spawn mighty werebulls to rush the Streamer and kill him even faster!\r\n    Custom Twitch Chat Leaderboard! - A leaderboard for the best Streamer killers out there!",
  "banner_url": "/games/banner/i-hate-running-backwards.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:55.130178Z",
  "steamid": 575820,
  "gogslug": "",
  "humblestoreid": ""
}