{
  "name": "Art Of Fighting",
  "slug": "art-of-fighting",
  "year": 1992,
  "description": "Art of Fighting (Japanese: 龍虎の拳 Hepburn: Ryūko no Ken, lit. \"Fist of Dragon and Tiger\") is a video game trilogy in the genre of competitive fighting game titles that were released for the Neo Geo platform in the early 1990s. It was the second fighting game franchise created by SNK, following the Fatal Fury series and is set in the same fictional universe as a prequel to the Fatal Fury series. The original Art of Fighting was released in 1992, followed by two sequels: Art of Fighting 2 (龍虎の拳2 Ryūko no Ken 2) in 1994 and Art of Fighting 3: The Path of the Warrior (ART OF FIGHTING 龍虎の拳 外伝 Art of Fighting: Ryūko no Ken Gaiden) in 1996.\r\n\r\nArt of Fighting was the first fighting game by SNK to feature the character designs of former illustrator Shinkiro, who would go on to do the character designs for the later Fatal Fury and The King of Fighters games.\r\nThe Art of Fighting series follows the conventions of the time in the sense that the player faces a variety of opponents in best two-out-of-three matches. Each of the game's characters have a unique fighting style and set of special techniques. The player has two basic attacks—punch and kick—as well as a utility button that switches between punches, kicks, and throws. A fourth button is used for taunting. Art of Fighting's contribution to the genre was the inclusion of a \"spirit gauge\" underneath the character's life bar. When characters perform special techniques, their spirit gauge is depleted and their special attacks become weaker. Players can also drain their opponent's spirit gauge by taunting them.\r\n\r\nThe Art of Fighting series was also the first fighting series to allow players to perform a \"super attack.\" In the original Art of Fighting, the player's character can learn a super attack (dubbed the super death blow) by completing one of the game's bonus rounds (this technique is available by default in the 3rd game). All three games also feature \"Desperation Attacks\" that can only be performed when the player's health is low and the life bar is flashing.\r\n\r\nThe series also introduced graphical scaling into the fighting game genre: as the characters move towards each other, the camera zooms in to maximize the level of detail. Character sprites in Art of Fighting change as the fight progresses to become more bruised and cut as damage is taken.\r\nThe games follow the struggles of the students of the Kyokugen Karate Dojo, Ryo Sakazaki and Robert Garcia, in what appears to be the late 80s, Ryo is the son of the Kyokugen Karate discipline's creator, Takuma Sakazaki, and Robert is the wayward son of a billionaire family from Italy. The initial two games are set in South Town, a common location in SNK games that is also the setting for the Fatal Fury series, while the third appears to take place in a fictitious area of Mexico.\r\n\r\nThe plot of Art of Fighting alludes to Fatal Fury. Art of Fighting 2, for instance, documents the rise of Geese Howard, a character in Fatal Fury, from corrupt police commissioner to crime lord of Southtown. Takuma is said to be a contemporary of Jeff Bogard, adoptive father of Fatal Fury's main heroes, Terry and Andy Bogard; Jeff Bogard's murder at the hands of Geese Howard triggers the events of the Fatal Fury series.",
  "banner_url": "/games/banner/art-of-fighting.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:26.488904Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}