{
  "name": "Driver: San Francisco",
  "slug": "driver-san-francisco",
  "year": 2011,
  "platforms": [
    {
      "name": "Nintendo Wii"
    },
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "Racing"
    }
  ],
  "aliases": [],
  "description": "With crime lord Charles Jericho now on the loose, San Francisco faces a terrible threat. Only one man can stand against him. He has driven the streets of a hundred cities and spent his whole life putting criminals behind bars. But to take Jericho down, there can be no turning back, and he knows that this may very well be his last ride. His name is John Tanner. He is the DRIVER.\r\n\r\nDeveloped by Ubisoft Reflections, creators of the original title, DRIVER SAN FRANCISCO is the return of the established action driving video game series that has sold 14 million copies worldwide. Play as John Tanner, a hardened detective involved in a relentless manhunt throughout the City by the Bay. Thanks to a groundbreaking gameplay feature, players can now seamlessly shift between more than a 120 licensed vehicles, keeping them constantly in the heart of the action. With its timeless atmosphere, unique car handling and renewed playability, DRIVER SAN FRANCISCO will revitalize the classic free-roaming, cinematic car chase experience for this generation of gaming platforms.\r\n\r\nKey Features:\r\nTHE TRUE CAR CHASE EXPERIENCE\r\nRediscover the cinematic driving sensations of DRIVER: loose suspension, long drifts, sharp bends, and high-speed pursuits in dense traffic. Drive over 120 licensed cars involved in some of the most intense chase sequences ever witnessed.\r\n\r\nA RELENTLESS MANHUNT\r\nUncover a thrilling storyline in which personal revenge fuels Tanner’s relentless manhunt for Jericho. Follow Tanner's survival race across San Francisco and discover how this chase will bring him to the point of no return.\r\n\r\nSHIFT\r\nAs Tanner recovers from a terrible crash, he realizes he has acquired a new ability that enables him to instantly change vehicles and take control: SHIFT. Experience unprecedented intensity, diversity, and freedom; shift into a faster car, deploy civilian vehicles to destroy your enemies, and even take control of your opponents' car to force their demise!\r\n\r\nA CAR CHASE PLAYGROUND\r\nDrive on more than 200 kilometers of road network, over the Golden Gate Bridge, and along iconic locations throughout San Francisco. Shift from one car to the next and dip into the lives of different residents; a head-spinning array of characters, each with a unique perspective on their city under siege.\r\n\r\nMULTIPLAYER MAYHEM\r\nExperience 11 different, frantic, and addictive online modes, where the SHIFT feature allows you to be anywhere at any time.\r\n\r\n…AND MORE\r\nRecord your best stunts and chases with the Film Director replay mode to edit and share your movies. Test your driving skills with 20 challenging races and 80 “dares” spread all across the city. Listen to over 60 music tracks with songs from famous artists, including the theme from the original Driver.",
  "banner_url": "/games/banner/driver-san-francisco.jpg",
  "icon_url": "/games/icon/driver-san-francisco.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:17.930112Z",
  "steamid": 33440,
  "gogslug": "",
  "humblestoreid": ""
}