{
  "name": "Merchants of Kaidan",
  "slug": "merchants-of-kaidan",
  "year": 2014,
  "description": "Regain your riches, restore your honor and punish those who have wronged you.\r\n\r\nMerchants of Kaidan is a challenging trading game fused with lots of RPG elements. You start very humble, one cart, a purse of gold and silver coins is all that you have. Your task is to roam the world and search of opportunities to score some profit. Buy low, sell high - a merchant's motto is easy to grasp. And yet the job is harder than it seems.\r\n\r\nA good merchant needs to know everything about the market, he is always on the lookout for a deal, always listening, always engaging and deepening his knowledge. He knows what forces influence the prices, what events affect them. A good merchant listens to rumours and gossips spread by travelers at inns and taverns; hoping for a clue, a hint where to go, where a good deal awaits. A good merchant surrounds himself with specialists smarter than him, people who help him maximize profits and minimize losses. He always expands his fleet of carts, he balances risks, calculates profitability.\r\n\r\nThe conditions are constantly changing, and supply and demand for different goods with them. Maybe you'd like to pay a cheaper price for furs in the summer, and sell them for a hefty profit as the winter is coming and people need warmth.\r\nBut is it worth carrying them for so many days, risking robbery, moths and taking precious space that you could use to transport something now and make a profit immediately?\r\nOr is it worth to buy illegal herb in the out of reach swamps where it cost's next to nothing, and risk smuggling it into the city where you can sell it for an amazing profit? But what if the city guards want to control you? Should you pay a bribe? How big? Maybe the best course of action is to say that you have nothing and hope they don't find anything?\r\n\r\nThese are the types of questions you will have to ask yourself constantly.",
  "banner_url": "/games/banner/merchants-of-kaidan.jpg",
  "icon_url": "/games/icon/merchants-of-kaidan.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:21.688311Z",
  "steamid": 294020,
  "gogslug": "",
  "humblestoreid": ""
}