{
  "name": "Prince of Persia: The Two Thrones",
  "slug": "prince-of-persia-the-two-thrones",
  "year": 2005,
  "description": "The Prince of Persia makes his way home to Babylon, bearing with him Kaileena, the enigmatic Empress of Time, and unspeakable scars from the Island of Time. But instead of the peace he longs for, he finds his kingdom ravaged by war and Kaileena the target of a brutal plot. When she is kidnapped, the Prince tracks her to the Palace - only to see her murdered by a powerful enemy. Her death unleashes the Sands of Time, which strike the Prince and threaten to destroy everything he holds dear. Cast to the streets, hunted as a fugitive, the Prince soon discovers that the Sands have tainted him, too. They have given rise to a deadly Dark Prince, whose spirit gradually possesses him...\r\n\r\nFeatures:\r\n\r\n    Play and master two distinct characters: Wield the powers and weapons of two master warriors with different combat styles, attitudes, and histories.\r\n    Choose your way to kill: Master the expanded Free-Form Fighting system to destroy enemies in your own style; strangle enemies from afar with the deadly Daggertail; or use a new stealth art to inflict surprise decapitations and other attacks – the choice is yours.\r\n    Battle freely through Babylon: Dominate enemies on the perilous rooftops, dodge through chaotic streets, and ambush pursuers in dark, underground passageways.\r\n    Immerse yourself in a dramatic story: Experience unparalleled depth in storytelling as you fight your way through a twisting tale filled with adrenaline, tension and discovery.\r\n    Manipulate time to surprise enemies: Execute powerful attacks against entire armies by slowing down or rewinding time, or surprise them by using some all-new Sands of Time powers.\r\n    Destroy foes in furious chariot combat: Seize the reins of a chariot to fend off hordes of enemies at breakneck speed in impossibly tight pursuit.\r\n    Experience a masterful blend of gameplay: True to the Prince of Persia franchise, the game provides a variety of action combat, agility and story-driven puzzles – all masterfully blended together into a rich gaming experience.",
  "banner_url": "/games/banner/prince-of-persia-the-two-thrones.jpg",
  "icon_url": "/games/icon/prince-of-persia-the-two-thrones.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:52.665200Z",
  "steamid": 13530,
  "gogslug": "prince_of_persia_the_two_thrones",
  "humblestoreid": "",
  "id": 401
}