{
  "name": "Flashing Lights",
  "slug": "flashing-lights",
  "year": 2018,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Indie"
    },
    {
      "name": "Simulation"
    }
  ],
  "aliases": [],
  "description": "Enrol with the police, emergency medical services or fire department and take on missions unique to each service in an open world. Engage in desperate car chases, diagnose life-threatening injuries, and put out lethal fires! Each department has its own vehicles and equipment for you to operate while on duty. Play in single player, or work together with friends in online multiplayer to tackle incidents across a shared world.\r\n\r\n\r\nUsually the first to respond to a criminal incident, the police are equipped with the fastest vehicle and a variety of equipment. Their roles vary from handing out parking tickets to chasing down dangerous suspects. They’ll do everything they can to prevent criminal activity and put a stop to any crimes in progress.\r\n\r\n\r\n\r\n\r\nAs an emergency medical specialist, your job lies in keeping members of the public alive, treating patients’ injuries, diagnosis and more. Lifesaving equipment you’ll utilise includes medical kits, stretchers and ambulances.\r\n\r\n\r\n\r\n\r\nThe role of the fire department extends far beyond putting out flames, as they work closely with medical services out in the field, swiftly cutting open crashed cars so that medical staff can reach the casualty. The fire department won’t engage in the pursuit of suspects, but will handle the aftermath of an incident, including, of course, putting out fires. Battling raging flames and freeing trapped civilians involves some heavy-duty gear including spreaders, a fire hose, a fire extinguisher and a fire truck.",
  "banner_url": "/games/banner/flashing-lights.jpg",
  "icon_url": "/games/icon/flashing-lights.png",
  "is_public": false,
  "updated": "2019-08-17T06:47:52.525217Z",
  "steamid": 605740,
  "gogslug": "",
  "humblestoreid": ""
}