{
  "name": "Kara no Shojo",
  "slug": "kara-no-shojo",
  "year": 2008,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Sexual Content"
    },
    {
      "name": "Visual novel"
    }
  ],
  "aliases": [],
  "description": "March, 1956. \r\nTokyo: A metropolis finally starting to recover after Japan's defeat in the War.\r\nPrivate eye Tokisaka Reiji accepts a strange request from a girl in Inokashira Park.\r\n\r\n\"I want you to look for something. Me. My true self.\"\r\n\r\nMeanwhile, a series of bizarre murders are plaguing the area. Young women are disappearing, only to turn up dead and maimed with their wombs torn out. Seeking assistance on the case, Detective Uozumi Kyoko called up his old friend and former co-worker, Reiji.\r\n\r\nOuba Girls Academy: A school on the outskirts of Hoya City.\r\nReiji's little sister attends this school, where two young women have mysteriously vanished. Saeki Tokio, the vice principal, calls in Reiji to investigate their disappearance, giving him his third case.\r\n\r\nReiji infiltrates the academy as a substitute teacher to learn information from the students--but that's when he meets her once again.\r\n\r\nKuchiki Toko--his first client, the girl who asked him to search for her true self. Her manner is distinctly boyish as she remarks:\r\n\r\n\"Heya - so we meet again, Mr. Detective.\"\r\n\r\nThe body count continues to rise.\r\n\r\nWhat should be a simple search for some lost students is starting to grow out of control.\r\n\r\nFor some reason, the number of missing people and unidentified bodies don't match up.\r\n\r\nWho will be chosen as the next victim?\r\n\r\nAs this endless cycle of tragedy continues, what mysteries lie behind these new cases? \r\n---Behind a similar series of murders from six years ago?",
  "banner_url": "/games/banner/kara-no-shojo.jpg",
  "icon_url": "/games/icon/kara-no-shojo.png",
  "is_public": true,
  "updated": "2019-06-13T21:14:44.180693Z",
  "steamid": 965810,
  "gogslug": "",
  "humblestoreid": ""
}