{
  "name": "FIFA 17",
  "slug": "fifa-17",
  "year": 2016,
  "description": "Powered by Frostbite, FIFA 17 transforms the way you play, compete and emotionally connect with the game.\r\n\r\nFIFA 17 immerses you in authentic football experiences by leveraging the sophistication of a new game engine, while introducing you to football players full of depth and emotion, and taking you to brand new worlds accessible only in the game. Complete innovation in the way players think and move, physically interact with opponents, and execute in attack lets you own every moment on the pitch.\r\n\r\nKEY FEATURES:\r\n\r\nPowered by Frostbite technology. One of the industry’s leading game engines, Frostbite delivers authentic, true-to-life action; takes players to new football worlds; and introduces fans to characters full of depth and emotion in FIFA 17.\r\n\r\nA fresh new story mode. For the first time ever in FIFA, live your story on and off the pitch as the Premier League’s next rising star, Alex Hunter. Play alongside some of the best players on the planet, work with four authentic managers and take part in a brand new football experience, all while navigating the emotional highs and lows of The Journey.\r\n\r\nPhysical play overhaul and new attacking techniques. FIFA 17 represents transformation in the way players physically interact in all areas of the pitch. Control is now in your hands as you battle for space and possession. Plus, new options in attack give players more ways to create shot chances and finish in front of goal.\r\n\r\nSet piece rewrite. From free kicks to penalties to corner kicks, inject personality into your game and experience control from every dead ball situation.\r\n\r\nActive Intelligence System. A brand new system introduces constant spatial analysis, increases activity off the ball and changes the way players move, read, and react.",
  "banner_url": "/games/banner/fifa-17.jpg",
  "icon_url": "/games/icon/fifa-17.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:30.366162Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 25052
}