{
  "name": "Dead Cells",
  "slug": "dead-cells",
  "year": 2017,
  "description": "“Dead Cells may be the most fun I've had in a game all year.”\r\n9/10 – Polygon\r\n\r\n“[...] The game smartly dissects what’s so exciting about Metroidvanias (exploring labyrinthine levels packed with variety, unlocking new abilities that re-contextualize areas you already passed through) and reassembles those things around a compulsive roguelike core.”\r\nKotaku\r\n\r\n“[...] Dead Cells is worthy of its own invention. It’s not just a roguevania – it’s a damn good roguevania.”\r\nRock Paper Shotgun\r\nAbout This Game\r\nRoguelite? Metroidvania? Roguevania!\r\nYou grew up with the roguelikes, witnessed the rise of the roguelites and even the birth of the roguelite-lites? We'd now like to present for your consideration our RogueVania, the illegitimate child of a modern Roguelite (Rogue Legacy, Binding of Isaac, Enter the Gungeon, Spelunky, etc.) and an old-school MetroidVania (Castlevania: SotN and its ilk).\r\n\r\nFeatures:\r\n\r\n    RogueVania: The progressive exploration of an interconnected world, with the replayability of a rogue-lite and the adrenaline pumping threat of permadeath.\r\n    2D Souls-lite Action: Tough but fair combat, more than fifty weapons and spells with unique gameplay, and of course, the emergency panic roll to get you out of trouble.\r\n    Nonlinear progression: Sewers, Ossuary or Remparts? Once unlocked, special permanent abilities allow you to access new paths to reach your objective. Opt for the path that suits your current build, your play style or just your mood.\r\n    Exploration: Secret rooms, hidden passages, charming landscapes. Take a moment to stroll the towers and breath in that fresh sea mist infused air...\r\n\r\n\r\nInterconnected levels and progressive unlocking of access to the island provides you with a real incentive to explore your surroundings. Add in a degree of evolution for your character and permanent weapon upgrades and you can see where Dead Cells borrows from the long line of MetroidVanias that precede it.\r\n\r\nAt the end of the day though, it’s YOUR skills as a player that matter most! Roguelites are about constantly getting better, until what was an insurmountable obstacle becomes a walk in the park. Unforgiving combat wed to the absence of any kind of safety net makes for an adrenalin pumping ride each and every run and unrivaled replayability.\r\n\r\nDead Cells is currently in Early Access and comes with:\r\n\r\n    11 Levels - Each one with its own atmosphere, foes and secrets to discover.\r\n    2 Bosses - Made by the most sadistic of the devs, raised on the salt of the testers.\r\n    50 or so weapons and skills - Spears, swords, bows, freeze blast, etc.\r\n    2 special powers, unlocking new areas and paths (metroidvania gear lock items).\r\n    1 epic responsive, fluid and fun to play combat system.\r\n    1 Daily Run Mode Complete with leaderboards for lording it over your mates.\r\n    Hours of fun (depending on your skill, anything from 10 to 30 hours or more).\r\n    A few rage-quits, Ok a lot of rage quits… But you’ll git gud… Eventually.",
  "banner_url": "/games/banner/dead-cells.jpg",
  "icon_url": "/games/icon/dead-cells.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:39.210890Z",
  "steamid": 588650,
  "gogslug": "dead_cells",
  "humblestoreid": "",
  "id": 11324
}