{
  "name": "Disgaea: Afternoon of Darkness",
  "slug": "disgaea-afternoon-of-darkness",
  "year": 2007,
  "platforms": [
    {
      "name": "Sony PSP"
    }
  ],
  "genres": [
    {
      "name": "RPG"
    },
    {
      "name": "Turn-based strategy"
    }
  ],
  "aliases": [],
  "description": "A port for the PlayStation Portable named Disgaea Portable (魔界戦記ディスガイア PORTABLE Makai Senki Disugaia Pōtaburu) was released in Japan on November 30, 2006. It was later released in the United States on October 30, 2007 under the name Disgaea: Afternoon of Darkness.\r\n\r\nAfternoon of Darkness features extras over the original, such as a 16:9 format to take advantage of the PSP's widescreen display. There is also a mode that focuses on Etna as the main character. In Etna Mode, Etna kills Laharl by accident while trying to wake him in the beginning of the game and thus becomes the main character. There are some extra boss battles such as Overlord Zetta from Makai Kingdom and Rozalin and Adell from Disgaea 2. There is, for the first time, a multiplayer mode available through Ad-hoc connections. This features multiple modes such as a \"Defeat the Leader,\" \"Capture the Flag,\" and the original \"Battle.\" In the Multiplayer mode, each player also has access to \"Geo Cubes\" which give different effects to the battlefield. Other new additions include a music shop, which allows the player to listen to the game's various songs and even change the Item World theme, and a record keeper, which keeps track of various bits of information such as ally kills and obtained items.\r\n\r\nIn addition, Afternoon of Darkness includes a complete dual language option and the option to turn off battle animations. Most of the silent Japanese cut scenes now include voice acting. However, when set to English, the scenes that were originally silent in the PS2 release are still silent. To reflect Etna's recent voice actor change, her lines have been re-recorded to match Michelle Ruff's portrayal of Etna in Disgaea 2 and the anime.[citation needed] One notable omission is the theme song \"The Invasion from Within\" by Tsunami Bomb. As Atlus was the publisher of the original PS2 version and arranged for the licensing of the song, and NIS America (Nippon Ichi's American branch) published the PSP port themselves, they did not retain the rights to use the song and did not renegotiate for them. Also missing is the song \"One With the Stars\" which, like \"The Invasion from Within\", was added in the original PS2 release by A",
  "banner_url": "/games/banner/disgaea-afternoon-of-darkness.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:12.693926Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}