{
  "name": "4089: Ghost Within",
  "slug": "4089-ghost-within",
  "year": 2015,
  "platforms": [
    {
      "name": "Linux"
    }
  ],
  "genres": [
    {
      "name": "FPS"
    },
    {
      "name": "RPG"
    }
  ],
  "aliases": [],
  "description": "Sneak & battle your way through a procedurally generated mothership in this stealth action RPG! Supports user content & the Oculus Rift!\r\n\r\nPlease follow Phr00t's Software for giveaways, updates & more! http://www.facebook.com/phr00ts.software\r\n\r\n4089 takes many of the things you loved from 3079 & 3089, like character customization via stat points, grappling hooks, special powers, building options, futuristic settings, random enemies, weapons, and environments. Then, it presents itself in a much more focused game that gets you into the action easier and faster. 4089 takes more influence from the roguelike genre & has more emphasis on stealthy elements than ever before.\r\n\r\nYou'll be able to battle & sneak through a procedurally designed ship. Hack cameras & locked doors. Build walls for cover. Break down secret walls to discover new paths. Choose whether you are playing for the full adventure, or just a quick challenge. Edit or create your own rooms, enemies, weapons, textures, models & sounds, then share them with the world!\r\n\r\n4089: Ghost Within has 3 game modes, \"Normal\" mode (skill points are lost at death), \"Limited Lives\" mode (no skill points are lost, but you only have 4 lives) & \"Permadeath\" mode (you only have 1 life).\r\n\r\nAlso, find out how the worlds of 3079 & 3089 connect in this sequel and decide what to do with the all powerful Overlord.\r\n\r\nJava 8 comes bundled with 4089. However, you may need to install Java 8 on Linux or Mac to run. If you are having trouble installing or running 4089, please uninstall old versions of Java & re-install the latest from http://www.java.com/getjava.",
  "banner_url": "/games/banner/4089-ghost-within.jpg",
  "icon_url": "/games/icon/4089-ghost-within.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:09.157673Z",
  "steamid": 329770,
  "gogslug": "",
  "humblestoreid": ""
}