{
  "name": "Blood",
  "slug": "blood",
  "year": 1997,
  "description": "You carved your soul to shreds in servitude to a dark god, but false promises and betrayal were your only reward. Now you've got a score to settle and it will be measured in...\r\nBLOOD\r\nBloodcurdling realism: moving trains, planes and shifting ice floes add to the 3D terror!\r\n\r\nEight player Bloodbath mode: optimized for online services, modem-play and LAN, offers white-knuckled battles, fiendish new enemy humiliations, and \"The Voice\" commenting on each of your kills!\r\n\r\nAdvanced Build engine offers dynamic, interactive environments: true rooms-above-rooms, sloped and slanted floors/ceiling, translucent water and hemorrhaging walls!\r\n\r\nMacabre map editor: allows you to build your own abominations!\r\n\r\nDestroy huge parts of the environment: scar walls with bullet holes, rip trees apart with dynamite, ruin architecture--experience the ultimate in wildly horrific gaming!\r\n\r\nPlay and destroy dark carny games: Kick the Head, ride the Happy Go Pukey, even bash mimes because a mime is a wonderful thing to waste!\r\n\r\nScads of power-ups and super secrets: Death Masks and Guns Akimbo; Fire and Spirit armor; hidden areas and other gruesome discoveries await you!\r\n\r\nMassive gib explosions fly from evil enemies: set fire to your rivals and watch them dance; play soccer with zombies' heads; shoot a cultist with a flare gun and he'll disintegrate into a pile flaming gibs!\r\n\r\nExperience 3D sound in 3D space: shudder as speeding missiles whiz by & bullets ricochet off walls!\r\n\r\nADRENALINE VAULT: \"IT DOESN'T GET ANY BETTER THAN THIS... EYE POPPIN' DEMO AWARD\"... GAMEPEN: \"WITH ITS CLEAR EMPHASIS ON ADDING MORE GORE AND BLACK HUMOR, BLOOD PROMISES TO BE A REAL HOOT!\"... NEXT GENERATION ONLINE: \"WITH INNOVATIVE WEAPONS AND A DASH OF STEPHEN KING-ESQUE HORROR, BLOOD CERTAINLY WILL INTEREST GAMERS ACROSS THE WORLD.\"... GAMESLICE: \"ACTION! HUMOR! ATMOSPHERE! BLOOD DOES IT ALL WITH A HEAVY DOSE OF HORROR!\"... PC GAMER: \"BLOOD IS DESTINED TO BECOME ONE OF THE NEXT GREAT CULT HITS... THE GAME MORE THAN LIVES UP TO ITS NAME AND IS CERTAINLY THE MOST FUN I'VE HAD THIS YEAR!\"...",
  "banner_url": "/games/banner/blood.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-09-15T04:44:42.857689Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}