{
  "name": "InuYasha: Secret of the Divine Jewel",
  "slug": "inuyasha-secret-of-the-divine-jewel",
  "year": 2007,
  "description": "InuYasha: Secret of the Divine Jewel is an RPG game featuring an original story with characters and settings based on the anime series InuYasha. The story begins when Janis, an American, is transferred to Japan. She soon meets Kagome, and one day when looking for her enters the Bone Eater's Well and is travels back to feudal era Japan. While there, she inadvertently touches a Shikon Jewel shard, which is absorbed into her body. The jewel shard has awakened a power in Janis known as Kamuitama, a divine power which gives her some magical abilities. Janis joins up with Kagome, InuYasha, Sango, Mioku, Shippo and others from the series on a quest to find a way to retrieve the jewel shard.\r\n\r\nThe gameplay is typical RPG style with a quest mode and a battle mode. In the quest mode you can explore the various locations in the game and visit different villages. Different characters can be encountered to talk to and provide more information on your quest. You may also buy or find items that can prove to be useful, such as by restoring hit points or curing poison. As you progress through the game, the story will unfold. When you are exploring the fields and dungeons, battles are randomly encountered entering the game into battle mode.\r\n\r\nThe game uses a turn based battle system. Each character has several different attacks of varying strengths that can be performed; some characters also have different skills that can be used to attack (such as InuYasha's wind scar or Shippo's fox magic) or help out your party (such as by restoring hit points). Each character has a limited amount of energy, and as attacks are executed the energy drains; if you run out of energy you can't attack, but a turn can be utilized to \"spirit up\" and recover some energy back. The more powerful an attack, the more energy it will require. If all of your characters lose all of their hit points in battle the game will be over.",
  "banner_url": "/games/banner/inuyasha-secret-of-the-divine-jewel.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-04-28T04:35:42.331099Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 32755
}