{
  "name": "Hedgewars",
  "slug": "hedgewars",
  "year": 2006,
  "platforms": [
    {
      "name": "Linux"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "Artillery"
    },
    {
      "name": "Turn-based strategy"
    }
  ],
  "aliases": [],
  "description": "Hedgewars is a turn based strategy, artillery, action and comedy game, featuring the antics of pink hedgehogs with attitude as they battle from the depths of hell to the depths of space.\r\n\r\nAs commander, it's your job to assemble your crack team of hedgehog soldiers and bring the war to your enemy.\r\n\r\nGame Features:\r\n-    Hilarious and strategic turn based combat for up to 8 players\r\n-    Both local and network multiplayer, with optional AI opponents\r\n-    Two singleplayer campaigns with a total of 24 missions\r\n-    Utilize about 58 devastating weapons and utilities! Defeat your foes with simple weapons like grenades or take it to the next level and trash entire landscapes with weapons like the watermelon bomb or piano strike\r\n-    Improve your skills in a total of more than 25 single missions for learning the game, target practice, challenges and just for fun\r\n-    Battle on an infinite number of randomly generated maps with 37 environments, or choose from 44 set image maps, or even draw your own in an editor\r\n-    Play the game your with 25 different game modifiers, tweak almost every aspect of the match\r\n-    Save your favourite gameplay settings in schemes\r\n-    Customize your team, with over 280 hats/costumes, 32 graves, 13 forts, 100s of flags and 13 unique voice packs\r\n-    Huge battles with up to 64 hedgehogs\r\n-    Play both singleplayer and multiplayer mini games\r\n-    If that's not enough, you can download tons of community content packs straight through the game or even plugin your own custom graves, maps, hats and costumes, and a lot of other artwork.\r\n\r\nHedgewars is free software, released under the GNU GPL v2.",
  "banner_url": "/games/banner/hedgewars.jpg",
  "icon_url": "/games/icon/hedgewars.png",
  "is_public": true,
  "updated": "2020-01-06T03:04:41.768626Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}