{
  "name": "Flyff",
  "slug": "flyff",
  "year": 2005,
  "description": "Players control an avatar that spends most of its active time fighting and most of its inactive time running a shop. Character classes are chosen at level 15 and sub-classes at levels 60 and 130, referred to as the first, second, and third job changes. The job changes are obligatory—when a character reaches the requisite level, experience gain stops until the completion of one of the job quests.\r\n\r\nLevels are gained based on experience, which can be acquired by killing Masquerpets and by performing quests. Quests generally involve killing specific Masquerpets and collecting the different quest objects they drop; a typical early quest is that of \"Party of Is,\" with the requirement of collecting 7 Chupims through killing Pukepukes.[4]\r\n\r\nAt each level, the character receives skill points that can be invested in skills available to its job(s). There are two types of skills: those used for attacking and those used for protection and/or enhancement. Skills may have cool-down times and may cause status effects, with confusion, stun, and bleed among the most common effect. It is not possible to acquire maximum levels in all available skills until becoming a level 60 Master.[5]\r\n\r\nCharacters can be improved by acquiring objects such as improved equipment. Masquerpets drop equipment, the in-game currency penya, consumable items such as food and potions, and quest objects, or players can purchase equipment from other players note this is usually extremely expensive because of the high quality gear that can be acquired this way. These can all be traded between players; Flyff gameplay involves large amounts of buying and selling in order to collect desired equipment. Most equipment items have minimum levels at which they can be used.",
  "banner_url": "/games/banner/flyff.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-10-22T22:06:47.035917Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 29471
}