{
  "name": "Expeditions: Conquistador",
  "slug": "expeditions-conquistador",
  "year": 2013,
  "description": "Expeditions: Conquistador is a tactical roleplaying game with a touch of strategic resource management and a pinch of choose-your-own-adventure. Conquistador is set in a rarely visited part of history which is rife with mystery, political intrigue, and good old-fashioned violence.\r\n\r\nYou will take on the role of a Spanish Conquistador in South America around 1520. Select the members of your expedition and explore campaign maps based on the actual topological maps of Hispaniola and Mexico. Through intricately branching dialogue, you will engage with the characters and situations that you encounter across these uncharted areas, and when it’s time to spill blood, a tactical combat system of great depth and brutality will let you control your individual troops in battle.\r\n\r\nCombat is intimate and detailed, and failure has great consequences. Every expedition member has a face, a past, a set of personality traits, and of course a combat role – their morale will change depending on your decisions, they will chime in when you’re weighing your options, and if they fall in battle, their injuries will carry over to the world map, where they must be treated by your doctors until they’re back on their feet. Should you fail to treat your expedition members, they will die and be gone for good.\r\n\r\nChoice and consequence is central to the play experience of Conquistador. As the leader of the expedition, you will face difficult decisions about the use of your troops and your resources, as well as how to engage with the factions of the savage New World. Will you defy history and be a diplomatic envoy of peace? Or will you be a ruthless conqueror determined to lay all of the Aztec Empire at your feet?",
  "banner_url": "/games/banner/expeditions-conquistador.jpg",
  "icon_url": "/games/icon/expeditions-conquistador.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:41.906840Z",
  "provider_games": [
    {
      "name": "Expeditions: Conquistador",
      "slug": "1207659232",
      "service": "gog"
    }
  ],
  "steamid": 237430,
  "gogid": 1207659232,
  "gogslug": "expeditions_conquistador",
  "humblestoreid": "",
  "id": 649
}