{
  "name": "Divinity: Original Sin - Enhanced Edition",
  "slug": "divinity-original-sin-enhanced-edition",
  "year": 2015,
  "description": "Gather your party and get back to the roots of great RPG gameplay. Discuss your decisions with companions; fight foes in turn-based combat; explore an open world and interact with everything and everyone you see.\r\n\r\nYou take on the role of a young Source Hunter: your job is to rid the world of those who use the foulest of magics. Embarking on what should have been a routine murder investigation, you find yourself in the middle of a plot that threatens to destroy the very fabric of time.\r\n\r\n    A complete revamp: Thousands of enhancements, full voiceovers, new game modes, full controller support, split-screen co-op, hours of new and revised story content, a brand-new ending, new weapon styles, new skills, new puzzles, new enemies, better loot, better balancing and much, much more!\r\n    New game modes for extra replay. Explorer Mode for story-focused RPG fans. Classic Mode for those who want it just right. Tactician Mode for hardcore players, featuring fully reworked encounters, different traps and new and smarter enemy types. And Honour Mode, for the tactical geniuses among you!\r\n    Pen-and-paper-like freedom. Explore many different environments, fight all kinds of fantastical creatures, and discover tons of desirable items. You will be amazed at how much freedom the games gives you.\r\n    Manipulate the environment and use skill & spell combos to overcome your many foes. Warm up ice to create water. Boil the water to create a steam cloud. Electrify the steam cloud to create a static cloud and stun your enemies!\r\n    Play with a friend in co-op multiplayer, either online or with dynamic split-screen.\r\n    Unravel a deep and epic story, set in the early days of the Divinity universe. Discuss with your party members how to handle the many decisions you'll need to make.\r\n    Classless creation lets you design the character of your choice. Endless item interaction and combinations take exploration and experimentation to new levels of freedom.",
  "banner_url": "/games/banner/divinity-original-sin-enhanced-edition.jpg",
  "icon_url": "/games/icon/divinity-original-sin-enhanced-edition.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:14.124173Z",
  "steamid": 373420,
  "gogslug": "divinity_original_sin_enhanced_edition",
  "humblestoreid": ""
}