{
  "name": "Alpha Mission II",
  "slug": "alpha-mission-ii",
  "year": 1991,
  "description": "Alpha Mission II (also known as ASO II: Last Guardian, its Japanese title) is a vertically scrolling full screen shoot 'em up released by SNK in 1991 for the Neo Geo arcade and home systems. It was later released for the Neo Geo CD in 1994 and for the PlayStation Portable in 2010.\r\n\r\nThe player controls a fighter spacecraft (Armored Scrum Object) and can shoot enemies in the air, bomb enemies on the ground, collect power-ups, and defeat bosses to advance levels.\r\nThe game controls uses 2 or 3 buttons used depending on the selected shuttle mode. The ships armaments consist of air-to-air laser shots, air-to-ground missiles and any Power Weapons the player collects. The laser and missiles can be upgraded up to four times by collecting the powerups from drones that are shot. Power Weapons are available after the players collects three pieces of the same armour type or can be bought with credits acquired after each stage. The weapons have a limited power indicated on an energy meter. Using the weapons or getting the ship damaged lowers the energy. The energy can be recharged by E power ups. Once the energy expires the ship returns to normal mode. Depending on which mode is selected varies whether Button C or B activates the Power Weapons.\r\n\r\nVarious hidden items can do certain things like an R item can put the shuttle in Reverse for a certain distance. The shuttle is destroyed by the one shot or by running into an enemy unit or hazard. Unless the player collects enough K power-ups beforehand, the missiles and laser shots will be lost to minimum power when the player loses a life.\r\n\r\nThere are seven stages in the game, with the last one consisting of a single boss battle. The player has to fight through them avoiding hazards in addition. Mid-bosses very occasionally appear in the game. When the player meets a mid-boss or end stage boss, the player must destroy weak points and various parts of the boss to destroy it.",
  "banner_url": "/games/banner/alpha-mission-ii.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:28:19.817452Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 14171
}