{
  "name": "Out of the Park Baseball 18",
  "slug": "out-of-the-park-baseball-18",
  "year": 2017,
  "description": "Step into the shoes of a GM and/or field manager to own the future or rewrite the past of your favorite real-world baseball franchise. Build the team the way you want to. Start a new career with your favorite 2017 MLB team or span through almost 150 years of baseball history and run any team from the past! You can even set up your own fictional baseball universe or compete in online leagues against other OOTP players. The possibilities in OOTP 18 are endless.\r\n\r\nThe brand new 2017 MLB roster set will include all projected Opening Day MLB rosters as well as the complete minor league system down to the rookie leagues and even future draft classes. Can the Chicago Cubs repeat as World Series winners, despite the loss of Aroldis Chapman and Dexter Fowler? Or did the Cleveland Indians' successful offseason set them up for at taking the World Series trophy home this year? Will the Boston Red Sox's rotation, anchored by Chris Sale and David Price, dominate in the AL East, or are the rebuilding Yankees already a contender? Which team will win the tight National League West Division, the powerhouse LA Dodgers, led by the best pitcher in baseball, Clayton Kershaw?\r\n\r\nOn top of this, 8 international leagues (Japan, South Korea, Taiwan, Australia, Italy, The Netherlands, Mexico and Cuba) and several international and US independent leagues return to OOTP 18 with accurate and projected 2017 rosters.\r\n\r\nDive into the more hands-on management and set your team's lineups, pitching staffs, and in-game strategy. You can oversee your league at a high level, or play out each game, managing play by play or even pitch by pitch. OOTP players progress realistically over time. Build a team through the draft, or sign big free agents to put you over the top!",
  "banner_url": "/games/banner/out-of-the-park-baseball-18.jpg",
  "icon_url": "/games/icon/out-of-the-park-baseball-18.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:39.025162Z",
  "steamid": 465650,
  "gogslug": "",
  "humblestoreid": ""
}