{
  "name": "Hitman 2: Silent Assassin",
  "slug": "hitman-2-silent-assassin",
  "year": 2002,
  "platforms": [
    {
      "name": "GameCube"
    },
    {
      "name": "Sony PlayStation 2"
    },
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Stealth"
    }
  ],
  "aliases": [],
  "description": "Enter the realm of a retired assassin, forced back into action by treason. You may be a hired killer but you still have a sense of loyalty and justice. Visit the dark recesses of a world corrupted by crime, greed, degradation and dishonor. And a past that catches up with you. \r\n\r\nTrust no one - if the price is right, the finger of your most trusted ally will be on the trigger. Your targets may hide in the most remote areas of the planet, but their destruction is never prevented - only postponed.\r\n\r\nLearn your trade - master your tools - overcome your obstacles - outsmart your enemies - eliminate your targets. Remember: rash decisions bleed consequences. Know when to strike instantly, know when to take your time. Chance favors the prepared. Failure is not an option.\r\n\r\n* Pick up contracts in exotic locations around the globe: Sicily, St. Petersburg, Japan, Malaysia, and India.\r\n* Operate in a non-linear world where the outcome of your actions and proficiency as a hitman are measured on a balance between stealth and aggression.\r\n* Stalk and eliminate your targets up close and personal, in either 1st or 3rd person perspectives.\r\n* Execute your assignments with a diverse arsenal of equipment, from armor-piercing sniper rifles and explosives to chloroform and poison darts.\r\n* Acquire and carry weapons and tools from mission to mission through an enhanced inventory and save-game system.\r\n* Original soundtrack composed by Jesper Kyd and performed by The Budapest Symphony Orchestra.",
  "banner_url": "/games/banner/hitman-2-silent-assassin.jpg",
  "icon_url": "/games/icon/hitman-2-silent-assassin.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:51.048258Z",
  "steamid": 6850,
  "gogslug": "hitman_2_silent_assassin",
  "humblestoreid": ""
}