{
  "name": "Redneck Rampage Collection",
  "slug": "redneck-rampage-collection",
  "year": 1997,
  "description": "A week from a Redneck's life:\r\nDeer Diary:\r\nMunday: Well, we crash-landed that UFO in the desert and Bubba says he wants to go home. Heck, I don't blame him 'cause there ain't no place like Hickston. But according to my map, we're gonna have to blast our way through jack o' lope farms and a riverboat as well as a brothel (Bubba can't wait) 'fore we get home again.\r\nToosday: Met new folks like Daisy Mae (she's purty). Bikers, pigs, cows and jack o' lopes. I think I even saw the King at the Slurp n' Burp.\r\nWinsday: Yeehaw! Got to joyride in a Swamp Buggy and a motorcycle that were both armed to the teeth. I hope those peoples I ran over will be alrite. I still got a darn jack 'o lope stuck in the grill though.\r\nThersday: New ways to destroy stuff! I found over 10 weapons like a crossbow that shoots dynamite-loaded chickens and a slingblade. Mmmm-Hmm! \r\nFri-day: Sure am hungry! I just need some good ol' redneck powerups like pork rinds, cow pies and some of my granpappy's moonshine! \r\nSaterday: Boy I sure so like those toe tapping tunes by that good ol' boy Mojo Nixon. \r\nSunday: Heck! With all the new places we been, I sure wish my kinfolk could've come along for the ride!\r\nWant to experience more than just a week? Then take a dip into the Redneck's world of floating whiskey and widespread pork rinds. The crazy adventure continues through Redneck Rampage, Redneck Rampage Rides Again: Arkansas and Redneck Rampage: Suckin' Grits on Route 66. Now all three games bundled together.\r\nBut wait, there's more! For those curious about the Redneck language you can download and install \"Cuss Pack\" add-on (follow the readme.txt file for instructions).\r\n\r\nIncludes Redneck Rampage, Redneck Rampage Rides Again: Arkansas and Redneck Rampage: Suckin' Grits on Route 66\r\nHeal your wounds with alcohol and battle aliens redneck-style!\r\nVisit famous sites like Area 51 or Route 66 and kill those damn aliens",
  "banner_url": "/games/banner/redneck-rampage-collection.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-05-31T00:17:53.611055Z",
  "steamid": null,
  "gogslug": "redneck_rampage_collection",
  "humblestoreid": "",
  "id": 5857
}