{
  "name": "Mythgard",
  "slug": "mythgard",
  "year": 2019,
  "description": "Strategic Choice\r\n\r\nMythgard is a collectible card game of boundless depth and infinite strategy. Experience a unique game with fast and fluid tactical action. Use spells, minions, enchantments, and artifacts to vanquish your opponents. Every play could mark the difference between victory and defeat. Your deck is not restricted to a single class or faction, opening a world of limitless possibility.\r\n\r\nA World of Myth Made Real\r\n\r\nGods of ancient legend walk the modern world in Mythgard. Many of the greatest deities have not been seen in millenia, but creatures of myth still rival jets for control of the skies. Mortals now rise to contest with these ancient beings. In Mythgard, players harness both the edge of technology and the magic of myth as they battle for dominance over the powers of an earlier age.\r\n\r\nA Battlefield Like No Other\r\n\r\nPlace your minions and enchantments strategically on Mythgard’s unique battle board. Create mighty artifacts that alter the fundamental rules of the game. Cast powerful spells to open gaps in your adversary's defenses and charge as the tide of battle shifts in your favor.\r\n\r\nFree Means Free\r\n\r\nEvery card can be earned through play, and you can build your collection in any way you choose! A variety of PvE modes provide daily rewards, while an equal variety of PvP modes let you test your skill against the ultimate opponent - other players!\r\n\r\nSingle Player Campaign\r\n\r\nExplore the world of Mythgard in an extensive single-player campaign. Use the cards you earn to learn the game play, build your skills, and hone your strategy. The campaign lets you study the characteristics of each color faction, jump start your card collection, and most importantly - enjoy your Mythgard adventure.",
  "banner_url": "/games/banner/mythgard.jpg",
  "icon_url": "/games/icon/mythgard.png",
  "is_public": true,
  "updated": "2019-10-29T00:43:40.800527Z",
  "steamid": 839910,
  "gogslug": "",
  "humblestoreid": ""
}