{
  "name": "Castlevania: Order of Ecclesia",
  "slug": "castlevania-order-of-ecclesia",
  "year": 2008,
  "platforms": [
    {
      "name": "Nintendo DS"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "Platform"
    }
  ],
  "aliases": [],
  "description": "Castlevania: Order of Ecclesia takes place after Castlevania: Symphony of the Night, sometime in the 1800s, right after the era of Richter Belmont. As the Belmont Clan had vanished by that time, several organizations are created in order to research countermeasures against Dracula and his eventual return. Among these organizations, the most promising was the Order of Ecclesia, who created a triad of magical glyphs based on Dracula's power, named \"Dominus.\" Shanoa is a member chosen by the order's leader, Barlowe, as the human vessel for Dominus. As the ritual begins, the Dominus glyphs (Anger, Hatred, Agony) are stolen by Shanoa's colleague Albus, and Shanoa loses her memories and emotions. She goes to retrieve them, unaware of his true intentions.\r\n\r\nIn her pursuit, Shanoa arrives in the deserted Wygol Village and finds out that Albus kidnapped its inhabitants, brought them to different hidden locations, and imprisoned them. As Shanoa rescues them throughout the game, she learns that Albus captured them to perform some kind of experiment on them which involved taking samples of their blood. On two occasions, Shanoa tracks down Albus, who willingly gives her two of the Dominus glyphs. When she finds him to be possessed by the power of the third glyph, she is forced to fight him. After killing Albus, his mind and soul are absorbed by Shanoa together with the last Dominus glyph. Albus explains that his true intentions were to find a way to defeat Dracula without Shanoa using Dominus, as he knew that it would kill her if she used it. Her lost memories and emotions were actually taken by Dominus, and not Albus, as Barlowe had told Shanoa. He also reveals that the reason he experimented on the villagers was because they were the last descendants of the Belmont Clan, and he believed their blood would have the power to help him control Dominus without it consuming him.\r\n\r\nConfronting Barlowe after learning the truth, Shanoa learns that his true objective is to bring Dracula back to life, using Shanoa as a sacrifice. After Barlowe is defeated in a fight, he offers his own life to revive Dracula, and Dracula's castle appears. Eventually confronting Dracula, Shanoa successfully defeats him using Dominus, seemingly at the cost of her own life. However, Albus appears and reveals that only a single soul has to be offered. He sacrifices his own soul in Shanoa's place, but not before he restores her memories and emotions and asks her to smile for him. The castle crumbles, and Shanoa escapes.",
  "banner_url": "/games/banner/castlevania-order-of-ecclesia.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:47.876656Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}