{
  "name": "Cooking Mama",
  "slug": "cooking-mama",
  "year": 2006,
  "platforms": [
    {
      "name": "Nintendo DS"
    }
  ],
  "genres": [
    {
      "name": "Puzzle"
    }
  ],
  "aliases": [],
  "description": "Cooking Mama (クッキング ママ Kukkingu Mama) is a cookery simulation-styled minigame compilation video game for the Nintendo DS and iOS platforms, developed by Office Create and published by Taito, Majesco Entertainment, and 505 Games. It was awarded IGN's \"Best Of E3\" award for 2006. It was followed by a sequel for the DS, Cooking Mama 2: Dinner with Friends. Two games have been made for the Wii: Cooking Mama: Cook Off and Cooking Mama: World Kitchen.\r\nn Cooking Mama, the player is tasked with cooking various meals using the device's touch screen. Following the instructions of the titular \"Mama\", the player uses the stylus or their finger to perform different kitchen tasks, including chopping vegetables, slicing meat, flipping food in pans, and arranging the final items on the plate. The version of the game for iOS also takes advantage of the accelerometer in its devices with some similar gameplay to Cooking Mama: Cook Off. Each of these tasks is performed by completing a mini-game which usually lasts less than 10 seconds. The gameplay structure consists of the player progressing through a series of short minigames. The game features a total of 96 different dishes.\r\n\r\nEach minigame represents a different activity in the meal preparation, such as mixing, frying, or chopping the provided ingredients. The minigame mechanics themselves range from quickly drawing parallel lines in order to chop items, to a rhythm game where ingredients are added to a skillet or the heat is adjusted at precisely the right time. In many cases, players must look at the top screen of the DS for guidance on what to do next and then perform the task on the bottom screen. If the player makes a serious blunder or time expires without sufficient progress being made, that step in the cooking process is considered a failure. When this happens, a graphic of an angry \"Mama\" with flames erupting from her eyes is displayed, along with the caption \"Don't worry, Mama will fix it!\".\r\n\r\nCompleting a dish can require playing one minigame, or as many as a dozen. The player's performance is rated when each dish is finished, based on the average result of each minigame. Depending on the final score, the game may award the player a bronze, silver or gold medal. The highest medal earned for each dish is recorded and displayed next to each item on the selection screen.",
  "banner_url": "/games/banner/cooking-mama.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:58.007571Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}