{
  "name": "NinNinDays",
  "slug": "ninnindays",
  "year": 2019,
  "description": "※All characters involved in sexual content are over the age of 18.\r\n\r\nSTORY\r\n\"Known only as \"\"Ninja\"\", these mysterious mercenaries have worked in the shadows of history from ages past.Dealing in espionage, secrect plots and assassination, the ninja brought prosperity to Daimyo and Fuedal lords from the shadows.\r\n\r\nPresent day---\r\nIn the village of their ancestors, ninja continue to leave for training, as is tradition. However, due to lack of requests for work, the village has become nothing but a small gathering of houses in the mountains.\r\n\r\nIt is from this village that Sumire was commanded to leave, with orders to train in the city by her father, the village chief.\r\n\r\nHowever, lacking food and money, she collapses on the side of the road.\r\nSaved by the main character, she is determined to repay her debt to him and suddenly becomes an univited guest as his house...\"\r\n\r\nCHARACTER\r\nSUMIRE\r\nCV: Mikan Nonaka\r\n\r\nHeight: 158cm\r\nWeight: 42kg\r\nBust/Waist/Hip measurements: 86D/59/87\r\n\r\nThe only daughter of the Ninja Village chief.\r\nAlready has the sufficient qualities, ability and knowledge of a ninja, but is a natural clutz and always making mistakes.\r\n\r\nOrdered to train by her father, she has left the ninja village hidden in the mountains and left for the city.\r\nLeaving the mountains without any food or a coin in her pocket, she passes out from hunger.\r\nThere she is saved by the main character who happened to pass by.\r\nIn order to repay the debt of saving her life, she barges into the main character's house as an univited guest.\r\n\r\nLoves to eat and is always pigging out!\r\n\r\nFEATURE\r\n・Smooth character animation via the E-mote system\r\n・Different routes and ED\r\n・High quality event CG\r\n・Story set in an actual Japanese town\r\n\r\nSTAFF\r\n・Illustration :AkasaAi　(Twitter) https://twitter.com/AkasaAi\r\n・Scenario :Kashima Natsuki（Linkedbrain Inc.）\r\n・Producer/Planner :Yujiro Usuda (Twitter) https://twitter.com/yujiro_usd",
  "banner_url": "/games/banner/ninnindays.jpg",
  "icon_url": "/games/icon/ninnindays.png",
  "is_public": true,
  "updated": "2020-05-27T13:53:23.474152Z",
  "steamid": 1075980,
  "gogslug": "",
  "humblestoreid": "",
  "id": 36590
}