{
  "name": "Neverwinter Nights",
  "slug": "neverwinter-nights",
  "year": 2002,
  "description": "Neverwinter Nights (NWN) is a computer game set in a huge medieval fantasy world of Dungeons and Dragons. This role-playing game (RPG) puts you at the center of an epic tale of faith, war, and betrayal.\r\n\r\nAs a player, you are able to choose what skills and abilities you will develop as you voyage though the complex and dangerous fantasy world of Forgotten Realms. Be a deadly and dangerous Rogue moving through the shadows using stealth and secrecy, be a scholarly Wizard and wield powerful magic against your enemies, be a hulking Barbarian whose lust for battle is matched only by his terrible rage, be an armor-clad Paladin who protects the innocent and vanquishes his foes, be a crusading Cleric who heals the sick and defends the helpless… be all this and more.\r\n\r\nNeverwinter Nights allows you to create your own worlds. This revolutionary game will come with all the tools needed to construct your own unique lands of adventure. The Neverwinter Nights Aurora Toolset allows even novice users to construct everything from a quiet, misty forest or a dripping cavern of foul evil, to a king’s court. All the monsters, items, set pieces and settings are there for world builders to use. But do not stop there; construct traps, encounters, custom monsters and magic items to make your adventure unique.\r\n\r\nBut the Neverwinter experience is not just for one person- adventure with all your friends. Neverwinter Nights can be played online with up to 64 friends, all sharing in the adventure. You can organize and run your own adventures through the role of the Dungeon Master and control all the monsters, creatures and characters your friends meet as they journey on their quest. A powerful piece of software that is included with Neverwinter Nights, the DM Client, allows nearly unlimited control for running your own adventures for your friends.\r\n\r\nNeverwinter Nights…endless adventure!",
  "banner_url": "/games/banner/neverwinter-nights.jpg",
  "icon_url": "/games/icon/neverwinter-nights.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:50.098278Z",
  "steamid": null,
  "gogslug": "neverwinter_nights_diamond_edition",
  "humblestoreid": "",
  "id": 4386
}