{
  "name": "Codemancer: Chapter 1",
  "slug": "codemancer-chapter-1",
  "year": 2014,
  "description": "Codemancer brings the mystery of magic and the exhilaration of learning to code together in a fantasy universe that uses spell casting as a way to teach and learn programming skills. Codemancer’s fantasy universe is filled with rival sorcerers and their minions for players to encounter along their journey. Codemancer is a non-violent, entertaining, and educational game designed to be inclusive and accessible to learners at any stage. Features include a gender-neutral fantasy setting with a female protagonist, a narrative backbone, and a programming interface that’s designed to be easy to understand by kids with varying degrees of skill and experience. Codemancer breaks down barriers that may have discouraged some kids from embracing technology and elevates their screentime to be more productive and entertaining.  It isn’t a typical coding or technology game.\r\n\r\nWHAT IS CODEMANCER ALL ABOUT?   \r\n\r\nCodemancer tells a moving story about Aurora, a young, creatively talented girl who’s trying to grow up, become independent, and do good in the world in the face of incredible obstacles when her father is suddenly kidnapped. Aurora has to embark on an adventure to save him as she grows into a gracious and independent young woman. She must learn magic spells to save her father, but the magic used in Aurora’s world works the same as programming does in ours. Inspire children to explore their potential as they discover the magic of coding.\r\n\r\nCODEMANCER IS AN EDUCATIONAL GAMING ADVENTURE:   \r\n\r\nCodemancer is designed for 6 to 12 year olds as an educational game that teaches the magic behind coding—and can be fun for grownups, too!",
  "banner_url": "/games/banner/codemancer-chapter-1.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-08-29T22:39:00.795151Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 37695
}