{
  "name": "Red Faction: Armageddon",
  "slug": "red-faction-armageddon",
  "year": 2011,
  "description": "Red Faction: Armageddon is set 50 years after the happenings of Red Faction: Guerrilla and is also set on Mars. The player takes the role of Darius Mason, a well-meaning guy who only wants the best for his people. Unfortunately it is not only his fault that a terrorist could destroy the machine which brings a human-friendly atmosphere to the planet, meaning the humans had to retract in the underground, he also mistakenly unleashes an hostile alien race. Because the surviving humans are not too pleased with his achievements, it is now time to go out into the tunnels and set things right!\r\n\r\nA big change to its predecessor is the lack of an open world; Armageddon is a linear third-person shooter. The majority of the game is just that: walking through the levels and killing alien masses or human cultists with a mix between conventional and science fiction weapons. Sometimes there are boss battles and vehicle sequences, e.g. inside a mech. In the levels there are valuable pieces of scrap to find which can be traded against character or weapon upgrades. What carries over from the predecessors is the destructible terrain which also can be used towards enemy disposal. Of course this means that Darius could destroy his way to the exit - but fortunately he has a handy device which allows him to repair his environment. \r\n\r\nBesides the campaign there are two additional playing modes. The point of the destruction mode is to gain as many points as possible in a limited time frame. Points are earned by destroying the environment. Designed for cooperative play for up to four players is the second mode which basically consists of fighting enemy waves.",
  "banner_url": "/games/banner/red-faction-armageddon.jpg",
  "icon_url": "/games/icon/red-faction-armageddon.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:53.568122Z",
  "steamid": 55110,
  "gogslug": "red_faction_armageddon",
  "humblestoreid": "",
  "id": 310
}