{
  "name": "Memoirs of Magic",
  "slug": "memoirs-of-magic",
  "year": 2019,
  "description": "Once upon a time, there existed a magical world, where magic, monsters and many mystical and magical creatures existed. This world was called the World of Magic, which was ruled by the Essay Royal Family, who brought much peace and prosperity to this land. However...\r\n\r\nThis peace was disturbed by the stirrings of a new, mysterious entity. With it, it brought evil monsters created in its own image to the World of magic, threatening the very existence of the Realm.\r\n\r\nWith the arrival of these monsters, the 5 Elemental Hearts of Earth, Fire, Water, Air and Balance; the very life source of this world, have been taken from their long known resting places, thus causing havoc across the World of Magic.\r\n\r\nDue to this, the King, King Essay, called forth any brave adventurers to partake in this quest to retrieve the stolen elemental hearts and stop this new evil that has been plaguing the lands. Seven adventurers, all of whom have different reasons to partake in this quest, be it for fame, glory, honor or justice, stepped forth to heed his call. And with this, our adventurers embark in our latest chapter in the Memoirs of Magic...\"\r\nFeatures\r\n\r\n    Select One of Seven classes, Each one with their own special skills and exclusive signature weapons that allow them to tackle the adventure in their own unique way!\r\n\r\n    Wield and upgrade 15 Weapons utilizing the abundant gold loot you will collect on your adventures, using such weapons as Magic Tomes and Alchemic Fire Arms!\r\n\r\n    Explore the Large world of the Realm of Magic in over 40 Maps, with many hours of game play!\r\n\r\n    Fight many unique Enemy Types including over 12 Giant and Powerful Bosses!\r\n\r\n    Summon 6 Powerful Dragons to aid you in Battle!\r\n\r\n    Authentic Midi Soundtrack that will immerse you in the classic feel of the Adventure!\r\n\r\n    Meet many NPC's and Complete Quests along your adventure in saving the Realm of Magic!\r\n\r\n    Experience the Adventure with your Friends, and save the Realm of Magic from the Evil Entity with your Party! \r\n\r\nMemoirs of Magic is a Free to Play Action Adventure, FPS, Role Playing Game inspired by classic games of the DOS/N64/PS1 era!",
  "banner_url": "/games/banner/memoirs-of-magic.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-05-19T13:13:49.792282Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 27230
}