{
  "name": "Goldfinger 64",
  "slug": "goldfinger-64",
  "year": 2017,
  "description": "After two long decades, British secret agent James Bond makes his triumphant return to the Nintendo 64! His mission; to gather intelligence on a wealthy entrepeneur named Auric Goldfinger. The investigation will take 007 around the globe and back again, in twenty brand new levels that faithfully recreate the film, as well as previous entries into the series as bonus material. Tour the famous Fontainebleau Hotel in Miami, drive through the Alps in a classic Aston Martin, sneak inside a shady export company compound in Mexico, and shoot your way into the gold rich vaults of Fort Knox using a vast arsenal of weaponry. Mow down the enemy like a true gangster with the Thompson machine gun, use stealth at a distance with the AR-7 sniper rifle, or ramp up the fire power with a devastating RPG launcher. And once you've foiled Goldfinger's plans to dominate the world's bullion market, sharpen your skills against friends (or foes!) in multiplayer mode. With eleven maps to compete in, a wide range of weapon loadouts, and a comprehensive character roster to choose from, you'll soon be finding yourself crammed back on the couch again in split-screen fever. A completely original musical score accompanies every stage, and due to the inclusion of the Expansion Pak, are lengthier than previously possible. This memory expanding device allows Goldfinger 64 to go farther than the original game it was built upon. A greater amount of image textures can be loaded into a level at one time, mission setups filled with even more content, and maps larger than ever before. This fan-made sequel to GoldenEye 007 aims to bring players an exciting experience, while representing perhaps the most beloved Bond film of all time with much due respect. So if you think you're up to the task of putting an end to Operation Grand Slam, grab your controller and pull up a chair. It's about time Bond was back on the job.",
  "banner_url": "/games/banner/goldfinger-64.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:29:41.305271Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 14770
}