{
  "name": "Gothic II",
  "slug": "gothic-ii",
  "year": 2003,
  "description": "When you're in need of something and don't know where to find it, go to Khorinis. There you can surely buy it. -- Saying (author unknown)\r\n\r\nThe mine valley of Khorinis. The glorious days of the once productive mines in this small seaside region were long over. Surrounded by the impenetrable magical barrier, the slaves eked out their miserable existence in this apparently natural prison.\r\n\r\nOne brave man managed to burst the bonds of imprisonment. Following his own call to freedom, he ventured deep into the subterranean temples. Willing to do whatever was necessary, he went out to banish Evil and destroy the magical barrier forever. Spurred by the hatred of men long-suppressed, the prisoners streamed trough the only pass to freedom.\r\n\r\nNo one in Khorinis had been prepared for this. Too long had they lived under the deceptive notion of security granted by the apparently indestructible magical dome. The small militia garrison could not put up enough forces against the onrush. After numerous bloody clashes, many captives escaped and found safety in the woods or rugged mountains of the surrounding countryside.\r\n\r\nThe steadily escalating number of raids in the vicinity of the town wall and the bandits' ever-increasing boldness seemed to paralyze the whole town. Angered by the militia's inability to protect their farms, some of the farmers formed an alliance with the refugees, no longer willing to pay allegiance to the king.\r\n\r\nKhorinis is facing an uncertain future. Due to the farmers' decreasing production, more and more of the food deliveries do not take place, and the stocks diminish continuously. The militia's might ends at the town gate. Outside the town wall, nobody is safe from the bandits' armed raids.\r\n\r\nThere is war in Khorinis. A civil war.\r\n\r\nBut there is something else that could not be foreseen. Evil is not dead, rearing its ugly head again. But this time it is set on delivering the deathblow to humanity, and no one can stop it.\r\n\r\nNo one?",
  "banner_url": "/games/banner/gothic-ii.jpg",
  "icon_url": "",
  "is_public": false,
  "updated": "2020-05-31T00:17:43.784273Z",
  "provider_games": [
    {
      "name": "Gothic 2 Gold Edition",
      "slug": "1207658718",
      "service": "gog"
    }
  ],
  "steamid": 39510,
  "gogid": 1207658718,
  "gogslug": "gothic_2_gold_edition",
  "humblestoreid": "",
  "id": 13966
}