{
  "name": "Final Fantasy: The 4 Heroes of Light",
  "slug": "final-fantasy-the-4-heroes-of-light",
  "year": 2010,
  "platforms": [
    {
      "name": "Nintendo DS"
    }
  ],
  "genres": [
    {
      "name": "RPG"
    }
  ],
  "aliases": [],
  "description": "inal Fantasy: The 4 Heroes of Light, known in Japan as Hikari no 4 Senshi -Final Fantasy Gaiden- (光の4戦士 -ファイナルファンタジー外伝- Hikari No Yon Senshi -Fainaru Fantajī Gaiden-, lit. Four Warriors of Light -Final Fantasy Side Story-), is a role-playing video game developed by Matrix Software and published by Square Enix for the Nintendo DS. It is a spin-off of the Final Fantasy series and was released by Square Enix in Japan in Fall 2009.[1] The game was then released in North America and Europe in October 2010.\r\n\r\nThe game tells the story of four youths who journey around their world to free their home from a terrible curse.[2] A sequel to the game was considered by the development team, and eventually evolved into the 2012 game Bravely Default.\r\nIn the city of Horne, a 14-year-old boy named Brandt must present himself to the king as a custom of entering manhood. Upon arriving, Brandt finds the King distraught and is told to go find Princess Aire and save her from the Witch of the North, Louhi. On the way, Brandt is joined by his friend Jusqua and the princess's bodyguard Yunita, who help him rescue Princess Aire and slay Louhi. However, when they return to town, everyone's been turned to stone by the witch's curse and the king is nowhere to be found.\r\n\r\nWhile Brandt and Yunita attempt to restore Horne's people, Jusqua prefers to flee and takes Aire to the city of Liberte. Brandt and Yunita meet a man named Krinjh in the desert, who helps them find the Merkmal to find Guera, the kingdom of magic. King Guera asks them to slay the Sand Demon, who is actually a girl named Araidne who Krinjh disappears with. Aire meets a fairy named Lilibelle who reveals a hidden treasure in Liberte, which transforms Aire into a cat. Leaving Jusqua, Aire finds Brandt, who's left Yunita, as the two head to Arbor forest. Due to the Queen's distrust of humans, Brandt is turned into a plant, forcing Aire, with the help of a mouse named Torte, to obtain an Animal Staff, which turns him into a dog.\r\n\r\nArbaroc, Guardian of Arbor forces the party to defeat him in combat. The Queen of Arbor thanks them by making the Animal Staff into the Transformation Staff so they can regain their forms while telling them that Rolan of the floating island of Spelvia may know the way to solve their problem. However, only Aire makes it across while Brandt plummets back into Arbor. Meanwhile, mistaking a normal cat for Aire, Jusqua travels to the city of Urbeth and finds both Yunita and a sorcerer who offers to lift the animal hex for 10,000 gil. Jusqua learns the sorcerer is a con artist as he escapes into the night towards Invidia, and leaves Yunita behind and pursues the sorcerer on one of the merchants' boats. He is reunited with Brandt before learning Aire was with Brandt the whole time.\r\n\r\nOnce Brandt and Jusqua arrive at Invidia, they meet a young girl named Rekoteh who assists them in getting the Dragon's Harp, allowing them to summon a dragon, which flies them to Spelvia. By that time, the island is over Urbeth and Yunita chooses to climb up the Tower to the Sky in order to reach it. She soon meets Aire as the two arrive into town, finding its ruler, Rolan, locked away in solitude with his bitterness towards humans influencing the Golems to attack any human. As a result, Yunita and Aire travel into Rolan's subconscious with the help of the Witch of the Sky. They destroy the monsters that are controlling Rolan but this causes him to unleash the darkness locked away inside him and warp reality itself by the time the girls are reunited with Brandt and Jusqua, sending them all several years into the past. As a result, the 4 children must embark on an epic quest to find the Weapons of Light to save not only their home of Horne, but even the world from the Dark Lord that the ancient hero Rolan (whom their Rolan is named after) had sealed.\r\n\r\nIn Guera's past, Krinjh is a servant to the previous king. This king is actually Asmodeus, demon of lust, in disguise and uses Krinjh to earn the trust of Ariadne and get a seedling from Arbor to become all-powerful and then attempts to break them apart. Yunita prevents this by using the Merkmal to reveal Asmodeus and the groups defeats him. In return, Krinjh gives them the Shield of Light. Krinjh becomes king and creates diplomatic relations between Geura and Arbor. In Liberte's past, an artist, Pione, is attempting to create the most beautiful piece of art and incorporates Lillibelle into it. However, a group of pirate's steal the work and Aire wants to do everything it takes to stop them. It turns out the entire pirate crew was being possessed and after freeing them, the group awakens Cetus, the ancient whale and uses him to help defeat Leviathan, demon of envy.\r\n\r\nIn Urbeth's past, a plague ravages the city and the only cure costs absurd amounts which leads to Urbeth to go from a city of faith to a city of commerce. Town leader Thauzand's daughter is unfortunately one of the victims. However, Jusqua is determined to prevent this and finds a vial of the cure. It is revealed that the apothecary in town is causing the plague and selling the overpriced medicine. The group reveals him to be Beelzebub, demon of gluttony, and defeats him. In return, Thauzand gives the group the Cape of Light and Urbeth becomes a town of the perfect balance of faith and commerce. In Arbor's past, Torte, as a human, releases Belphegor, demon of sloth, in trying to obtain the spell Lux. As punishment, he is turned into a mouse and it is decided that no humans would be allowed in Arbor. In the meantime, Belphegor is trying to possess Arbaroc and destroy Arbor. In the original history, he succeeds in the possession, but thanks to the intervention of Torte and the group, he is defeated instead and the group is rewarded with the legendary white magic Lux.\r\n\r\nIn Invidia's past, there is a winter that threatens to destroy the town. In response, Rekoteh's father, who expects her to be as strong as her brother, Rolan, despite being much younger, asks her to retrieve the Dragon's Mark which Brandt decides to go get for her. They give it to her and when she shows it to her father, he asks the group to take it and stop whatever is going on at the Sun Temple. The group arrives and defeats Mammon, demon of greed. Upon their return, Invidia is finally hit with spring, and Rekoteh's father apologizes to his daughter and gives the group the Armor of Light. In Spelvia's past, the group arrives just before it's too late to save Rolan from the darkness. They delve into his soul again and defeat Lucifer, demon of pride, freeing Rolan's soul from darkness and giving him the confidence he needs to be a hero. He gives them the Sword of Light.\r\n\r\nIn Horne's past, a drought has caused the popular vote to go towards asking Louhi for help. Beneath the castle, despite this being the date of Aire's birth, the king is contacting Louhi for help. In exchange for Aire, Louhi agrees to break the seal on the legendary black magic. It's the group's eventual defiance of this deal by saving Aire and killing the witch that causes the curse. The group is appalled that their king would do such a thing and travels to Louhi's mansion. There, Rolan shows up and tells Louhi to break her agreement with the king and advises the group to get the Lamp of Truth. With the lamp, they reveal the king to actually be Satan, demon of wrath, and defeat him. Brandt's parrot shows up and uses the Lamp of Truth to turn into the real king. It should be noted, that in the beginning of the game, they were actually tricked into serving Satan meaning they were actually on the side of evil since Louhi also works for Rolan. This also implies that Satan was planning to betray Louhi and violate the contract for a long time. In thanks, the king gives the group the legendary black magic Desolator.\r\n\r\nAt this time, the Dark World opens and with the help of Cetus, the group enters, and defeats Asmodeus, Leviathan, Beelzebub, Belphegor, Mammon, Lucifer, and Satan again and then faces off against Chaos, the Dark Lord. In the final fight after the crystal (which has granted them numerous powers throughout the game) appears to heal the group, Chaos destroys it and still manages to lose to the group despite them losing their major source of power. The group then travels the world returning all seven of their recently obtained items. Now that the world is returned to normal, everyone remembers them and all they have done for them.",
  "banner_url": "/games/banner/final-fantasy-the-4-heroes-of-light.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:30.816484Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}