{
  "name": "Insurgency",
  "slug": "insurgency",
  "year": 2014,
  "description": "Take to the streets for intense close quarters combat, where a team's survival depends upon securing crucial strongholds and destroying enemy supply in this multiplayer and cooperative Source Engine based experience. The follow-up game to the award-winning Source mod, Insurgency is highly competitive and unforgivingly lethal, striking a balance between one-life gameplay and prolonged action.\r\n\r\nFeatures:\r\n* Over 20 weapons with numerous attachments, no crosshair, and a focus on realistic weapon behavior including a free-aim system and intense suppression effects.\r\n* 27 multiplayer and cooperative maps that take place in 12 distinctive environments ranging from Iraq to Afghanistan to Somalia.\r\n* 9 multiplayer game modes supporting up to 32 players, with a focus on territorial control, destroying weapon caches and escorting high value targets.\r\n* Cooperative game modes where you and your friends team up to complete mission-based objectives.\r\n* Offline practice mode, playing with bots on all game modes.\r\n* Squad system built upon role-based player classes, which are customizable and asymmetrical based on what team you are on.\r\n* Squad-based communication system which includes 3D VOIP, allowing friendly and enemy players within proximity to hear you.\r\n* Overhead map detailing objective and teammate locations.\r\n* Accumulate supply to customize and upgrade your gear, affecting your weight, stamina, and movement speed.\r\n* Simplified HUD and UI for a clean, immersive user experience focused on the action and environments.\r\n* Highly immersive particle FX and audio to intensify the game experience.\r\n* Create custom maps and content using the Insurgency SDK and scripting system.\r\n\r\nMultiplayer Game Modes:\r\nPush --- Three territorial objectives must be captured by the attacking team in sequential order. For each objective captured, they gain more reinforcement and time to attack the next. Defenders have a finite amount of reinforcements and must use each wisely. Once the third objective is captured by the attackers, a fourth cache objective must be destroyed, while the defenders have only one life to make a last stand.\r\n\r\nFirefight --- Three territorial objectives, one for each team, plus one neutral. Each team only respawns when they secure an objective. Secure all objectives or eliminate all enemy to win. Every life counts, making this a very suspenseful experience dependent upon teamwork.\r\n\r\nSkirmish --- In addition to three territorial objectives, each team has a supply cache to protect. Teams gain extra reinforcement waves until their cache is destroyed. When both teams have lost their caches and all reinforcement waves, it becomes a Firefight match.\r\n\r\nOccupy --- There is one central territorial objective in the area. The team that controls it does not deplete reinforcement waves. This gameplay in this mode is reminiscent to King of the Hill or \"tug of war\".\r\n\r\nAmbush --- A high value target (\"HVT\") must be escorted to an extraction point. It's one team's goal to make this happen and it's the other team's goal to stop this from happening at all costs. The HVT is only armed with a silenced pistol, but can pick up a weapon from a fallen enemy or teammate.\r\n\r\nStrike --- In this attack and defend mode a weapon cache must be discovered and destroyed. There are three potential locations for the cache that the attacking team must get eyes on. The defending team must set up a strong defense, and perhaps even make use of a diversion to fool the attacking team into thinking the cache is somewhere that it's not.\r\n\r\nInfiltrate --- The standard Capture the Flag mode, but with a twist. Your team's goal is to take the enemy's intel and return it to your base. Your team will only gain reinforcements when someone takes the enemy's intel, or when an enemy stealing your team's intel is neutralized. This mode requires very strong team coordination and strategy.\r\n\r\nFlashpoint --- One neutral territorial objective and two caches on each side. The goal is to secure the entire area, controlling the middle and destroying the enemy's caches. Your team respawns when they secure the territorial objective or destroy a cache objective.\r\nCooperative Game Modes\r\nCheckpoint --- Complete mission-based objectives in sequence against AI enemy. Each successful objective will respawn anyone who was eliminated along the way.\r\n\r\nHunt --- Insurgents are dispersed in the environment, and your squad must eliminate all targets while locating and destroying the weapons cache. High on tension, with only one-life.",
  "banner_url": "/games/banner/insurgency.jpg",
  "icon_url": "/games/icon/insurgency.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:57.497822Z",
  "steamid": 222880,
  "gogslug": "",
  "humblestoreid": "",
  "id": 1864
}