{
  "name": "Friday the 13th: The Game",
  "slug": "friday-the-13th-the-game",
  "year": 2017,
  "description": "Gameplay\r\n\r\nFriday the 13th: The Game is a third-person horror, survival game where players take on the role of a teen counselor, or for the first time ever, Jason Voorhees. You and six other unlucky souls will do everything possible to escape and survive while the most well-known killer in the world tracks you down and brutally slaughters you. Friday the 13th: The Game will strive to give every single player the tools to survive, escape or even try to take down the man who cannot be killed. Each and every gameplay session will give you an entirely new chance to prove if you have what it takes not only to survive, but to best the most prolific killer in cinema history, a slasher with more kills than any of his rivals!\r\n\r\nMeanwhile, Jason will be given an array of abilities to track, hunt and kill his prey. Stalk from the shadows, scare your targets and kill them when the time is right in as brutal a fashion as you can imagine. Take control of the legendary killer that is Jason Voorhees and terrify those unfortunate enough to cross your path!\r\n\r\nPlay as Jason Voorhees!\r\n\r\nFor the first time ever, you will have the opportunity to play as Jason Voorhees, the most famous killer in horror. Stalk your prey, ambush them whenever you see fit and strike fear in the hearts of so many hapless victims as you become the legend himself! Friday the 13th: The Game will include a variety of kills, new and familiar, that will help you set the tone for the Jason Voorhees that you want to be. You’ll even get to unlock various Jason incarnations from the movies!\r\n\r\nJason will be equipped with a terrifying array of abilities, giving you the control of a hunter at the height of his game. These are his woods, and he knows them all too well. Jason will not only feed off the fear of his victims, but will become stronger as the night progresses. The darker the night, the more terrifying Jason becomes!\r\n\r\nFans of the movies will be able to play as various versions of Jason, including:\r\n\r\n    Friday the 13th, Part II\r\n    Friday the 13th, Part III\r\n    Friday the 13th, Part VI: Jason Lives\r\n    Friday the 13th, Part VII: New Blood\r\n    Friday the 13th, Part VIII: Jason Takes Manhattan\r\n    Jason Goes to Hell: The Final Friday\r\n\r\n\r\nHow Will You Survive?\r\n\r\nThe entire focus of Friday the 13th: The Game is multiplayer. Survival is entirely up to you, the player, as you either stealthily hide from Jason or work together as a team to escape or bring the fight to Jason. Playing as a counselor is all about risk and reward, giving players multiple means of triumph over Jason! Want to hide in the woods as you wait for the police? Perhaps you want to band together and try to take on Jason as a group? Maybe you and a friend decide to fix the boat on the lake and escape while leaving everyone else to their fate? There are endless opportunities to survive the night, but every choice has a consequence.\r\n\r\nFriday the 13th: The Game will continually set the pace of change, giving you unfamiliar surroundings while Jason Voorhees looks for his latest victim. No single strategy will ever be reliable, forcing players to adapt and change each time they begin their long night in Camp Blood! Be wary, you never know when or where Jason is going to strike!\r\n\r\nPlay as the Counselors!\r\n\r\nWe all remember the various tropes from Friday the 13th, and the game will be no exception! Each counselor type will have strengths and weaknesses, affording players the chance to excel in certain situations. Find the counselor that best suits your play style, or come up with various strategies to win against Jason! Players will have the chance to continually update and improve their characters through unlocks, customization and improvement! The more you play, the more you adapt and become a better all-around counselor!\r\n\r\nCamp Crystal Lake in All Its Glory!\r\n\r\nMirroring Camp Crystal Lake from the Friday the 13th series, players will try to survive not only in the iconic Camp Crystal Lake, but surrounding area. Iconic locations from the movies, like Higgins Haven will also serve as stalking grounds for Jason and his prey.\r\n\r\nPlayers will be given a large, open area in which to explore as they attempt to hide from certain death! Each gameplay session will fundamentally change the scenario, never affording players the opportunity to learn patterns or figure out where helpful items may be lying. With each movie giving a different feeling to the campgrounds, Friday the 13th: The Game gives you new and challenging situations every time you enter the woods!\r\n\r\nYour Crystal Lake Database\r\n\r\nFriday the 13th: The Game will feature a progressive unlock system unified to your account. The longer you play, the more you'll unlock from counselor customization to new Jason Voorhees costumes seen in the movies! Besides giving you personalized camp counselors, you'll be able to unlock secrets within Camp Crystal Lake, exploring the mystery surrounding Jason Voorhees and the grounds he patrols!\r\n\r\nBe Kind. Rewind.\r\n\r\nEvery aspect of Friday the 13th: The Game\r\nis drawn straight from movies you know and love. We’ve carefully crafted this world to remind you of\r\neverything you remember about Friday the 13th, right down to the visual fidelity of the 80’s. This is exactly how you remember it.",
  "banner_url": "/games/banner/friday-the-13th-the-game.jpg",
  "icon_url": "/games/icon/friday-the-13th-the-game.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:35.435710Z",
  "steamid": 438740,
  "gogslug": "",
  "humblestoreid": ""
}