{
  "name": "Disney The Lion King",
  "slug": "disney-the-lion-king",
  "year": 1994,
  "description": "Join the lion king on his journey through 10 levels of adventure. Play bonus levels as Simba's friends. Fight hyenas and avoid wildebeests.\r\n\r\nWestwood Studios and Disney Software have joined forces in this co-production to develop a game that combines the emotional excitement of Disney's newest full-length, animated feature film with unique, original game challenges to offer a whole new video game experience.\r\n\r\nWestwood Studios developed the game which packs 24 megabits of action, animation and music into an adventure that explores the plains of Africa through two distinct phases of Simba's journey to adulthood. The first phase encompasses the life of young Simba, the cub, and his fascination with the world around him; the second phase is about Simba the lion prince on his journey back to reclaim his rightful place as king of The Pridelands.\r\n\r\nThroughout the 10 levels of the game, the player will learn new climbing, jumping and fighting techniques. Ultimately each level is a training ground for Simba's final confrontation with his evil uncle Scar. Disney animators have drawn over 2,000 frames of artwork to create an interactive experience like no other. Using an improved version of the state-of-the-art Digicel technique, Westwood Studios has packed even more Disney animation and stunning scenery into The Lion King. The experience is completed with stunning music based on the film's soundtrack, including \"The Circle of Life,\" \"Just Can't Wait to be King,\" and \"Can You Feel the Love Tonight,\" all written by pop superstar Elton John and award-winning lyricist Tim Rice.\r\n\r\nUnprecedented creative collaboration, state-of-the-art technology, a story that re-lives the movie and a fantastic soundtrack makes The Lion King a game that will roar like no game ever before!",
  "banner_url": "/games/banner/disney-the-lion-king.jpg",
  "icon_url": "/games/icon/disney-the-lion-king.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:40.176314Z",
  "steamid": null,
  "gogslug": "disney_the_lion_king",
  "humblestoreid": "",
  "id": 3636
}