{
  "name": "Honey Select Unlimited Extend + Studio Neo",
  "slug": "honey-select-unlimited-extend-studio-neo",
  "year": 2018,
  "description": "This is an expansion to Honey Select Unlimited and requires it to work properly.\r\n\r\nNew personality type, animated h-scenes, clothing options, and hairstyles!\r\n- New changeable parts and hairstyles for character creation\r\n\r\n- New clothing, hairstyles and accessories for the character creator!\r\nOver 170 new types of clothing, hairstyles, and accessories!\r\n- Improved character creation!\r\nAdditional facial texture patterns.\r\nA slew of different clothing types (kappogi, armor, and other fantasy types of outfits).\r\nAn array of new accessories (Science-fiction-ish mechanical items, wigs, wings, and an assortment of general purpose, basic items!)\r\nNew hairstyles for the front, back, and sides have also been added, all of which can be individually customized.\r\nUse the new Card Fusion feature to combine characters and create entirely new ones!\r\n\r\n- New personality types\r\n1. The graceful and mature \"Seductive\" type\r\n2. The self-assured and reliable \"Faithful\" type\r\n3. The lively and exciteable \"Energetic\" type\r\n\r\n2. - New h-scenes\r\nNew animated h-scenes!\r\nThe new h-scenes include (caressing anal vibrator insertion * bound vibrator * seated cunnilingus) (service one-handed handjob) (insertion bent over dresser) (special whipping). In addition, the following h-scenes can now be experienced on any map (insertion standing while bound * missionary while bound to the floor * hanging insertion) (special wooden pony).\r\nPassionate lesbian sex\r\nWriggling tentacle play\r\nHarem play (numerous girls)\r\nPunishment play (numerous guys)\r\nYou can use your own custom characters for lesbian and harem play as well!\r\nNew events accompany these new h-scenes!\r\nIn addition, every personality type has new event and h-scene voice acting.\r\n\r\n3. - Additional maps\r\n11 new maps to choose from!\r\n\r\n4. The types of characters that can be made is even more varied now.\r\nStudio NEO is also included with this expansion! Take meticulously crafted pictures with your favorite characters!\r\n- Cinematic features have also been enhanced\r\n(New poses can be created using the IK and FK functions.)\r\n(Characters and items, or multiple items can now be simultaneously edited.)\r\n- Undo and Redo function\r\n(Character poses and item placement can be quickly and easily controlled using the Undo and Redo functions.)\r\nLighting effects can be freely moved about for greater shadow contrast control.\r\nSound effects can also now be placed in specific parts of the map for more realistic acoustics.\r\nAll of these features are completely new to the series.\r\nStudio Neo enables you to produce scenes and take screenshots with your favorite characters with a vast degree of control!",
  "banner_url": "/games/banner/honey-select-unlimited-extend-studio-neo.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-07-01T07:32:55.353819Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}