{
  "name": "Phantasy Star Portable 2",
  "slug": "phantasy-star-portable-2",
  "year": 2009,
  "description": "Return to the Phantasy Star Portable world in a global online multiplayer experience!\r\n\r\nThe Phantasy Star series returns to the PSP® (PlayStation®Portable) system for an exciting new adventure, bringing all new content and returning the series back to its online roots. Picking up three years after the exciting Phantasy Star Universe saga, Phantasy Star Portable 2 brings the series to its conclusion as players take on the role of mercenary to save the Gurhal system. Phantasy Star Portable 2 offers a gigantic dose of original content from new combat moves, weapons and character customization options. New to the Phantasy Star Portable franchise, online play through Infrastructure mode and enhanced social interactivity adds to the adventure for fans and newcomers alike.\r\n\r\n\r\nKey Features:\r\n\r\n    Compelling multiplayer experience - Brings the franchise into the Phantasy Star Portable online space for the first time by allowing up to four player cooperative or competitive online play via infrastructure mode as we as four player multi-player mode via ad-hoc.\r\n    Advanced social interactivity - Explore new missions such as the Battle and Challenge missions made popular in the PSO series, share items, manuals, and titles among player’s characters, as well as decorate the 3D My Room with tons of customization elements.\r\n    Expanded content - The universe of Phantasy Star hugely expands from previous installments with double the amount of content in an all-new storyline with new characters, over 100 missions including Battle and Challenge missions, over 170 enemies including all-new bosses, and more than 2000 weapons and items.\r\n    Enhanced combat system - Players gain more tactical choices by executing new combat techniques and abilities in addition to the combined battle system from previous Phantasy Star Online & Universe franchises.",
  "banner_url": "/games/banner/phantasy-star-portable-2.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:43.611253Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 23379
}