{
  "name": "Mercenaries: Playground of Destruction",
  "slug": "mercenaries-playground-of-destruction",
  "year": 2005,
  "description": "During the last years of his reign, the North Korean president Choi Kim attempted a reconciliation with the country's southern neighbor, with the ultimate goal of reunification. However, his son, General Choi Song, and the military clique under his leadership, strongly disagreed with the old man's views. Eventually, Choi Song orchestrated his own father's assassination, took control of North Korea, and severed ties with the outside world. \r\n\r\nThen the Australian Navy intercepts a North Korean freighter carrying nuclear weapons intended for sale to terrorist cells. In response, China, South Korea, the Allied Nations send troops into the troubled region to topple Song's regime. The Russian Mafia also bases itself in North Korea to take advantage of the situation. A bounty of a hundred million dollars for General Song was declared. This is where the mercenaries enter the playfield.\r\n\r\nMercenaries: Playground of Destruction is a free-roaming war action and driving game with open-ended gameplay in a large world. The player can choose to control any of the three mercenary protagonists, each with their own strengths: North American Chris Jacobs can sustain higher damage; Jennifer Mui from Hong-Kong is proficient in stealth; Mattias Nilsson from Sweden can run faster than the others. Each of the mercenary also speaks different languages, which makes him or her more or less suitable for work with particular factions.\r\n\r\nPlayers have free reign of a massive landscape to take bounties on the \"Deck of 52\", a list of most wanted people in General Song's regime. Four factions have moved in to take advantage of the coup for personal gains; each faction will offer the player resources such as vehicles and supplies, as well as missions that the player can use to make money off of. If the player completes missions for a faction, they will offer intel on the locations of various bounties from the deck, although it is possible to track down the bounties without them. \r\n\r\nPlayers have a vast array of resources available to them to get the job done. It is possible to commandeer tanks, choppers and and any other military hardware to blow up the game's destructible landscape across the North Korean countryside. Helping out various factions provides access to numerous vehicle drops, supply drops, and air strikes.",
  "banner_url": "/games/banner/mercenaries-playground-of-destruction.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:21.661922Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}