{
  "name": "Ecco: The Tides of Time",
  "slug": "ecco-the-tides-of-time",
  "year": 1994,
  "description": "The game begins with Ecco, a bottlenose dolphin, as he and his pod are swimming in their home bay. One podmate challenges him to see how high into the air he can jump. When he is in the air, a waterspout forms and sucks up all marine life in the bay except Ecco, leaving him alone in the bay. Upon leaving the bay to search for his pod, he contacts several dolphins from other pods, who tell him the entire sea is in chaos, and that all marine creatures had felt the storm. An orca tells Ecco to travel to the Arctic to find a blue whale named the \"Big Blue\", who is revered among marine mammals for its age and wisdom. Once Ecco finds him, the Big Blue tells him such storms had been occurring every 500 years and directs him to the Asterite, the oldest creature on Earth. He leaves the Arctic and travels to a deep cavern where he finds the Asterite. Although it has the power to aid him, one of its globes is missing, and needs it returned. However, this can only be achieved by traveling back in time using a machine built by the ancient Atlanteans.\r\n\r\nEcco travels to the sunken city of Atlantis, where he discovers the time machine and an ancient library. He learns the cause of the storm; it was a harvest of Earth's waters that was conducted every 500 years by an alien species known as the Vortex. The Vortex had lost their ability to make their own food, and so every 500 years, they would harvest from the waters of Earth. Learning this, he activates the time machine and travels 55 million years into Earth's past. While Ecco is in the past he learns an ancient song to communicate is a Pteranodon. Ecco locates the Asterite in the past but is immediately attacked by it. Forced into battle, he manages to dislodge a globe from it. This opens a time portal and he is sent back into the present. After receiving the globe, the Asterite grants him the power to turn his sonar into a deadly weapon against the Vortex, as well as the abilities to breathe underwater and to slowly regenerate lost health. The Asterite instructs him to use the time machine to travel back in time to the hour of the harvest. This time he manages to be sucked into the waterspout with his pod. Once inside the waterspout, Ecco makes his way towards the Vortex Queen, the leader of the Vortex race. Eventually, the Vortex Queen is destroyed and Ecco rescues his pod.",
  "banner_url": "/games/banner/ecco-the-tides-of-time.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:29:21.119226Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13676
}