{
  "name": "Sacrifice",
  "slug": "sacrifice",
  "year": 2000,
  "description": "The Holy War is over. The Demons of Golgotha have been banished, yet the cost has been terribly high. The Creator, God of the Fyllid, has been defeated and the faith of the people has begun to wane. Petty squabbles among the five remaining Gods have caused the land to split into five mystical territories - each at war with one another. Into this divided lands steps a wizard, a man haunted by his past, whose choices will shape the future. Which God will he choose? Will he sacrifice himself to change this world for the better, or will what remains of this world be sacrificed for one God's glory?\r\n\r\nSacrifice is the acclaimed real-time strategy game that focuses on combat instead of resource gathering. The only two resources you'll need to worry about are mana and souls. Need more units? Capture the souls of your enemy. Cast spells of awesome power. Choose which gods to support and you will be rewarded with a different selection of spells.\r\nBanish your enemy by sacrificing one of your allies at his altar... \r\n\r\n* Please the Gods and be granted unique spells and abilities. Cast over 50 devastating spells and summon over 50 terrifying creatures.\r\n* Pledge service to one of five mighty Gods who is the source of your power and your guide in your Holy Mission.\r\n* Command armies and fight along side them. Cast deadly spells amidst the action to aid your troops in battle.\r\n* Explore the dynamic, freeform, single-player campaign as you sell your services to the Gods. Cast spells that alter the landscape and weather to turn the tides of war.\r\n* From the ruins of the battlefield, harvest the souls of your defeated enemy to summon and strengthen your army of fierce creatures.\r\n* Battle with up to 4 players over the Internet or LAN on a dynamic, ever-changing battlefield.",
  "banner_url": "/games/banner/sacrifice.jpg",
  "icon_url": "/games/icon/sacrifice.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:54.409982Z",
  "steamid": 38440,
  "gogslug": "sacrifice",
  "humblestoreid": "",
  "id": 1874
}