{
  "name": "BlazBlue: Calamity Trigger",
  "slug": "blazblue-calamity-trigger",
  "year": 2008,
  "description": "The first hi-res 2D fighter from the creators of the Guilty Gear series! BlazBlue is a traditional 2D fighter where two characters participate in a duel. The story of the game involves dissent and destruction among a powerful council, known unofficially as \"the Library,\" which controls a great power that once saved humanity, but which now wields its power in protective, some say repressive, ways.\r\n\r\nA round is called a \"rebel\" and one match can consist of one to five \"rebels\". To win a round, one player must either incapacitate the other by inflicting damage through various attacks to reduce their opponent's health to zero or by having more remaining health than their opponent after the clock runs out. Every character has a weak, medium and strong attack. Also every ones has a \"unique\" technique, called a Drive attack, which is different for each character.\r\n\r\nKey Features:\r\n* 12 unique batants to choose from! - Choose a character that represents your own fighting style like the lightning-fast Taokaka or the wickedly powerful Tager.\r\n* Drive your way to victory! - Use the unique Drive Attacks specific to each character to decimate your opponent. Depending on the character control the elements like wind and ice or even absorb the life force from your opponents.\r\n* Experience the beauty of high-resolution hand-drawn sprites on 3D backgrounds all in glorious high-definition.\r\n* Various modes - Arcade, Versus, Score Attack, Training, Gallery and a pletely fleshed-out Story Mode that tells the tales of each character.\r\n* Bonus Contents - 2 CD's worth of OST included with a total of 42 music!",
  "banner_url": "/games/banner/blazblue-calamity-trigger.jpg",
  "icon_url": "/games/icon/blazblue-calamity-trigger.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:37.998430Z",
  "steamid": 263300,
  "gogslug": "blazblue_calamity_trigger",
  "humblestoreid": ""
}