{
  "name": "Just Cause 4",
  "slug": "just-cause-4",
  "year": 2018,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "Adventure"
    },
    {
      "name": "Third-person shooter"
    }
  ],
  "aliases": [],
  "description": "Welcome to Solis, a huge South American world home of conflict, oppression and extreme weather conditions. Just Cause 4 sees rogue agent Rico Rodriguez land in Solis to hunt down the truth about his past, at any cost. Strap into your wingsuit, equip your fully customizable grappling hook, and get ready to bring the thunder!\r\n\r\nKEY FEATURES\r\n\r\nBring The Thunder:\r\n\r\n    Soar through the skies with your wingsuit - Skydive, Base Jump and Free Dive with no limits!\r\n    Fight your enemies under extreme weather conditions, including towering tornadoes and tropical lightning storms, taking the iconic Just Cause action to insane new heights.\r\n    Use extreme weather events to your advantage thanks to never seen before in-game physics.\r\n\r\n\r\nRico’s Ultimate Mission:\r\n\r\n    Spearhead the rebellion and defeat the Black Hand, a hi-tech private military organisation.\r\n    Face off against Gabriela Morales – your most fierce, capable, and unpredictable adversary yet.\r\n    Uncover the truth of Rico’s father’s past life on Solis’ and its extreme weather.\r\n\r\n\r\nHuge South American World:\r\n\r\n    Explore the remote South American country of Solis, home of conflict, secrets, and danger.\r\n    Enjoy 1024 square kilometres of exotic playground, from rainforest to desert, via snowy mountain peaks.\r\n    Discover a plethora of wonders as you explore the world of Solis from bustling cities to rural grasslands.\r\n\r\n\r\nCreative Destruction at its best\r\n\r\n    Customize your new grapple hook with evolved and brand-new capabilities, allowing you to create your own personal stunts, destructive methods and overall play style.\r\n    Experiment with a huge variety of new vehicles including military jets, helicopters, turbo-fuelled sports cars, and construction vehicles.",
  "banner_url": "/games/banner/just-cause-4.jpg",
  "icon_url": "/games/icon/just-cause-4.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:01.874522Z",
  "steamid": 517630,
  "gogslug": "",
  "humblestoreid": ""
}