{
  "name": "Colony Wars",
  "slug": "colony-wars",
  "year": 1997,
  "description": "Since 3095, the Earth Empire has spread throughout the universe, taking what it wants and destroying the rest - all in the name of sustaining life on Earth. To the Empire, expansion is of the utmost importance, even above famine, drought and death. The League of Free Worlds exists to offer resistance and hope to the plundered outlying colonies. After a key victory, it is shown that the Empire's Navy can be harmed and the ranks of the League begin to swell.\r\n\r\nColony Wars is a combat fighter game set in space. You, as the player, join as a recruit in the League's fleet. Missions take place in various fighters, from a 1st person view inside the cockpit, or a 3rd person view from behind your ship. Ships have separate meters for shields and armor, and the player must cycle between weapons designed specifically to damage each. At the most basic, purple lasers must drain a target's shields, followed by switching to red lasers to destroy them.\r\n\r\nThe game features advanced lighting and particle effects for the PlayStation, as well as a basic simulation of Newtonian physics. Thrusters are only active for as long as the accelerate button is held down. The player can burst fire their thrusters and drift, allowing for some advanced maneuvers.\r\n\r\nThe campaign features branching missions and storylines which, depending on your performance in the previous operations, lead to up to five different endings. Unlike most games of this genre, the destruction of the player's ship does not imply the immediate loss of the game: the pilot automatically ejects on an escape pod, but the mission is marked as failed, thus potentially putting the player on a losing path.",
  "banner_url": "/games/banner/colony-wars.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-03-01T22:57:30.288501Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 25993
}