{
  "name": "Ascendant",
  "slug": "ascendant",
  "year": 2014,
  "description": "Ascendant is the unforgiving beat 'em up that challenges you with a new world each time you play. It utilizes a number of modern roguelike elements such as permadeath and procedurally generated environments. You are a demigod who invades a plane controlled by your rivals. They will stop at nothing to eliminate you. Only the most impressive warriors will triumph over their armies of zealots and beasts.\r\n\r\nBy exploring the world, discovering new weapons, spells, and Blessings, and learning how to survive in this brutal realm, you may have a small chance at winning.\r\nFeatures\r\n\r\n    A Brutal Struggle – The armies of your demigod rivals are relentless. When a foe cuts you with his sword, it hurts. If you slip into a pit of spikes, the blades leave deep wounds. If a bomb explodes nearby you will burn. Health recovery items are rare. Fight with precision, speed, and timing to survive. Dodge attacks and crush your opponent when he is off-balance to seize the advantage.\r\n\r\n    Loot the Treasures of the Gods – The gods hid their ancient relics in secret caches scattered around the world. Discover unique weapons, spells, and Blessings that grant mighty powers. Double jump, choke your enemies with a poison cloud, or jolt them to ashes with lightning. Equip and customize your Blessings to determine your own fate.\r\n\r\n    Agile Beat 'em Up Combat – Slam enemies into each other to deal massive damage. Pummel enemies with ground and air combos or launch a barrage of spells. Launch your opponents in the air with rapid dashing assaults making them helpless against your divine onslaught.\r\n\r\n    Death is Final – When your enemies defeat you, the game is over. No respawning. No returning to the last save point. You will need all your cunning and skill to win.\r\n\r\n    A New World Each Run – Each playthrough creates a new hazardous land for adventure. You will never know exactly what you will encounter in the next room, which hazards will be presented to you, what you will find in a chest, or even (in some cases) which boss you will be fighting next. Expect hours of replayability and new challenges. \r\n\r\n...And More\r\n\r\n    Two is better than one. Conquer the world with another demigod using local co-op\r\n    Unlock new characters with distinct stats attuned for any playstyle\r\n    Enhance your weaponry to adapt and overcome the enemy swarm\r\n    Special events make each run fresh and memorable",
  "banner_url": "/games/banner/ascendant.jpg",
  "icon_url": "/games/icon/ascendant.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:34.872754Z",
  "steamid": 296930,
  "gogslug": "ascendant",
  "humblestoreid": "",
  "id": 2489
}