{
  "name": "Deponia Doomsday",
  "slug": "deponia-doomsday",
  "year": 2016,
  "platforms": [
    {
      "name": "Linux"
    }
  ],
  "genres": [
    {
      "name": "Adventure"
    },
    {
      "name": "Point-and-click"
    }
  ],
  "aliases": [],
  "description": "One fateful night, Rufus awakes from a haunting nightmare: he sacrificed himself to save Deponia. But at what price? Elysium, the floating city crash-landed on the planet. As the last surviving Deponian, he fought savage fewlocks, but in the end, there was only one way out: He had to blow up Deponia! And... He grew a mustache.\r\n\r\nOf course he realized that these gruesome events -especially the mustache part- had to be prevented from ever happening. Deponia and his well-shaved face had to survive!\r\n\r\nBut was this really just a dream? With the help of McChronicle, a quirky temporal scientist, who discovered strange time-anomalies, Rufus discovers that some time travelers from the future carelessly parked their time machine in his neighborhood. Just imagine if this amazing technology would fall into the wrong hands!\r\n\r\nDive right into this frantic sequel of the Deponia cult-trilogy and join the chaotic anti-hero Rufus on his most peculiar adventure. Even without knowing the previous installment, the hilarity of Deponia Doomsday will have you cracking smiles and burst with laughter.\r\n\r\nGet enthralled by the bizarre humor and the uniquely designed world and enjoy the largest and longest Deponia adventure of all time.\r\n\r\n* Epic adventure gameplay\r\n* Unique hand-drawn comic style\r\n* Familiar faces and more than 70 new crazy characters featuring the whacky humor you love so much\r\n* Turn back time and see a new spin on the junk-planet's history\r\n* Platypus-tastic action\r\n* Junk meets decadence: playable levels on Deponia and Elysium\r\n* Discover the lush flora and fauna of Deponia",
  "banner_url": "/games/banner/deponia-doomsday.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:09.744642Z",
  "steamid": 421050,
  "gogslug": "deponia_doomsday",
  "humblestoreid": "deponia-doomsday"
}