{
  "name": "BloodStone",
  "slug": "bloodstone",
  "year": 2020,
  "description": "Bloodstone The Ancient Curse is a free 2D MMORPG game developed by Streamy and made in pixels. Explore the world of Bloodstone and get together with your friends to fight powerful creatures.\r\n\r\nRISE\r\n\r\nThere are many springs, so many it can hardly be remembered, there was a civilization rich in gold and art.\r\n\r\nIn it was a tradition of thoughtfulness and wisdom sustained for generations by Twelve Elders. Civilization lived in peace and harmony with earth and magic, far from war and danger, until the day a shadow fell upon the world… From the darkest corners of the earth emerged creatures never seen before, and in the same violence that arose they came to dominate the lands with their savagery. The Twelve Elders searched for answers each in one direction of the continent, until the answer came in the form of a hero: Kuroba, the hero of Dasmanpur.\r\n\r\nUnder the tutelage of each elder, Kuroba gained skills and powers that made him unbeatable, and alone was able to clear kingdoms of all creatures that threatened his people. However, with each wave he exterminated, two new ones emerged. Determined to become the savior everyone longed for, he sought more power and knowledge no matter the cost.\r\n\r\nTHE FALL\r\n\r\nThe same craving for the title of savior that moved Kuroba corrupted him, and the pursuit of power soon became an addiction, until eventually the hero himself became the antagonist. Lost villages, fallen cities and lives taken, leading the people to fear the one who once cheered. The Twelve then gathered together to stop the now dangerous Kuroba, and they fought a battle for twelve days and twelve nights, as each succumbed in battle without even a glimpse of victory. It was against the worst of scenarios that they opted for one last spell, the one that would forever seal Kuroba, the bloody master, in stone.\r\n\r\nIn the decades following the battle, the ruins of the battle were forgotten, the statue of Kuroba was given a mere adornment, and the fate of the Twelve Elders was lost in story. There were no witnesses, no tears, only legends and songs about a mythological battle. The shadow, however, just fell asleep, and the creatures Dangerous goods just waited for their return to the surface.\r\n\r\nToday, far from the old tales, the villages are threatened again, and there are no more Legendary Elders or Warriors to protect the population… or would it? A new rising of heroes begins to emerge to defend their villages, from the humblest to the noblest classes, ready to brave the world and destroy the threats that plague it. Join these heroes before Kuroba's corruption returns to the world!\r\n\r\nWelcome to Bloodstone!\r\n\r\nYou are one of the heroes, blessed with the ability to battle and survive, an answer to the balance of this world! You will begin your training in the realm of Donncaster, where you will learn to take your first steps, and learn the secrets and stories that permeate our universe. Get stronger, make allies, and overcome Bloodstone's odds!",
  "banner_url": "/games/banner/bloodstone.jpg",
  "icon_url": "",
  "is_public": false,
  "updated": "2020-01-26T14:42:27.508777Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 31315
}