{
  "name": "Devil Summoner: Soul Hackers",
  "slug": "devil-summoner-soul-hackers",
  "year": 1998,
  "description": "Amami City is a Japanese megalopolis of the near future. In this huge city, each house has a computer, and all computers are linked to one big network. The flow of information is being controlled by the government, and software companies create huge virtual locations-networks. An eighteen-year-old member of a hacker group called Spookies and his companions gain access to one of these networks - a virtual city called Paradigm-X, created by Algon Soft. However, an accident occurs during the hacking, and a mysterious demon who calls herself Nemissa emerges. The Spookies must find the true reason behind Nemissa's arrival, and confront a shadowy organization known as Phantom Society, which employs demon summoners.\r\n\r\nSoul Hackers is similar in its themes, structure and gameplay to its predecessor, as well as to the main Shin Megami Tensei series. Set in a futuristic cyberpunk environment, the game contains many characteristic elements such as two weapon types (swords and guns) for the main hero, a female companion who can learn and cast magic spells, and a party of six active combatants, of which four are demons. Like in many other Megami Tensei games, the player can communicate with randomly encountered demons and recruit them into the party by selecting appropriate dialogue choices. These demons can also be fused with each other to create more powerful ones.\r\n\r\nThe loyalty system from the previous game returns; however, this installment makes it easier to raise the loyalty level of a demon. By taking a demon into battles and repeatedly performing action it likes (indicated by its comments to the player's choices), the player can gradually make it fully controllable and obedient. Attack and magic power of the demons raises together with their loyalty levels.\r\n\r\nNew in this installment is a limited ability to fuse demons outside of specific fusion places, by using the protagonist's demon-summoning computer (COMP). The player can also purchase and install software on this computer, which has a variety of functions, from combat-aiding and mapping utilities to the possibility to save the game anywhere in the dungeon.",
  "banner_url": "/games/banner/devil-summoner-soul-hackers.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-08-29T22:28:41.493524Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 38022
}