{
  "name": "Age of Empires: The Rise of Rome",
  "slug": "age-of-empires-the-rise-of-rome",
  "year": 1998,
  "description": "Experience all the conflict, intrigue, greed, and power as you create the most feared and celebrated civilization in history, The Roman Empire. Created by the developers of the award-winning real-time strategy game, Age of Empires, The Rise of Rome lets you play an active role in directing the ascension of the infamous Roman Empire.\r\nWage war on a grand scale with this highly anticipated add-on pack that extends Age of Empires into a new era of world domination.\r\n\r\nSend powerful new units into the heat of battle, including the punishing Scythe Chariots to trample armies, crafty Camel Riders to foil Cavalry crusades, fearless Slingers who hurl projectiles at Archer ambushes, and the defensive Fire Galley to counter the Triremes fierce attacks.\r\n\r\nFrom the height of luxury to the brink of disaster, be responsible for the rise or fall of the world’s greatest empire. The Roman Empire campaign focuses on the most important historic battles and milestones in Rome’s infamous history.\r\n\r\nChoose from four new civilizations (In addition to the twelve already available in Age of Empires), with unique technology trees and distinct strengths and weaknesses. Now you can experience intense clashes between fierce adversarial superpowers such as Carthage and Rome, Palmyra and Macedonia.\r\n\r\n• Carefully plan and coordinate your civilization’s growth with the addition of production queues to Age of Empires’ classic gameplay.\r\n• Relive key moments in history with challenging campaigns, including Augustus Caesar versus Cleopatra and Marc Antony, and Hannibal and his elephants in their fabled crossing of the Alps.\r\n• Chart new strategies for developing and conquering in four new map types — treacherous Hill Country, Narrows, Mediterranean, and Continental. Larger map option is available for all new and existing maps.\r\n• Gather up your resources to create the most impressive wonder of the world, The Roman Colosseum.",
  "banner_url": "/games/banner/age-of-empires-the-rise-of-rome.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:28:14.429317Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 21687
}