{
  "name": "Jurassic Park",
  "slug": "jurassic-park",
  "year": 1993,
  "description": "Jurassic Park is based on the novel and film of the same name.[5][6][7] Following a computer system failure, Dr. Alan Grant and others become trapped on an island theme park populated with dinosaurs.[8]\r\n\r\nThe player controls Grant, and begins the game armed with a cattle prod,[6] although the game also features five other weapons: tranquilizer gun, shotgun, bolas, gas grenade launcher, and missile launcher.[8] The game features seven different dinosaur enemies,[8] as well as giant dragonflies.[5] The player is given five lives, and two continues when all lives are lost.[8] Grant's health is represented by a red health bar.[5] Food and first-aid kits located throughout the game can replenish the player's health.[8]\r\n\r\nMotion sensors set up around the island allow characters in the game to communicate advice to the player,[5][6] although some advice is deliberately malicious.[8] If Grant loses a life, the player is restarted at the last motion sensor with which Grant came into contact.[6][8] Mr. DNA, a character from the film, provides dinosaur facts to the player if the game is paused or remains idle for too long.[5][8] The player must open and close multiple gates to travel around the island.[5] The game's music changes depending on the player's location in the park.[5][9] The player is also required to collect dinosaur eggs throughout the game.[8][6]\r\n\r\nThe game's exterior portion, played from a bird's-eye view,[3] consists of a maze that is made up of jungle trees.[6] The game switches to a first-person perspective when the player enters a building.[6][3] The player must collect ID cards belonging to characters on the island in order to access certain rooms. Other rooms are completely dark and require night vision goggles to enter.[3][5][6] Jurassic Park supports the Super NES Mouse when playing first-person sequences or operating computer terminals.[8]\r\n\r\nTo win the game, the player must complete several objectives, starting with powering up a computer to re-activate the park's motion sensors. Once activated, the player's short-range motion sensor can detect nearby dinosaurs.[8][5] Subsequently, the player must determine how raptors are infiltrating the park's visitor center and stop them; prevent raptors from escaping to the mainland on a supply ship; and find the raptors' nests in underground volcanic tunnels and destroy them with a nerve gas bomb. The final objective requires the player to locate a communications center to contact a helicopter, and then reach the helipad to be rescued.[8][6] The game does not utilize a password feature.[10] The player, therefore, is required to play through the entire game in a single sitting.[11]",
  "banner_url": "/games/banner/jurassic-park.jpg",
  "icon_url": "/games/icon/jurassic-park.png",
  "is_public": true,
  "updated": "2020-05-26T03:34:56.570334Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13691
}