{
  "name": "Devolver Bootleg",
  "slug": "devolver-bootleg",
  "year": 2019,
  "description": "Devolver Bootleg contains eight original rip-offs of Devolver Digital games including:\r\n\r\nEnter The Gun Dungeon\r\nImagine a dungeon crawler but instead of swords it’s guns. But also everything is made out of guns and bullets and stuff. Like, everything.\r\n\r\nHotline Milwaukee\r\nBrutal, fast-paced, stealth action and a whole lot of blood. From your garbage person apartment in historically interesting and relevant Milwaukee, pick up the phone, and answer the call--of murder. Follow instructions and follow the stairs deeper and deeper into the mysterious basement. Where does it go? Who are you?\r\n\r\nApe Out Jr.\r\nEscape out of ape prison in this classic arcade-style platformer where you play as an orange gorilla who will kill everyone so he can to see his dad again. Grab unsuspecting guards to use as weapons and shields in this completely original idea set to an interpretive chiptune jazz drummer soundtrack. Please, Ape Out was my father’s name.\r\n\r\nShootyboots\r\nIt’s the never-ending story of a young boy falling down a well, wearing a giant boot as if it was overalls, which also is a gun. Collect gems, squash and shoot the fauna, fall deeper into the infinite well, and wear some other equally large and ballistically designed shoes.\r\n\r\nSuper Absolver Mini: Turbo Fighting Championship\r\n(2 Players Only)\r\nA competitive fighting game where you play as your choice of one of four masked combat disciples. You choose two special moves. You fight two rounds. The winner is absolved of the obligation to ever have to fight again, but probably will anyway because the one true resolve of the flesh is a fist colliding with it.\r\n\r\nCatsylvania\r\nIt’s a cat inside of a suit of armor. It’s a cat...In full plate armor. What else do you want?\r\n\r\nPikuBiku Ball Stars\r\n(2 Players Only)\r\nEverybody’s favorite red thing with legs is back and ready to sink some baskets with a friend. Nothing but net baby. Slam freakin’ dunk.\r\n\r\nLuftrousers\r\nHello, I am Rami Ismail, ½ of Dutch independent game development studio, Vlambeer. We made a version of Luftrausers that had a typo, and JW left the thumbdrive containing the source at a coffee shop somewhere while I was doing a talk in Berlin, then Nairobi, then in Los Angeles the following day. If you find the thumbdrive, can you please return it and please PLEASE do not share the contents with anyone or add it to a compilation of pirated, under-the-table ripoffs of games that Devolver has published.",
  "banner_url": "/games/banner/devolver-bootleg.jpg",
  "icon_url": "/games/icon/devolver-bootleg.png",
  "is_public": true,
  "updated": "2019-06-11T00:45:18.431599Z",
  "provider_games": [],
  "steamid": 1066260,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 27829
}