{
  "name": "Disco Elysium",
  "slug": "disco-elysium",
  "year": 2019,
  "description": "Disco Elysium is a groundbreaking open world role playing game. You’re a detective with a unique skill system at your disposal and a whole city block to carve your path across. Interrogate unforgettable characters, crack murders or take bribes. Become a hero or an absolute disaster of a human being.\r\n\r\nUnprecedented freedom of choice​. Intimidate, sweet-talk, resort to violence, write poetry, sing karaoke, dance like a beast or solve the meaning of life. Disco Elysium is the most faithful representation of desktop role playing ever attempted in video games.\r\n\r\nCountless tools for role playing.​ Mix and match from 24 wildly different skills. Develop a personal style with 80 clothes items. Wield 14 tools from guns to flashlights to a boombox, or pour yourself a cocktail of 6 different psychoactive substances. Develop your character even further with 60 wild ​thoughts ​to think – with the detective's Thought Cabinet.\r\n\r\nA revolutionary dialogue system with unforgettable characters. ​The world is alive with real people, not extras. Play them against each other, try to help them, or fall hopelessly in love. Disco Elysium's revolutionary dialogue system, with partially voiced characters, lets you do almost anything.\r\n\r\nCarve your unique path across the city​. Explore, manipulate, collect tare or become a millionaire in an open world unlike anything you've seen before. The city of Revachol is yours for the taking, one small piece at a time. From the streets to the beaches – and beyond.\r\n\r\nHard boiled, hard core. ​Death, sex, taxes and disco – nothing is off the table. Revachol is a real place with real challenges. Solve a massive murder investigation, or relax and kick back with sprawling side-cases. The detective decides, the citizens abide.",
  "banner_url": "/games/banner/disco-elysium.jpg",
  "icon_url": "/games/icon/disco-elysium.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:40.089280Z",
  "steamid": 632470,
  "gogslug": "disco_elysium",
  "humblestoreid": "",
  "id": 26075
}