{
  "name": "DEATHPIT 3000",
  "slug": "deathpit-3000",
  "year": 2017,
  "description": "DEATHPIT 3000 is a top-down co-op bullet hell shooter where you fight waves of enemies to claim arena championships! Choose a quantum ability that promotes offensive or defensive play-styles as you battle your way through four distinct Deathpits and slaughter hoards of deadly enemies to earn Spacebux and unlock weapons, equipment and upgrades, all in a humorous dystopian sci-fi universe.\r\n\r\nInspired by retro classics Doom and Smash TV, and influenced by modern co-op titles such as Left 4 Dead and Alien Swarm, it’s a punchy experience - great for casual gamers but with enough challenge and tactical depth for hours of replayability.\r\n\r\nThe game now supports ONLINE TWO PLAYER CO-OP. It can also be played SINGLE PLAYER, or with up to FOUR PLAYERS over Local Area Network, which works even if your internet is offline as long as you and your friends are connected to the same router or switch, making it perfect for old school LAN parties. Four player online multiplayer is also possible if you are all using a free hosted VPN service such as LogMeIn Hamachi.\r\n\r\n    2 player online co-op\r\n    1-4 player local network co-op\r\n    4 championships\r\n    4 powerful quantum abilities (shield, group teleport, lighting attack and invisibility)\r\n    5 voiced playable characters\r\n    6 tactically distinct, upgradable weapons\r\n    Grenades, mines, jetpacks, armour, deployable walls and turrets\r\n    13 enemy types, each with unique attacks and weaknesses\r\n    Complete wiki of humorous sci-fi universe and backstories\r\n    Steam Achievements & Cloud Save\r\n    Full Xbox gamepad support and Steam controller configuration\r\n\r\n    In development and coming soon:\r\n    Trading cards (pending Steam authorization)\r\n\r\nDEATHPIT 3000 is the debut release by Cyberlamb Studios, a two-man indie developer from Wales, UK.",
  "banner_url": "/games/banner/deathpit-3000.jpg",
  "icon_url": "/games/icon/deathpit-3000.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:07.232473Z",
  "steamid": 718720,
  "gogslug": "",
  "humblestoreid": "",
  "id": 17969
}