{
  "name": "PRO EVOLUTION SOCCER 6",
  "slug": "pro-evolution-soccer-6",
  "year": 2006,
  "description": "PES 6 will once again feature the graphical and gameplay tweaks that enable each new title to play completely differently from previous incarnations. The shooting system has been the subject of extensive retouching, now enabling players to pull off much more accurate snap shots as well as being able to exert a much larger feeling of control when going for quick half volleys or difficult full volleys.\r\n\r\nThe intelligence of players has seen a marked improvement. For example, players now make more realistic runs into space, often pointing where they would like the ball played. The physical aspect has also been beefed up, with strikers using their sheer presence to turn defenders and likewise, the defenders stepping a yard away to enable them to force players away from goal and not letting them spin into dangerous positions.\r\n\r\nPES 6 also has a number of new teams licensed for inclusion, with the International roster now featuring the official kits for Argentina, the Netherlands, Italy, Spain and Sweden. New gameplay modes have been added and features like the much loved Master League mode also returns, together with a host of new tricks, feints and animations that can be used to bamboozle your opposition.\r\n\r\nAs well as the first step into next generation gaming with a dedicated Xbox 360 version bringing with it an impressive array of online features, PS2 and PC owners will also feel the benefit of a brand new online system, enabling up to eight players to play simultaneously through four linked systems.\r\n\r\nPSP owners will also see marked improvements as the Master League option has now been added by popular demand and for the first time, DS owners will get to play PES wherever they are. However, the handheld versions will also feature a revised camera angle, to make it easier to view the action on the smaller screens, without losing any of the gameplay.",
  "banner_url": "/games/banner/pro-evolution-soccer-6.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:49.881348Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 21842
}