{
  "name": "Jerusalem: The Three Roads to the Holy Land",
  "slug": "jerusalem-the-three-roads-to-the-holy-land",
  "year": 2002,
  "description": "Adrian Blake is a renowned 20th century Scots cartographer. On his return from an expedition, he discovers that his fiancee, Sophia, has disappeared. He must journey through time to find her. Having explored Pompeii in the 1st century, and having found Sophia just before the explosion of Vesuvius, Adrian is once more swept up in a vortex. He regains consciousness at the gates to Jerusalem...\r\n\r\n1552. Lord of the Ottoman dynasty, Sulaiman the Magnificent, in the wake of years of war and conquest, reigns over the greatest empire in the World.\r\n\r\nIn Jerusalem, the holy city where King David had built the Temple, where Christ preached and where the Prophet Mohammed was swept off to meet Allah, the three religions of the Book live in peace.\r\n\r\nHaving become the confidante to the emissary of Sulaiman the Magnificent, Adrian is faced with the task of untangling the web of intrigue threatening the fragile balance that has been reached by the three communities of the Book. He will have to co-operate with the representatives of all three communities in order to save the governor's daughter. From the Holy Sepulcher to the Dome of the Rock, from the Wailing Wall to King Solomon's Mines, it is a race against time...\r\n\r\nA thrilling adventure that encourages the discovery of cultures and customs, and which places universal values, the dismissal of differences, the unity of knowledge and wisdom in the face of saving a human life, in the foreground.\r\nThe ancient Jerusalem perfectly recreated, and validated by the most esteemed International experts.\r\nA heart-stopping and non-linear intrigue: you are entirely free to move around the city as you wish.\r\nA new graphics engine that offers 3D photo-realistic modelling enabling total and natural absorption into the story.\r\nA reference section of 75 sheets prepared by historians, and developed to back up the game, to encourage greater understanding of the Holy City and broader general knowledge.\r\nThe 3D re-creation of the Holy City and the scenario have been designed and validated with the co-operation of International scientific experts, directed by Frederic Lenoir at the Centre Interdisciplinaire d'Eludes des Faits Religieux, Institut des Hautes Eludes on Sciences Sociales in Paris, with the help of the Reunions des musees nationaux.",
  "banner_url": "/games/banner/jerusalem-the-three-roads-to-the-holy-land.jpg",
  "icon_url": null,
  "is_public": false,
  "updated": "2020-04-30T08:46:33.027068Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}