{
  "name": "Leisure Suit Larry: Love for Sail!",
  "slug": "leisure-suit-larry-love-for-sail",
  "year": 1996,
  "description": "When we last saw our less-than-dashing hero, Leisure Suit Larry, he was in a rather sticky situation. Not one to be tied down, Larry makes the best of things by going on a cruise to forget the previous escapade. Once he arrives on the deck, he finds out there’s a Mega-Contest for the heart and body of one Captain Thigh, the sexiest sea captain this side of the Atlantic. Our hero must use his wits and wiles...wait, he’ll just cheat and “win” his way into the Captain’s bedroom. Set sail for steamy adventure on the high seas!\r\n\r\nLeisure Suit Larry: Love for Sail! drops a world-class lounge lizard onto a cruise ship filled with gorgeous women and side-splitting slapstick. Using the latest and greatest technology of the time, the Grope ‘n’ Click interface is perfect for those moments of “one handed mousing”. No more icons! No more messing around! If that’s not enough, you can always type in your own personalized and customized responses and see what happens. Don't miss the final classic installment of the hottest point-and-click adventure in existence!\r\n\r\n- A bountiful bevy of beautiful, bouncing babes in every nook and cranny of the game!\r\n\r\n- Explore the whole cruise ship and find several items which are used to solve puzzles and are necessary to progress in the story.\r\nThink outside of the box and come up with unusual actions in order to solve a puzzle.\r\n\r\n- This Leisure Suit Larry supports a context-sensitive interface which brings a series of verbs by clicking on an object which can the player choose from.\r\nBut you can additionally enter your own verbs into the game, as it was in the predecessors beofre and as long as the game understands them.\r\n\r\n- Exquisitely hand-drawn graphics and animation along with some hidden Easter eggs that will make your eyes pop!\r\n\r\n- Witty humor alongside spicy dialogues, a feast for the discerning and adventurous gentleman!",
  "banner_url": "/games/banner/leisure-suit-larry-love-for-sail.jpg",
  "icon_url": "/games/icon/leisure-suit-larry-love-for-sail.png",
  "is_public": true,
  "updated": "2019-03-30T02:16:00.266597Z",
  "steamid": 765890,
  "gogslug": "leisure_suit_larry_love_for_sail",
  "humblestoreid": ""
}