{
  "name": "Echoshift",
  "slug": "echoshift",
  "year": 2009,
  "description": "Let your past catch up with you in this unique new offering on the PSP® system. echoshift™ introduces a new gaming concept that allows you to interact with your past choices, while bringing a fun and different twist to the puzzle genre! A franchise spin-off of the previously released PlayStation®Network hit, echochrome™, echoshift features a unique puzzle concept and brings a new gaming style and visual appeal to players.\r\n\r\nPlayers must strategically maneuver a mannequin-like figure through each level while solving intricate puzzles within a certain amount of time. Players will need to cooperate with “echoes” of their previous attempts to help clear each level. Each time a player starts over, a new echo is created based on the actions taken, and more echoes will appear. Strategically use these multiple echoes and layer their actions to help you through the level and reach the goal. Players will be challenged to solve over 30 different puzzle types, which include moving objects, doors controlled by switches, and crumbling floors, all within themed worlds based on different puzzle concepts and types.\r\n\r\nKey Features\r\n\r\n    Innovative Game Play – Players strategically progress through levels utilizing and cooperating with their past actions to help solve intricate puzzles.\r\n    Over 30 Puzzle Types – Master over 30 kinds of puzzles, including moving objects, doors controlled by switches, crumbling floors and more!\r\n    Loaded Content – Over 50 levels spread across a multitude of worlds that challenge players to master an array of puzzle themes and combinations of puzzle types.\r\n    Artistic Visuals – Reminiscent of echochrome, echoshift is elegantly designed featuring simple graphics with minimal colors.\r\n    Elegant Soundtrack - Fans of the echochrome soundtrack can look forward to a soothing original score from a new director and composer.",
  "banner_url": "/games/banner/echoshift.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:29:21.244021Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 23279
}