{
  "name": "Beyond Zork: The Coconut of Quendor",
  "slug": "beyond-zork-the-coconut-of-quendor",
  "year": 1987,
  "description": "Wait no more... it's Beyond Zork\r\n\r\n\r\nTen years ago, in June of 1977, Zork was born. Since that time, it has been played and enjoyed by literally millions of people in the United States and abroad. The three Zork sagas are considered true classics in the field of entertainment software.\r\n\r\nDuring these intervening ten years, we have advanced our technology by making our parsers smarter, our usable vocabularies larger, and our game-playing methodologies more flexible and fun. We have introduced many new and exciting games which have been met with critical acclaim both from you and from our peers in the industry. But it has always been Zork that has drawn the most favorable and evocative comments. The phrase \"give us another Zork\" has appeared in countless correspondence and conversations.\r\n\r\nHowever, we have been cautious about writing a new Zork game, with the feeling that any game with the Zork name had better be able to deliver a level of puzzle invention, storytelling, and technical expertise that matched the original and then went a step further. We are now confident we have taken that step. Therefore we give you the newest jewel in the Zorkian crown - Beyond Zork.\r\n\r\nIt is the year 966 GUE and the Age of Magick is rapidly coming to an end, plunging the once-peaceful region of Quendor (formerly known as the Great Underground Empire) into total chaos.\r\n\r\n    The Collapse of Magic\r\n\r\n\r\n\r\nNot even the most powerful sorcerer of the mighty Guild of Enchanters has been able to halt the collapse of magic and hold back the Age of Science. In the face of this situation the Guildmasters have convened by the shore of the Great Sea for one final fateful time.\r\n\r\nThe sorcerers know they will not live to see the day when magic will again hold sway over Quendor. But, they do have a plan to ensure that their vast and ancient knowledge is not lost through the erosion of time. They will dispatch an innocent adventurer (for Quendor is now far too dangerous for those practiced in the thaumaturgical arts) to regain and then hide the transcendent Coconut of Quendor, within whose time-impervious shell lies the essence of their wisdom. Their hope? That the coconut will endure, beyond the Age of Magick, beyond the Age of Science, and even, Beyond Zork.\r\n\r\n    Coconut of Quendor\r\n\r\n\r\n\r\nIn Beyond Zork you're the innocent adventurer who has been chosen to find the world's last great magical object, the aforementioned Coconut of Quendor, which is now in the possession of a group of demi-gods who definitely do not want you to have it. But take heart: even though you didn't make this dangerous world, there's light at the end of this grue-infested tunnel.\r\n\r\nThrough the auspices of Beyond Zork's author Brian Moriarty and our systems group, you'll be able to build up your \"character.\" That's because, besides giving you a compelling new tale of the Zorkian universe, Brian has added the thrilling combat and character building aspects of role-playing games. That's right, at the beginning of the story, you create your own character by assigning various amounts of \"potential\" for each of six traits (strength, intelligence, luck, etc.). You can also allow the story to create a random character or you can select a pre-defined character. And you'll need to choose wisely because the danger is everywhere.\r\n\r\n    Hacking and Slashing in the GUE\r\n\r\n\r\n\r\nYour newly created \"self\" will have to solve fantastic new puzzles involving many wondrous objects and unforgettable characters. But don't be surprised if you have to stop thinking for a moment and defend yourself, as you're likely to be menaced by anything from a discipline crab or a giant corbie to an insidious monkey grinder or a pair of knights with flaming eyes. You'll be wielding, thrusting, parrying, hacking, and slashing just like any seasoned role-player, but you'll be doing it all in the marvelous GUE, where it was meant to be done. And with each battle won, puzzle solved, or new scroll or treasure under your belt, your traits will be enhanced. But watch out! If you say the wrong thing or get into a fight that you're not prepared for (the right weapons and armor are always essential for a successful combatant) you'll watch those traits fall until the cold hand of death is upon you.\r\n\r\nDid we say watch? You bet, because with our brand-new interface you'll have scrollable windows, graphic status screens and on-screen mapping to look at besides the many fantastic new locales that Brian has conjured up for your mind's eye.\r\n\r\n    The Lore and Legend of Quendor\r\n\r\n\r\n\r\nAbout this time, many readers start to think, \"I wonder what else comes in the package with this great new Infocom game?\" Well, our master designers have created two beautiful objets d'art for you. First, a beautiful book, The Lore and Legend of Quendor (considered to be the last word on the subject) and second, one of the most spectacular maps ever produced by our master cartographers. Did somebody say Mega-Zork?\r\n\r\nBeyond Zork is Brian Moriarty's third work of interactive fiction. His previous works are Wishbringer and Trinity.",
  "banner_url": "/games/banner/beyond-zork-the-coconut-of-quendor.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-05-31T00:17:35.948441Z",
  "provider_games": [
    {
      "name": "Beyond Zork - The Coconut of Quendor",
      "slug": "1207661533",
      "service": "gog"
    }
  ],
  "steamid": null,
  "gogid": 1207661533,
  "gogslug": "beyond_zork_the_coconut_of_quendor",
  "humblestoreid": "",
  "id": 28940
}