{
  "name": "Runescape 3: NXT",
  "slug": "runescape-3-c-client",
  "year": 2001,
  "description": "** This is the recent RuneScape 3 Client trough Lutris + Wine + DXVK **\r\n\r\nRuneScape, sometimes referred to as RuneScape 3,[1] is a fantasy massively multiplayer online role-playing game (MMORPG) developed and published by Jagex, first released in January 2001. RuneScape was originally a browser game built with the Java programming language, but was largely replaced by a standalone C++-coded client in 2016. The game has had over 200 million accounts created and is recognised by the Guinness World Records as the world's largest and most-updated free MMORPG.[2]\r\n\r\nRuneScape takes place in the world of Gielinor, a medieval fantasy realm divided into different kingdoms, regions, and cities.[3][4] Players can travel throughout Gielinor via a number of methods including on foot, magical spells, or charter ships.[5] Each region offers different types of monsters, resources, and quests to challenge players. The game's fictional universe has also been explored through a tie-in video game on another of its maker's websites, FunOrb, Armies of Gielinor,[6] and the novels Betrayal at Falador,[7] Return to Canifis,[8] and Legacy of Blood.[9]\r\n\r\nPlayers are represented in the game with customisable avatars. RuneScape does not follow a linear storyline; rather, players set their own goals and objectives. Players can choose to fight non-player character (NPC) monsters, complete quests, or increase their experience in the available skills. Players interact with each other through trading, chatting, or by participating in mini-games and activities, some of which are competitive or combative in nature, while others require cooperative or collaborative play.\r\n\r\nThe first public version of RuneScape was released in January 2001 in beta form, with Jagex as its copyright holder being formed later that year. As the game's popularity grew, the game engine was rewritten and released as RuneScape 2,[10] with the original version of the game being renamed RuneScape Classic. The third iteration of the game, known as RuneScape 3, was released in July 2013.[11] Old School RuneScape, a separate, older version of the game dating from August 2007 was released in February 2013, and is maintained alongside the original client. It was announced that mobile ports of both versions of RuneScape would be released for Android and iOS devices in 2018.",
  "banner_url": "/games/banner/runescape-3-c-client.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-04-16T07:31:18.189329Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 32026
}