{
  "name": "RuneScape",
  "slug": "runescape",
  "year": 2001,
  "description": "A Truly Unique MMO\r\n\r\nSet in the medieval fantasy world of Gielinor, RuneScape is a free browser MMO game where millions of players from around the globe become heroes with the freedom to explore and experience a realm full of magic, mystery and adventure.\r\n\r\nA Feature Rich Adventure\r\nExplore a vast world full of unique cities, races, guilds and dungeons, where ancient gods have returned to battle for dominion. Experience a varied range of rich content and features, many of which are available for FREE. Discover more about the amazing in-game features available.\r\n\r\nBe Your Own Hero\r\nWith no character classes, have the freedom to be the hero you want to be. Choose the abilities you want and adopt different play styles to suit the situation. Have the skills of a warrior, healer and wizard all at once.\r\n\r\nThe Community Shape the Game\r\nGods are fighting for supremacy and your actions decide the victor. Characters will die and geography will reshape – the consequences forever alter RuneScape’s future.\r\n\r\nTruly Free to Play\r\nWith the introduction of the new Bonds system players with playtime and effort can access and enjoy every piece of premium RuneScape content. No content is out of reach.\r\n\r\nA Humourous Personality\r\nEvery inch of RuneScape is infused with a unique and distinctive sense of humour. Every quest, character and event embodies RuneScape’s celebrated witty charm.\r\n\r\nNever-ending Gameplay\r\nA pioneer of the MMORPG genre, RuneScape updates with new content almost every week so there’s always something fresh to look forward to.\r\n\r\nBrowser Based Gameplay\r\nPlay when you want, where you want. No downloads or installs required. As a free browser based MMORPG, RuneScape is quicker to play from anywhere connected to the Internet.",
  "banner_url": "/games/banner/runescape.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:31:04.768200Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 4746
}