{
  "name": "Darksiders Warmastered Edition",
  "slug": "darksiders-warmastered-edition",
  "year": 2016,
  "description": "Darksiders has players take on the role of War, one of the Four Horsemen of the Apocalypse, who has been tricked into bringing about a war between heaven and hell, resulting in heaven's defeat and the Earth's enslavement. Now stripped of his powers by the Charred Council, he must go to Earth and punish those responsible for deceiving him and causing the enslavement of Earth. As well as having to fight hell's minions, War has to contend with a group of vengeful angels that are bent on bringing him to justice. That way, not every important demon met in the game has to be defeated. War can make alliances with some of them when there are mutual interests.\r\n\r\nThe game has third-person hack-and-slash gameplay with a large variety in weapons and combos. These can be leveled up and are expanded with enhancements that provide active and passive abilities. Other actions include dodging, blocking, finishing off enemies with a special move, double jumping and gliding using wings, climbing ledges, throwing objects in the environment, and a mix of ranged-weapon and melee attacks. Defeating enemies provides blue souls. These can be exchanged with the demon Vulgrim at certain locations to acquire new attacks and items. Another important means of attack is Wrath. Enemies leave behind yellow clouds of this material and it is used to fill up a meter to perform special actions. Much of the game is spent fighting along with typical platform puzzle elements.\r\n\r\nThere are also sections with very different gameplay: flying in the air, fighting on horseback, and shooting angels out of the sky with a Redeemer ranged weapon. Levels are fairly linear, but all locations can be revisited afterwards later in the game through Serpent Holes. As War acquires new weapons and new means of attack, previously explored locations' walls of crystals can be shattered to find new items. During the game War gains the ability to fill a Chaos meter and change into his Chaos Form. He transforms into a large demon and can easily take out large groups of strong enemies for a short time.\r\n\r\nThe game encourages focused surveillance of the environment to retrieve hidden objects and chests, and many collectibles. Some of these are used to extend the health or Wrath meter, while others can lead to the forging of a very strong armor.\r\n\r\nDarksiders: Warmastered Edition is a remastered version of the 2010 game Darksiders, similar to Darksiders II: Deathinitive Edition as a new version of Darksiders II. For PlayStation 4, Wii U and Xbox One this is the first release of the game for the platform. For PC this is an updated release.\r\n\r\nThe gameplay itself is identical. This version has native 1080p rendering (console versions) and 4K support and additional video options (PC). The game runs in 60 FPS except for the Wii U version with 30 FPS. Visually there are doubled texture resolutions, improved and reworked rendering, better shadow rendering quality and new post-processing effects.",
  "banner_url": "/games/banner/darksiders-warmastered-edition.jpg",
  "icon_url": "/games/icon/darksiders-warmastered-edition.png",
  "is_public": true,
  "updated": "2020-09-28T23:20:14.494373Z",
  "provider_games": [
    {
      "name": "Darksiders Warmastered Edition",
      "slug": "1430901154",
      "service": "gog"
    }
  ],
  "steamid": 462780,
  "gogid": 1430901154,
  "gogslug": "darksiders_warmastered_edition",
  "humblestoreid": "",
  "id": 8959
}