{
  "name": "Farm Manager 2018",
  "slug": "farm-manager-2018",
  "year": 2018,
  "description": "Manage your own farm in the game Farm Manager 2018! Expand your farm business, produce cheap and sell your products at high prices. Control the land cultivation process, select the best employees, buy the most appropriate farm equipment, raise livestock and process the harvested crops. Various camera modes allow you to enter into a strategic view as well as to look at the world through the eyes of the employee. Respond to the changing weather and seasons. Create a greenhouse to sell crops in early spring. Buy new and used special agricultural machinery to quickly harvest and sell crops before their expiration date. Optimize costs and employ seasonal workers only during the harvest time. Accept challenges from neighbors to prove who is the best farmer in the area.\r\n\r\nYou do not want to cultivate typical wheat, don't you? Perhaps you would love to have an orchard with apples, strawberries or cucumbers? In Farm Manager 2018 you can have more than 20 different crops that you can cultivate by hand or using machines, where each harvest has a precise expiration date. Before you plant your seedlings, first remember about the proper preparation of the land for cultivation. Watch your plants as they grow from green, fragile seedlings up to the state of flowering, ripening and ready for harvest. Do not forget about watering in periods of drought. If plants are not cared for properly they become ill, lose their quality and eventually die.\r\n\r\nOn the machine market you can buy both new and used agricultural machinery. You have a choice between nearly 40 machines. Remember that cheaper, used machines can break down more quickly, especially when inexperienced employee operates the machine. Before buying your first agricultural machine, build a garage to ensure sufficient space to park it.\r\n\r\nA real farm is not just about agriculture fields. You can choose from more than 40 buildings, starting from farm buildings and barns to processing plants and factories. Has the plague affected your harvest? Maybe it is time to invest in a factory? Build a specialized factory to process what you have managed to grow. Produce juices and frozen food. Have you produced too much sheep's, cow's or goat's milk? Start producing cheese or butter, unless you prefer to switch your farm for the production of meat.\r\n\r\nThe cultivation of plants is not enough? Farm Manager 2018 allows for breeding animals. Starting from the smallest such as bees, rabbits or turkeys, but you can also breed goats and cows. Be sure to provide them with adequate animal feed and skilled caregivers. Raise newly purchased animals before they begin to produce eggs or milk. Bees love buckwheat and colza, so create fields with suitable plants nearby. When the animals get sick you will need to call the vet, and if you want to breed your animals, you'll have to call the inseminator.\r\n\r\nFace variable weather conditions such as drought or torrential rain and collect all the crops before the first frost and snow. Look for a rainbow during a gentle rain or watch the lengthening shadows, changing sunlight and color depending on the current season. At any time you can enter the photo mode to take spectacular shots of your farm bathed in warm autumnal colors, or in a dark scenery during a lightning storm in the background.\r\n\r\nFarm Manager 2018 offers 3 different game modes! You have a campaign, 15 scenarios and a free mode. The campaign will guide you through all major aspects of the game and learn how to properly manage the farm. Scenarios show how to deal with specific situations and tasks. In the free mode you will have complete freedom of actions that will enrich your tasks and contracts. Choose your favorite game mode, and let's do it!\r\n\r\nIf you miss any crop, machinery or building you can always make it by yourself, by simply adding to the game and share with other players. Shared standard components allow for faster creation of the target model. The expected object parameters can be set by selecting it in a clear form.",
  "banner_url": "/games/banner/farm-manager-2018.jpg",
  "icon_url": "/games/icon/farm-manager-2018.png",
  "is_public": true,
  "updated": "2019-02-09T21:49:24.444577Z",
  "provider_games": [],
  "steamid": 495560,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 17858
}