{
  "name": "Broken Sword II: The Smoking Mirror",
  "slug": "broken-sword-2-the-smoking-mirror",
  "year": 1997,
  "platforms": [
    {
      "name": "Sony PlayStation"
    },
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Adventure"
    },
    {
      "name": "Point-and-click"
    }
  ],
  "aliases": [],
  "description": "A human sacrifice awakens the Mayan God of Death.\r\n\r\nPlunge into a shadowy conspiracy world where the schemes of a mad drug kingpin and the prophesized return of an ancient Mayan god clash in what could be the end for all mankind. Race around the globe with George as he frantically attempts to free Nico, his investigative reporter girlfriend, from the clutches of Karzac's crime cartel. Guide Nico and George as they unravel the dark mysteries that lead them closer and closer to an ancient horror best left buried in the steamy jungles of Central America. Gather clues and make friends, but beware -- a smiling face can hide a deadly obstacle in your quest to stop the return of \"he who devours the sun and consumes the flesh of all mankind\", the mighty Mayan God, Tezcatlipoca.\r\n\r\n*    Battle against the evils of a criminal mastermind, solve enigmatic puzzles and stop a murderous Mayan God of Death from destroying the world in a masterfully crafted adventure featuring relentless action and alternating viewpoints between George and Nico at cliffhanger moments.\r\n\r\n*    Immersive 3D graphics and stylized animation combine to create a beautifully rendered environment as well as a trully cinematic feel.\r\n\r\n*    Explore the seedy underbelly of the world's most exotic ports of call, in this adventure steeped in historic fact.\r\n\r\n*    With three hours of original music and over 300 musical cues, this dynamic soundtrack swells and crescendos to heighten the drama of every move you make. ",
  "banner_url": "/games/banner/broken-sword-2-the-smoking-mirror.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:42.440706Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}