{
  "name": "Cautionary Tale",
  "slug": "cautionary-tale",
  "year": 2018,
  "description": "A parable about agency, and how three people choose to navigate it.\r\n\r\nCombined word count of 60k\r\nA bonus for completing all three games\r\nFully voiced dialogue\r\n22 original musical tracks\r\n\r\nThe three tales, each unique in their own right:\r\n\r\n Beyond Yesterday's Grasp\r\n\r\n\"When she is given a full scholarship to a prestigious boarding school, Alex Kartha feels hopeful for the first time since the accident that killed her parents and took her forearm. However, she soon realizes that old challenges cannot be easily ignored. Will you solve the mystery of Artemis Hall? Or will you turn away from your duty and value your life?\"\r\n\r\nFeatures branching narrative paths and five endings.\r\n\r\n- Let Go.\r\n\r\n\"Today is like any other Winter day. Snow's on the ground, there's a chill in the air, and Eli is about to confess to his childhood friend. Terrified of rejection, he practices his lines underneath a tree in the city, preparing for whatever may come. There's nothing to be afraid of - he's known her forever, right? But unbeknownst to him, something feels off… Hasn't he done this before?\"\r\n\r\nFeatures an evolving relationship, dark comedy and many first dates\r\n\r\n- If in Your Dreams; the Flood\r\n\r\n\"The Flood. That's all Ophelia can think about. Ever since she was a young child she dreamed of the water, slowly making its way, higher and higher. Now she's about to turn eighteen, and the flood will soon overtake her. In a desperate attempt to avoid her fate, she stays awake throughout the night, wandering the late Seattle cityscape. It's there that she meets an unfamiliar friend.\"\r\n\r\nGameplay order determined by choices.",
  "banner_url": "/games/banner/cautionary-tale.jpg",
  "icon_url": "/games/icon/cautionary-tale.png",
  "is_public": true,
  "updated": "2019-10-06T20:59:11.089202Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}