{
  "name": "Cannon Fodder 2",
  "slug": "cannon-fodder-2",
  "year": 1994,
  "description": "Welcome to Cannon Fodder 2. The hapless soldiers from the first game have been kidnapped by damn, dirty aliens, to see if they can save their own world from invasion. These aliens possess a time machine capable of transporting our not-quite-valiant troops to any period in human history, and they’re going to use it to test the chaps’ abilities in battle. Fortunately, for our boys in uniform, there’s an alien who sympathizes with their plight. He doesn’t agree with how the soldiers are treated and ensures that the ammo is plentiful. Only through the sheer will to live while remaining unventilated can our soldiers survive the grueling 72 stages and return to their own time, in one piece, mind you. Through five different time zones, they’ve got to battle against increasingly remote odds and kick their kidnapper’s butts. Only then can they retire to a place where the sun’s always shining and they serve drinks with those little umbrellas in them.\r\nGuide your stalwart troopers through time as they try to get through this war intact. Blending a perfect mix of action and small-scale strategy, Cannon Fodder 2 is simple yet very, very addictive. Capture vehicles such as the Choppa, the Jeep, and the Tank. Man any turrets you find while on the field of battle and turn the enemy’s weapons against them. Will you bring our boys back home?\r\n\r\n* War and time travel have never been so much fun!\r\n* Quick and furtive shooting action across a dangerous battlefield!\r\n* Easy to learn, difficult to master gameplay will ensure that you’ll always have a challenge!",
  "banner_url": "/games/banner/cannon-fodder-2.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-05-31T00:17:37.136541Z",
  "provider_games": [
    {
      "name": "Cannon Fodder 2",
      "slug": "1207659169",
      "service": "gog"
    }
  ],
  "steamid": null,
  "gogid": 1207659169,
  "gogslug": "cannon_fodder_2",
  "humblestoreid": "",
  "id": 6322
}