{
  "name": "Aliens versus Predator Classic 2000",
  "slug": "aliens-versus-predator-classic-2000",
  "year": 2010,
  "description": "Aliens Versus Predator Classic 2000 features the Colonial Marine, Alien and Predator Campaigns and the frenetic single-player Skirmish mode from the original title: Alien Versus Predator Gold Edition, which was released to massive acclaim in 2000.\r\n\r\nAlien Versus Predator Classic 2000 has been updated to run on modern PCs and laptops using DirectX 9.0c and includes support for Xbox 360 Controller.\r\nThe three most ferocious species in the universe in a bloodthirsty battle for the ultimate prize: survival. Take your pick: be a Colonial Marine, a Predator or an Alien. Fight through suspense-filled environments: from starships and space stations to colonial bases and eerie planetscapes. One wrong move turns you from hunter to prey.\r\n\r\n*    Three campaigns: Colonial Marine, Alien and Predator\r\n*    Includes all the levels from the original AvP Gold Edition plus the Millennium Expansion Pack\r\n*    Skirmish mode against infinite Alien hordes\r\n*    Bonus Episodes\r\n*    Unique abilities, weapons and equipment for each species\r\n*    Scale walls and elevator shafts as an ALIEN with frightening speed as you attack and devour your victims\r\n*    Stalk your prey as the deadly PREDATOR using wrist blades, shoulder cannons and stealth mode\r\n*    Lock and load as a COLONIAL MARINE using motion trackers, grenade launchers and flame-throwers to exterminate your foes\r\n*    Supports Xbox 360 Controller for Windows\r\n*    Music from the original soundtrack CD\r\n\r\nMultiplayer Features\r\n*    Host/Join games via bare-bones in-game lobby browser\r\n*    Game attempts host migration\r\n*    Dedicated servers are not supported or planned",
  "banner_url": "/games/banner/aliens-versus-predator-classic-2000.jpg",
  "icon_url": "/games/icon/aliens-versus-predator-classic-2000.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:34.004377Z",
  "steamid": 3730,
  "gogid": 1207665883,
  "gogslug": "aliens_versus_predator_classic_2000",
  "humblestoreid": "",
  "id": 1077
}