{
  "name": "Gears of War",
  "slug": "gears-of-war",
  "year": 2006,
  "description": "Gears of War is a 2006 military science fiction third-person shooter video game, and the first installment of the Gears of War series. It was developed by Epic Games and published by Microsoft Game Studios, initially as an exclusive title for the Xbox 360 in November 2006, before a Microsoft Windows version of the game, developed in conjunction with People Can Fly, was released a year later in 2007. The game's main story, which can be done in single or co-operative play, focuses on a squad of troops who assist in completing a desperate, last-ditch attempt to end a war against a genocidal subterranean enemy, and save the remaining human inhabitants of their planet Sera. The game's multiplayer mode allows up to eight players to control characters from one of the two factions in a variety of online game modes. Gameplay features players using cover and strategic fire in order to win battles.\r\n\r\nThe game proved to be a commercial success, selling over three million copies within ten weeks of its launch. It became the fastest selling video game of 2006, the second-most played game over Xbox Live during 2007, and the 6th best selling Xbox 360 game. Considered one of the seventh generation of video gaming's most significant titles, the game received universal critical acclaim for its gameplay and detailed visuals, with it winning over 30 \"Game of the Year\" awards in 2006. Its success led to the development of the Gears of War franchise, including the sequel Gears of War 2 in 2008, its follow-up in 2011, Gears of War 3,[1] a prequel in 2013, Gears of War: Judgment, and its latest installment in 2016, Gears of War 4. In addition, it has also spawned adaptations for books and comics, with a Gears of War film being currently developed.\r\n\r\nA remastered version of the game, entitled Gears of War: Ultimate Edition, was later developed primarily by The Coalition, and brought about a number of improvements to the game, including updates to the gameplay from later titles and enhanced graphics. Ultimate Edition was released for the Xbox One in August 2015, and to PC in March 2016.[2]",
  "banner_url": "/games/banner/gears-of-war.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-29T23:49:02.331213Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 23031
}