{
  "name": "Progress Quest",
  "slug": "progress-quest",
  "year": 2002,
  "description": "In what some might dub the logical conclusion of the statbuilding RPG genre, Progress Quest is a game that plays itself. Stripping away the flashy and distracting bells and whistles of things like graphics and sound, automated gameplay consists of three simple phases, stock components of any game in its genre: 1) going into the killing fields to slay monsters; 2) returning to town to sell plunder looted from the monsters' corpses; and 3) using the resultant lucre to upgrade one's equipment, so as to more effectively facilitate the efficient slaughter of further monsters. Abstracting things away from even a nominal Nethackian 2D textmode depiction, Progress Quest instead represents all these goings-on as a series of progress bars, gradually but irrevocably filling up until they tick over and place checkmarks in task boxes.\r\n\r\nEffectively a monotonous, game-themed screen saver with all the excitement of watching your hard drive defragment, developer Grumdrig has nonetheless instilled a great deal of subtle complexity into this title, it randomly generating enough missions of common types (Deliver, Seek, Exterminate, Placate) to keep the avatar diligently questing while the player eats, sleeps, or works, occasionally checking in to monitor the \"fire-and-forget\" game's progress. An impressive array of creative spell, treasure and equipment types await the stalwart player willing to invest the CPU cycles needed for the long haul -- as with Kingdom of Loathing, the pseudofantasy proceedings are tempered with a certain quantity of whimsy (available races, for instance, including the Panda Man, Land Squid and Enchanted Motorcycle, while class types include Puma Burgular, Tickle-Mimic and Tongueblade).",
  "banner_url": "/games/banner/progress-quest.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-12-27T23:52:21.166891Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 29959
}