{
  "name": "Objects in Space",
  "slug": "objects-in-space",
  "year": 2018,
  "description": "Objects in Space is a modempunk stealth space-trading game set in Apollo – a huge cluster of star systems dozens of lightyears away from Earth. You are a lonesome ship’s captain, buying and selling wares in order to keep your bucket of bolts afloat and stay one step ahead of pirates, organised criminals, corrupt governments and shady laws.\r\n\r\nCombat in Objects in Space sees ships treated more like submarines than dogfighters. You’ll be running silent, planning manoeuvres far ahead of time and engaging in deadly games of cat-and-mouse with nebulous enemies.\r\n\r\nYou will command your one-person ship from the captain’s chair. Encounters happen far outside visual range, so rather than close-quarters space shoot-em-ups, you’ll be poring over magnetic, gravimetric and radiation scanning arrays trying to locate tiny boxes of metal sometimes flying at millions of miles per hour massive distances away hoping against hope to get a missile lock.\r\n\r\nIt’s up to you to keep your ship’s systems running as quietly as possible, going fully ‘dark’ if you have to, just floating with your current trajectory and speed, hoping to avoid showing up on anyone else’s scanners as you traverse some of the most dangerous shipping lanes in space. Of course, one slight calculation error and you may veer off course, forcing you to leak highly detectable emissions to correct your mistake. Be careful.\r\n\r\nThe Apollo cluster requires absolute vigilance at all times. As you travel from one system to the next, trying to eke out a living, you’ll have to keep your eyes on your scanners at all times. You’ll have to differentiate in the blink of an eye between an asteroid and a hostile ship.\r\n\r\nYour ship is completely customised by you, down to the tiniest component of each module. If your battery craps out, it’s your own fault. You decided to go with a cheap Ventarii battery in the first place, and it was out of your stubbornness that you thought a Connext Hap Node built for an Enceladus cruiser without an adapter would be a good idea. Silly you.\r\n\r\nYou can play it safe in the central systems or design your ship with the ability to outrun, outfight or out-hide your opponents and make your fortune in the outer rims. But be careful! You are just as easily prey as predator in deep space…",
  "banner_url": "/games/banner/objects-in-space.jpg",
  "icon_url": "/games/icon/objects-in-space.png",
  "is_public": true,
  "updated": "2019-03-08T01:33:46.951846Z",
  "steamid": 824070,
  "gogslug": "objects_in_space",
  "humblestoreid": ""
}