{
  "name": "Friday the 13th: Killer Puzzle",
  "slug": "friday-the-13th-killer-puzzle",
  "year": 2018,
  "description": "Stalk and slay campers across 100+ puzzle levels with horror icon Jason Voorhees! From the campgrounds of Crystal Lake to the highrises of Manhattan, from supermax prisons to snowy ski resorts, Jason will terrorize victims across the world (and maybe even beyond).\r\n\r\nFriday the 13th: Killer Puzzle is developed by the makers of cult hit SLAYAWAY CAMP (5/5 -Rue Morgue, Touch Arcade, Gamezebo... \"The most ridiculously, absurdly, insanely over the top violent game I’ve ever seen.\" -Dread Central).\r\n\r\n    8 gut-wrenching “episodes” for over 100 puzzle levels!\r\n    See Jason like never before: Supermax Jason, Frozen Jason, Apocalypse Jason & More!!!\r\n    Traps! Cops! SWAT teams! Land mines! Rotary telephones! Teleporters! Cats!\r\n    Choose ‘R’ mode for dozens of gruesome Kill Scenes, or ‘PG’ for an almost family-friendly puzzle experience\r\n    Level up and unlock tons of horrifying murder weapons.\r\n    Trade in your rusty and unwanted weapons for shiny elite ones!\r\n    4 more DLC Expansions for 52 more puzzles, and 4 new Jasons! \r\n\r\nAfter more than a decade of making gems clink and pegs… peggle, PopCap co-founder Jason Kapalka founded Blue Wizard Digital to provide an outlet for ten years of pent-up violence and lust, with the goal of creating the sexiest violentest games EVARR. A cabal of degenerates soon shambled from their swampy dens to join this unholy crusade.\r\n\r\n----\r\n\r\nFRIDAY THE 13TH and all related characters and elements are trademarks of and © New Line Productions, Inc. and Horror, Inc. (each to the extent of their interest). Used with permission.\r\n\r\nFriday the 13th: The Killer Puzzle Game programming and content is ©2018 Forest Green Enterprises Ltd., a subsidiary of Blue Wizard Digital Inc.",
  "banner_url": "/games/banner/friday-the-13th-killer-puzzle.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:35.427570Z",
  "steamid": 795100,
  "gogslug": "",
  "humblestoreid": ""
}