{
  "name": "Call of Cthulhu: Shadow of the Comet",
  "slug": "call-of-cthulhu-shadow-of-the-comet",
  "year": 1993,
  "description": "In 1834, in the small New England fishing village of Illsmouth, the distinguished British scientist Lord Boleskine lost his mind. After studying ancient manuscripts of evil repute, he had travelled to this place to observe the passing of Halley's comet. What he observed that night, however, turned him into a raving lunatic. Now, 76 years later, Halley's comet is coming back, and young reporter John T. Parker has travelled to Illsmouth to try to uncover the truth in Boleskine's wild claims, and see the comet for himself.\r\n\r\nShadow of the Comet is a horror adventure game, inspired by the terrifying writings of H. P. Lovecraft. Contrary to many adventure games from the early 90s, the game has a keyboard driven interface with a system of actions activated either by pressing the corresponding key (L for look, G for get, T for talk, U for use) or selecting them from the menu activated by the TAB key. The CD release was enhanced with a mouse-driven interface. Typical for Infogrames titles (e.g. Eternam), the game contains vector-based cut scenes with enlarged graphics of the faces of the speakers during dialogues.\r\n\r\nThe GOG.com release of this game includes both Floppy and CD versions of the game. The main differences are new graphics, mouse-driven interface and full voice-acting whereas the Floppy version doesn't feature any voice-acting. The CD version's launcher screen additionally includes a Museum mini-game where character can walk through a museum and look at various mystical objects and paintings inspired by H. P. Lovecraft.",
  "banner_url": "/games/banner/call-of-cthulhu-shadow-of-the-comet.jpg",
  "icon_url": "/games/icon/call-of-cthulhu-shadow-of-the-comet.png",
  "is_public": true,
  "updated": "2019-10-12T23:40:26.254773Z",
  "steamid": 389470,
  "gogslug": "call_of_cthulhu_shadow_of_the_comet",
  "humblestoreid": ""
}