{
  "name": "Romancing SaGa",
  "slug": "romancing-saga",
  "year": 1992,
  "description": "Romancing SaGa (ロマンシング サ・ガ, Romanshingu Sa・Ga) is a role-playing video game originally developed and published by Square as the fourth game of their SaGa series. The game was designed by Akitoshi Kawazu who had served as head developer for the previous SaGa titles, with fellow series veteran Kenji Ito providing the game's soundtrack. Set in the fictional world of Mardias, Romancing SaGa allows players to assume the role of one of eight main characters who must journey across the world to prevent the resurrection of an evil god named Saruin who was sealed away a millennium previous.\r\n\r\nInitially made available in January 1992 for the Super Famicom, the game was later ported to the WonderSwan Color handheld system in December 2002, with both releases being exclusive to Japanese players. An enhanced remake of the title for the PlayStation 2 called Romancing SaGa: Minstrel Song (ロマンシング サガ -ミンストレルソング-, Romanshingu Sa Ga -Minsutoreru Songu-) was released in April 2005 in Japan, and in English for the first time in North America the following October simply under the title Romancing SaGa. In 2009, the original Super Famicom version was ported to mobile phones in Japan.\r\n\r\nThe Super Famicom version has been released on the Wii, Wii U and New 3DS Virtual Consoles in Japan. The PlayStation 2 version was released as a PS2 Classic for PlayStation 3 in Japan.\r\n\r\nThe original Super Famicom version sold over a million copies worldwide and was voted by readers of Japanese Famitsu magazine as the 53rd greatest game of all time in a 2006 poll. Conversely, the PlayStation 2 remake received largely mixed to average reviews in North America due to the game's high difficulty, steep learning curve, and questionable character designs.",
  "banner_url": "/games/banner/romancing-saga.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-03-22T07:23:59.495065Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 31731
}