{
  "name": "Homeworld: Deserts of Kharak",
  "slug": "homeworld-deserts-of-kharak",
  "year": 2016,
  "description": "HOMEWORLD: DESERTS OF KHARAK\r\n\r\nA ground-based RTS prequel to the classic Homeworld games. Assemble your fleet and lead them to victory on the shifting sands of Kharak in this compelling strategy game. Crafted by Blackbird Interactive, a studio founded by veterans of Homeworld and Company of Heroes, Homeworld: Deserts of Kharak takes players to the deserts of Kharak where danger lurks over every dune.\r\n\r\nEXPERIENCE AN ORIGIN STORY\r\n\r\nIn Deserts of Kharak’s campaign, an anomaly is discovered deep in the southern desert. An expedition is sent, but the story is not that simple. Discover the story of Rachel S'jet as she leads her people on a quest to find their destiny in an exciting campaign.\r\n\r\nHEAVY DUTY HARDWARE\r\n\r\nTake control of fleets of land and air vehicles – from nimble light attack vehicles to massive heavyweight cruisers – built to conquer the desert.\r\n\r\nMASSIVE ENVIRONMENTS\r\n\r\nFight your way across massive dune seas, deep craters, and hostile canyons in sprawling maps – all in unprecedented fidelity and scale.\r\n\r\nTACTICAL COMBAT\r\n\r\nPosition your fleet to take advantage of the high ground or create ambushes across dune lines in terrestrial combat. Attack your enemies’ resource operations, or assault their military head-on.\r\n\r\nSTRATEGIC DECISIONS\r\n\r\nMeaningful choices in resource management, fleet composition, and technology research directly impact your chances of survival.\r\n\r\nONLINE MULTIPLAYER\r\n\r\nCompete online solo or with friends in a variety of game modes, including ranked play, to rise through the ranks and become the most powerful Fleet Captain on Kharak.\r\n\r\nBefore you can find your Homeworld, you must first unlock the secrets of the desert.",
  "banner_url": "/games/banner/homeworld-deserts-of-kharak.jpg",
  "icon_url": "/games/icon/homeworld-deserts-of-kharak.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:45.086823Z",
  "steamid": 281610,
  "gogslug": "homeworld_deserts_of_kharak",
  "humblestoreid": "",
  "id": 5932
}