{
  "name": "An Elder Scrolls Legend: Battlespire",
  "slug": "an-elder-scrolls-legend-battlespire",
  "year": 1997,
  "description": "For years, you have trained to become an Imperial Battlemage, learning the ways of magic and combat to serve and defend the Emperor. Now, as your final test, you must complete the dreaded Battlespire, facing the challenges that lie within. As you enter the proving ground, however, something doesn’t feel right. You soon discover that Mehrunes Dagon, a Daedra Lord, has invaded and ravaged the Battlespire, killing all in his wake. You are the last hope and although ill-equipped and unprepared, it's up to you to stop Dagon’s plan and restore the Battlespire to Imperial control.\r\n\r\nOriginally envisioned as an expansion for The Elder Scrolls: Daggerfall, this installment was instead released by Bethesda as a stand-alone title. Although still within the Elder Scrolls world and brimming with many loved elements, Battlespire is unique in several aspects; rather than open-world exploration, the game emphasises survival, taking players through 7 levels, including various realms of Oblivion. There are also no shops or merchants, leaving players to salvage whatever they can from their fallen foes. Full character and stat customisation are still a key component of gameplay, as is the ability to craft spells on the fly and the game is full of the lore and characterisation for which the series’ is renowned. Can you defeat Dagon and prove you are worthy of serving the Emperor?\r\n\r\n* Traverse the world of Battlespire, from the depths of its sinister dungeons to the heights of its towering castles, in your quest to stop Mehrunes Dagon and his forces\r\n* Create your champion using the unique character design system, with unrivaled power to custom-build the exact type of hero you want, based on the Daggerfall game system\r\n* The custom SpellMaker system allows you to customise your own magic spells on the fly\r\n* Do battle with numerous fiendishly rendered original monsters and complete cunningly-crafted tactical challenges and action puzzles",
  "banner_url": "/games/banner/an-elder-scrolls-legend-battlespire.jpg",
  "icon_url": "/games/icon/an-elder-scrolls-legend-battlespire.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:21.785168Z",
  "steamid": null,
  "gogslug": "an_elder_scrolls_legend_battlespire",
  "humblestoreid": ""
}