{
  "name": "FPV Air 2",
  "slug": "fpv-air-2",
  "year": 2018,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Flight"
    },
    {
      "name": "Simulation"
    }
  ],
  "aliases": [],
  "description": "About This Game\r\nFPV Air 2 is a quadcopter racing simulator for serious FPV racing pilots wanting a tool for meaningful flight practice. Don't let rain or lack of daylight keep you from practicing!\r\nWe have listened and learned from the mistakes of the first version of FPV Air, this sim addresses the major issues and solves all of them!\r\nMost realistic flight physics\r\nThrough closer involvement in the FPV racing scene and inceased flight practice using the latest FPV quad's we have come up with a flight model that matches the feel and physics of modern FPV racing better than any other sim\r\nMost customizable flight physics\r\nDepending on the power and weight of quad a pilot is used to flying, a realistic flight experience can vary greatly from person to person. The flight model has been made accessible to users via an array of variables and parameters which pilots are free to tune and tweak. This allows pilots to match perfectly the expected performance. No other sim allows users to alter the physics of the flight model in such depth and magnitude\r\nBest possible performance on low-end machines\r\nThe sim has been tested and runs with a steady framerate on a US$200 laptop! Many FPV racers don't have high-end gaming rigs, so unlike all the others, FPV Air 2 is not super resource intensive, this sim aims to allow players on huge range of computers to fly smoothly!\r\nConfigurator\r\nRates, expo and other flight controller settings are all done through a familiar configurator interface based on the popular Betaflight interface. The sim uses the same rate calculations so there's no need to convert figures, simply enter the values into the menu as they appear in Betaflight and you can expect the sim quad to behave just like your real quad!\r\nQuick easy Control Setup\r\nThe radio control configuration step of FPV sims is natoriously problematic, using a combination of input methods and automatic device detection we have tried to make that step as easy as possible (if even nescessary at all!)\r\nOnline Multiplayer\r\nEasily host or join online games with the push of a button, no need to forward ports or perform any complicated setup\r\nMore!\r\nBest lap recording, race against your fastest self.Online global leaderboards\r\nLens warping/distortion aproximation\r\nRealistic analog video effects\r\nDiverse tracks to test and improve a wide range of racing manoeuvres\r\n\r\nFPV Air 2 is the definitive quadcopter racing simulator for professional flight practice!",
  "banner_url": "/games/banner/fpv-air-2.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-03-28T06:58:04.602893Z",
  "steamid": 889040,
  "gogslug": "",
  "humblestoreid": ""
}