{
  "name": "Armed Police Batrider",
  "slug": "armed-police-batrider",
  "year": 1998,
  "description": "Armed Police Batrider is a top-down vertically scrolling shoot'em up of the manic shooter subcategory taking place in futuristic Manhattan.\r\n\r\nIn 2019, Manhattan has been expanded by an artificial Island called Zenovia, owned by GiganTech Cybertronics Corporation. While GiganTech claimed this to be a new safe place in regard to the the rest of crime-infested future Manhattan, in reality crime grew even more so on Zenovia, to the point where it became a slum except for the GiganTech headquarters. Even worse, government investigations revealed that GiganTech itself is one of the biggest organized crime syndicates, testing their robotic weaponry on Zenovia to become the sole power of the underworld. Government authority is too weak against the mechanical forces that GiganTech commands, therefore nine fighters called \"Zero-Cops\" - three police, three convicts, and three psychics - have been drafted to invade Zenovia, riding Batrider called airbikes .\r\n\r\nYou control these teams. You can choose up to three of nine standard characters plus another nine unlockable characters from the previous Raizing games Mahou Daisakusen and Battle Garegga. Gameplay takes place across up to seven stages, with a varying number of bosses depending upon the player selection and whether certain hidden tasks have been performed during gameplay. During advanced course, it is possible to fight as few as seven or as many as all eighteen of the game's bosses. Small and Large Shot powerups, Option powerups and medals drop frequently from popcorn enemies, and fall down off the screen from where they spawn. Extra lives are granted every 1,500,000 points.",
  "banner_url": "/games/banner/armed-police-batrider.jpg",
  "icon_url": "/games/icon/armed-police-batrider.png",
  "is_public": true,
  "updated": "2020-05-26T03:31:55.165231Z",
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 7982
}