{
  "name": "Dying Light 2",
  "slug": "dying-light-2",
  "year": 2020,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "RPG"
    }
  ],
  "aliases": [],
  "description": "It’s been 15 years since humanity lost to the virus.\r\n\r\nThe last great human settlement exists within an unforgiving, infected world, plunged into a modern dark age. During the day, bandits, factions and starving survivors roam the streets scavenging for scraps - or someone to take them from, by violence if necessary. At night the infected roam free, evacuating their dark hideouts to prey on the living.\r\n\r\nYou are Aiden Caldwell, an infected survivor. Your exceptional agility and brutal combat skills make you a powerful ally and a valuable commodity in this dangerous world. You can achieve things no one else can. Enter places no one else dares. With your unique abilities you have the power to be an agent of change within this decaying metropolis.\r\n\r\nThe fate of the city is in your hands.\r\n\r\nYOUR CHOICES, YOUR WORLD\r\n\r\nYou must make tough decisions and hard sacrifices as you decide the fate of a society on the brink of collapse. The effect of the choices you make will have a huge impact on entire regions of the city, uncovering new land masses and areas to explore.\r\n\r\nEXCEPTIONAL AGILITY AND BRUTAL COMBAT\r\n\r\nOn your journey from humble beginnings to a person of great power, you have unprecedented freedom of movement across the city, seamlessly integrated with brutal first person combat.\r\n\r\nA MODERN DARK AGE\r\n\r\nIn a desperate city, where resources and power are scarce, unstable, and trust in ruling bodies is all but eroded; humankind has reverted to a dark age. Civilization is gone but the relics are still there. This is a violent, primal & unforgiving world - and so are its inhabitants.\r\n\r\nTHE INFECTION HAS EVOLVED\r\n\r\nThe infection has evolved and become more sensitive to UV light. Society exists in the relative safety of sunlight, while the infected hide in the shadows of buildings. At night the infected roam the streets freely searching for prey, presenting opportunities for you to explore areas of the city inaccessible by day.\r\n\r\n2-4 PLAYER CO-OP GAMEPLAY\r\n\r\nPlay the entire campaign in up to four-player co-op. Host your own games or join other players’ and see how their choices have played out differently to your own and how they have shaped their world differently to yours.",
  "banner_url": "/games/banner/dying-light-2.jpg",
  "icon_url": "/games/icon/dying-light-2.png",
  "is_public": true,
  "updated": "2019-06-13T16:11:25.758174Z",
  "steamid": 534380,
  "gogslug": "",
  "humblestoreid": ""
}