{
  "name": "Europa Universalis IV",
  "slug": "europa-universalis-iv",
  "year": 2013,
  "description": "Europa Universalis IV gives you control of a nation to guide through the years in order to create a dominant global empire. Rule your nation through the centuries, with unparalleled freedom, depth and historical accuracy.\r\n\r\nThe experiences of true exploration, trade, warfare and diplomacy will be brought to life in this epic title rife with rich strategic and tactical depth. Prepare to join a worldwide community of over half a million players and experience the drama and tension that only the grand stage of history can provide. Following on the success of the critically acclaimed strategy/RPG Crusader Kings II, Paradox Development Studio is ready to take you to worlds both old and new – each yours for the taking. \r\n\r\nFeatures:\r\n* Make your own decisions: Nation building is completely flexible and the possibilities are endless.\r\n* Bring out your negotiating skills in a deeper diplomatic system: Use coalitions, royal marriages and support for rebels and explore the possibilities of the new unilateral opinion system.\r\n* Use your Monarch Power: Experience the new system of monarch power where your choices are influenced by the caliber of the man you have at the top and will direct the ebb and flow of gameplay.\r\n* Experience the all new trade system: The trade system adds a new dimension to the great trade empires of the period. Gain control of vital trade routes and make the wealth of the world flow to your coffers.\r\n* Experience history coming to life: The great personalities of the past are on hand to support you as you make your mark on thousands of historical events\r\n* Turn the world into your playground: Enjoy hundreds of years of gameplay in a lush topographical map complete with dynamic seasonal effects.\r\n Engage in Cross-platform Multiplayer: Battle against your friends or try the co-operative multiplayer mode that allows several players to work together to control a single nation with up to 32 players. Featuring hotjoin, improved chat, new matchmaking servers and support for a standalone servers. \r\n* Create your own history & customize your game: Europa Universalis IV gives you the chance to customize and mod practically anything your heart may desire and uses Steam Workshop.",
  "banner_url": "/games/banner/europa-universalis-iv.jpg",
  "icon_url": "/games/icon/europa-universalis-iv.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:25.792046Z",
  "steamid": 236850,
  "gogslug": "",
  "humblestoreid": "",
  "id": 685
}