{
  "name": "Kawasaki Superbike Challenge",
  "slug": "kawasaki-superbike-challenge",
  "year": 1995,
  "platforms": [
    {
      "name": "Sega Game Gear"
    },
    {
      "name": "Sega Genesis / Mega Drive"
    },
    {
      "name": "Super Nintendo"
    }
  ],
  "genres": [
    {
      "name": "Racing"
    }
  ],
  "aliases": [],
  "description": "Created to give you the control and feel of motorcycle racing with amazing speed and handling, \"Kawasaki SuperBike Challenge\" takes you to the world of international competition. Start with your bike, an exact replica of Kawasaki's hot Ninja(TM) ZX-11 all the way down to its legendary mean-green paint job. Now select your racing caliber: Novice, Amateur, Professional, or do you dare compete as Expert! Select your race mode. Go solo, race with a buddy in 2-player mode, or face off with a computer opponent. Feeling really hot? Race in \"Turbo\" for an all out show-down at the fastest speeds.\r\n\r\nPick your poison. There are 14 real international racing circuits from which to choose. There's Monza, Italy; considered a lightning fast circuit by the pros. They'll also tell you the key to this race is in the Parabolic corner; get this right and you will reach fantastic speeds for a winning time. Or try Sweden's Anderstorp track. It sports a good mix of fast straights and tight corners that present plenty of overtaking opportunities for the observant rider. Britain, Spain, Australia and more, they're all yours for the racing. Or go for the awesome and grueling Suzuka 8-hour endurance course, complete with night riding and rider changeovers.\r\n\r\nNo matter where you choose to race, you'll want to work on strategy. Check out the track terrain and layout; a tight sequence of turns might change your mind on high gear ratios. Weather conditions take on new meaning as you select tires for maximum traction and reduced wipe outs. Pit stops, gas consumption, tire wear, qualifying laps, and sustained bike damage are all part of the race. Outsmart, outpace, and outrace the competition as you build your international motorcycle racing reputation and become the Kawasaki challenger!",
  "banner_url": "/games/banner/kawasaki-superbike-challenge.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:02.627575Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}