{
  "name": "Franchise Hockey Manager 4",
  "slug": "franchise-hockey-manager-4",
  "year": 2017,
  "description": "Franchise Hockey Manager 4 is the deepest, most authentic hockey strategy gaming experience you can find. The game is the only PC/Mac game officially licensed by the NHL®, allowing you to take the reins of your favorite franchise to capture the Stanley Cup®.\r\n\r\nChoose one of 24 leagues around the globe and select a team to guide to glory - or create your own hockey universe, or choose a historical NHL® start date as far back as 1917. Sign free agents, trade players, draft the next crop of superstars, and much more!\r\n\r\nThis is as close as you'll get to sitting in a General Manager's office without drawing a paycheck from a team. Oversee team finances, keep an eye on the salary cap, hire your staff, put together trade packages, make contract offers to free agents, and draft the newest generation of stars.\r\n\r\nNew features in FHM 4:\r\n\r\n2017-18 team rosters\r\nTake over a team in one of over 24 playable leagues that feature real current rosters based on countless hours of detailed research into player ratings. In addition to the National Hockey League® license, which gives FHM 4 real logos, uniforms, and histories for all 31 teams, the game features North American minor leagues, Canadian major junior leagues, and multiple levels of European hockey leagues.\r\n\r\nVegas, baby!\r\n\r\nYes, you can roll the dice with the new NHL® expansion team, the Vegas Golden Knights™. Take control of the team as it was built through the expansion draft or return those players to their original teams and remake the Golden Knights™ according to your strategic vision.\r\n\r\nUnprecedented customization\r\n\r\nFHM 4 features even more ways to set up a league. In additional to pre-configured structures, choose the number of conferences and divisions in your league, its schedule length, and the number of teams.\r\n\r\nThe most hockey ever\r\n\r\nTravel as far back as the 1917-18 season and enjoy historically accurate rosters, including the early major leagues in western Canada! FHM 4 puts more hockey history at your fingertips than any game ever released.\r\n\r\nIn addition, try one of FHM 4’s 30 new historical challenges (one per NHL® team) and see if you can repeat, or improve on, such successes as Montreal’s 1950s dynasty, Philadelphia’s 1970s expansion wins, and Vancouver’s wild ride to the 1982 Stanley Cup® Final!\r\n\r\nChallenge Mode\r\n\r\nYou can also put your hockey smarts to the test in the modern day with Challenge Mode, a new twist that pushes you to compete and win even when the odds are stacked against you. It’s a spin on the popular Path to Glory Mode, which is now available in every aspect of FHM 4.\r\n\r\nCommissioner Mode\r\n\r\nYou can now take the top-level view in all game types and make changes as you see fit.\r\n\r\nWorldwide playable leagues\r\n\r\nTake the reins of a team in Austria, Belarus, Denmark, Slovakia, Poland, and other countries, in addition to returning favorites. FHM 4 also features a European Champions League and more international competitions than ever.\r\n\r\nStaggering detail\r\n\r\n    Many more new features include:\r\n    A new Hall of Fame system\r\n    Line chemistry\r\n    Player uniform number retirements\r\n    New postseason awards\r\n    Expanded statistical tracking, including single game records\r\n    In-game audio and visual enhancements\r\n    And much more!",
  "banner_url": "/games/banner/franchise-hockey-manager-4.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:34.760056Z",
  "steamid": 595420,
  "gogslug": "",
  "humblestoreid": ""
}