{
  "name": "Metroid Prime Hunters",
  "slug": "metroid-prime-hunters",
  "year": 2006,
  "description": "Metroid Prime Hunters is a first-person action-adventure video game published by Nintendo and developed by its Redmond-based subsidiary Nintendo Software Technology for the Nintendo DS handheld game console. It was released in North America in March 2006, with other territories later. It is a part of the Metroid series, and the story takes place between the events of Metroid Prime and Metroid Prime 2: Echoes. Players assume the role of series protagonist Samus Aran, a bounty hunter who investigates a mysterious message that originated from the Alimbic System.\r\n\r\nThe game contains more first-person shooter aspects than the previous titles in the Metroid Prime series, with removal of assisted aiming, more action-oriented gameplay, and various multiplayer modes. It was created to utilize the Nintendo DS hardware, such as Wi-Fi and voice chat capabilities, and introduced other bounty hunters with unique weapons and alternative forms. Metroid Prime Hunters was announced by Nintendo at the 2004 Electronic Entertainment Expo. A pack-in demo version of the game, titled Metroid Prime Hunters: First Hunt, was included with the Nintendo DS when it launched in November 2004.\r\n\r\nReviews were generally favorable towards the game; praise focused on its gameplay and graphics, while criticism targeted its control scheme. It also received several honors; including an \"Editors' Choice\" award from IGN, which also named the game the \"Best DS Action Game\" of 2006, while Nintendo Power gave it awards for \"Best Graphics\", \"Best Shooter/Action Game\", and \"Best Wi-Fi Functionality\". Over 410,000 copies of the game were sold in North America in its first month of release, and it was the fourth best-selling game during its debut month in Japan. Metroid Prime Hunters was re-released on the Wii U's Virtual Console service in Japan in 2015, and in North America and Europe the following year.\r\n\r\nLike the previous titles in the Prime series, Metroid Prime Hunters is generally classified as a first-person adventure to highlight the focus on navigation and discovery. However, the game differs from its predecessors with the removal of assisted aiming, more action-oriented gameplay, and the inclusion of an online multiplayer mode.[1] The player controls Samus Aran, who is equipped with a Power Suit that allows her to access her gunship from anywhere. She can scan almost any object in the game; the gunship will return relevant information retrieved from its database. An Arm Cannon is attached to the Power Suit, which she uses to attack enemies. To enter small tunnels, Samus can roll into a Morph Ball, an alternative form of the Power Suit that decreases her size substantially. In this form, she is given an unlimited supply of bombs but is only allowed to use three at a time. She can use the bombs to defend herself and destroy small objects.[2][3]\r\n\r\nIn Metroid Prime Hunters, the Nintendo DS's top screen shows Samus's HUD as seen from her visor, which displays the amount of remaining ammunition for the currently selected weapon along with her health; in multiplayer games, the number of kills and time remaining in the round are also shown. The bottom touchscreen displays the radar.[2] When using the default control scheme, movement is controlled using the D-pad, and aiming is controlled by dragging the stylus along the touchscreen.[2][3]\r\n\r\nMetroid Prime Hunters features a multiplayer mode that supports up to four players and includes voice chat capability. In it, the player is able to control Samus or one of six other bounty hunters featured in the single-player mode.[4] Each bounty hunter has a unique alternative form, such as Samus's Morph Ball, and a special weapon. The game host can set options for point and time limits, and restrict the use of radar. Computer-controlled players of varying skill levels can be added to games if the minimum of four players is not met",
  "banner_url": "/games/banner/metroid-prime-hunters.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:22.562745Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13987
}