{
  "name": "Battlefield: Bad Company",
  "slug": "battlefield-bad-company",
  "year": 2008,
  "description": "Battlefield: Bad Company is a war-themed first person shooter and the second in the series developed exclusively for the console platforms. The title refers to a a group of the 222nd Army battalion of soldiers considered hard to steer and incompetent troublemakers. As such, they do not receive much respect in battle and squad of four decides to desert to pursue their own goals. The war takes places in fictional countries in the Middle East and the US squad takes on Russians, soldiers of the Middle East coalition and Legionnaire mercenaries. The player controls protagonist Preston Marlowe. His squad members are Terrence Sweetwater, George Gordon Haggard Jr. and the leader Samuel Redford.\r\n\r\nMarlowe has a health injector he can use as many times as he desires to restore his health. When dying, he also respawns immediately at the last location. Players can only carry a maximum of four weapons at any given time. There are many vehicles to drive, such as hummers, buggies, boats, tanks, boats and even helicopters to control. The storyline takes the characters through different fictional countries with mission where their background and motivation is gradually revealed.\r\n\r\nThe new Frostbite DX engine makes it possible to destroy many objects and buildings, almost to completely demolishing them. This changes the way the environment can be used as a cover, as everything can be destroyed. The multiplayer portion features games with a ranking system where items and weapons are gradually unlocked. The base game includes only one mode, Gold Rush, with teams of attackers and defenders.\r\n\r\nThrough five events such as describing to the newsletter, pre-ordering the game or reaching a certain rank in the demo, players could receive player codes to unlock five new weapons: F2000 assault rifle, USAS-12 semi-automatic shotgun, M60 light machine gun, QBU-88 sniper rifle and the silenced UZI submachine gun.",
  "banner_url": "/games/banner/battlefield-bad-company.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-09-11T17:29:21.574724Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}