{
  "name": "Breathedge",
  "slug": "breathedge",
  "year": 2018,
  "description": "Breathedge is an ironic outer space survival adventure game. Take on the role of a simple guy who just carried his grandpa's ashes to a galactic funeral and found himself in the middle of a universal conspiracy.\r\n\r\nWelcome to Space\r\n\r\nA massive space hearse suffers a wreck in the deep space, leaving the area filled with debris, coffins, dead passengers and yourself. Survive in this interstellar dump, uncover a global conspiracy, save the princess and don’t break your fingers while tapping the keyboard as you travel around the world (keeping your display on for full immersion is advised).\r\n\r\nMore Flotsam and Jetsam!\r\n\r\nIt took a long time for our ancestors to develop because they had no duct tape. You have it and you know how to use it. With this magical artifact, you can create a vast variety of useless objects and throw them out the airlock! There are also many useful items to be created, but be careful as this may result in completing the game.\r\n\r\nFix and Decorate\r\n\r\nWhen all the people around you just hover around in the vacuum doing nothing but playing dead, various tools and gears will help you become the worst noisy neighbor ever. Create a unique space station, provide it with oxygen and electricity, install all kinds of equipment from solar panels to hamster farm, and turn it into a real bachelor pad by stuffing it with furniture mixed with all kind of junk.\r\n\r\nHonk! Honk!\r\n\r\nYes, you heard that right, it’s your own private car horn! Besides that, you can assemble a small rocket, ride the dead or build a large space shuttle. Transportation helps you move faster, evade obstacles and see the death screen after a head-on collision.\r\n\r\nPrologue, Epilogue, and Other Nonsense\r\n\r\nSurviving in space is fun, and surviving with a story is even more fun because you can just skip it all to annoy the scriptwriters! Breathedge offers you an intriguing plot with lots of dark jokes, cynical dialogues, an immortal chicken, a mad enemy, as well as badly animated cutscenes and other features of an excellent game.",
  "banner_url": "/games/banner/breathedge.jpg",
  "icon_url": "/games/icon/breathedge.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:36.692352Z",
  "provider_games": [
    {
      "name": "Breathedge",
      "slug": "2104548474",
      "service": "gog"
    }
  ],
  "steamid": 738520,
  "gogid": 2104548474,
  "gogslug": "breathedge",
  "humblestoreid": "",
  "id": 22208
}