{
  "name": "Alys vs. the Phantom Feline Foe",
  "slug": "alys-vs-the-phantom-feline-foe",
  "year": 2016,
  "description": "An adventure game in the style of an early 90's Sierra adventure with a lewd twist! Alys is trapped in Bizarro World. Help her escape or she shall be trapped forever as the unwilling sex slave of Ignatius Cat, the Phantom Feline Foe.\r\n\r\nI am called BeardFacePixelHead, and I've wanted to create games since I was a kid. Problem is, I've never had the drive to actually put the work in, and despite a failed attempt at going to art school to attain a Bachelors of Science in Game Design, decades have passed without anything ever getting finished.\r\n\r\nThe dream lives on though, and I thought a game jam might be the kick in the pants needed to actually finish something.\r\n\r\nI've thought that making a lewd game was a good idea since I downloaded my first hentai game True Love on a dial-up connection as a teenager. Maybe it wasn't a good idea after-all, but here it is anyway. I think I got the idea out of my system, and my next title should be decidedly less lewd.\r\n\r\nI started this project with one goal in mind, finish a game at any cost, no matter how terrible. Well, I feel the results are pretty bad, but maybe you'll disagree. I met my goal though. I created a game. I finished it. It's here. It's real. I'm a game designer, just not a very good one.\r\n\r\nThis game should take you about 15 minutes to play to completion, maybe longer if you struggle with some of the puzzles. None of them are very hard, so keep at it. Just try everything on everything if you hit a wall, in the classic Sierra adventure style.\r\n\r\nThank you so much for spending your precious time trying my first actually completed project. If this goes well, maybe I'll keep at it, and you'll see more out of me. Thanks again, and enjoy.",
  "banner_url": "/games/banner/alys-vs-the-phantom-feline-foe.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:28:20.217784Z",
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 12228
}