{
  "name": "Origin Online",
  "slug": "origin-online",
  "year": 2018,
  "description": "Origin Online is an MMORPG (Massively Multiplayer Online RPG) that deeply immerse the player into ancient Chinese, Arab, and European civilization. The Silk Road, was a major cultural and economic trading gateway, with ancient roads connecting Asia and Europe. Origin Online will relive this forgotten history of glory and adventure.\r\n\r\nOrigin Online is an active world unlike other MMORPGs which have fixed contents. In the spacious roads of Origin, Merchants take chances in adventure while Thieves intend to strip them of their goods. Although, there are great risks in trades, Hunters will be there to protect traders and to end the mischief of thieves. The constant life is founded on the trades and the challenges that it bring, forming various bonds, goals, and dreams thus giving a world full of life.\r\n\r\nThere is no fixed job on the Origin. All players can freely promote themselves to any jobs to improve the growth of their characters. Changing to Hunter and Thief alters the will and destiny of the players.\r\n\r\nPlayers will have first hand experience of whole new world waiting to be explored, with fun-filled and ever progressing adventures.\r\n\r\nThe servers were designed to have seamless and parallel worlds to accommodate large group of users without delay, also offer more content with minimal loading time. To top it off, characters were designed with natural movements, blended with dynamic animation techniques thus providing uniqueness to every character.\r\n\r\nThe Silk Road is open to you. It is entirely up to you whether you want to earn money through the trade, become the lone wolf which will pound the vast continent which is full of bandits or play an active role as a guardian who will safeguard peace in Silk Road.\r\n\r\nCharacteristics\r\n\r\nOrigin Online is designed to re-enact the Silk Road trades of 7th Century through the use of being a MMORPG.\r\n\r\n1. Fantasy World\r\nEncounter of the East fantasy and the West fantasyOrigin Online features Western European, Eastern Chinese, and Arabian Fantasy, and is based on the ancient cultures and legends of China, Egypt, and Europe.\r\n\r\n2. Quest System\r\nEpisode-centered quest system-->The episode-pattern scenario is written in the background of mythologies and legends of a lot of countries including Xiyouji, Arabian Night's Entertainment and Greek mythology. The player often flies about with the magic carpet, see the Mediterranean evening sun or fight desperately with ghosts in crossing over Huang He River. On the basis of such a variety of scenarios, you can take pleasure in the inimitable quest each time with the feeling of seeing one-act play.\r\n\r\n3. Multi-Community\r\nOrganization of various communitiesBeyond the general guild associations which binds the community, there are various systems to organize players in-game. These organizations draw the players who revolves around the Oasis, like the Thief guild that congregates all thieves and Hunter Guild that gathers all the protectors of justice. The confrontation among these guilds enkindles exciting showdown among the players.\r\n\r\n4. Skill System\r\nUnique and fresh skill systemLike the Chinese characters who use the flying walk to float on the water surface and leaves an afterimage when moving, the European characters who use the power of Greek gods like Zeus or Apollo and the Arabian characters who can freely control the power of lamp elves, these fresh and unique skills were unfolded and cannot be seen in the other existing games.\r\n\r\n5. Real Action Battle System\r\nRealistic and vigorous action battlePlayer will experience realistic and exciting long battles without any hesitation. A battle system that has been well-developed, with a fast gameplay similar to action games, like the swift chain attack skills of the Chinese, chopping and swerving skill effects and amazing effect as character increases its speed.\r\nEnjoy the battles which are full of thrills and non-stop action.\r\n\r\n6. The World gives a Movie Feeling\r\nMovie-like presentationThe presentation of a splendid world can be directly seen in the game, like the monsters that come out from a distance, the thieves running away kicking up dust, a hazy forest with smoke, a dungeon full of the hidden and dangerous materials and a natural environment like the total lunar eclipse.\r\n\r\n7. Breathtaking Dynamic Animation\r\nMore realistic character animationThe finespun dramatics are presented. With Dynamic Animation, players' actions display natural movements like use of force or swinging in the direction of the wind. Also, with motion blending techniques, characters can express simultaneous actions like shaking up in the battlefield while moving. The chain of movements are seamless resulting to perfect animation of human actions.\r\n\r\n8. Advanced interface system\r\nMore comfortable game environment The Silk Road expands from China to Europe as a background. There is no delay in loading time in between battles or in doing explorations despite the extensive maps connecting the Silk Road and in dungeons. In addition, Origin Online provides users with an interface optimized for full control of the players, and also features various slots for easy execution of skills in-game.",
  "banner_url": "/games/banner/origin-online.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-03-22T07:20:15.901589Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 31896
}