{
  "name": "NBA 2K20",
  "slug": "nba-2k20",
  "year": 2019,
  "description": "WELCOME TO THE NEXT\r\n\r\nNBA 2K has evolved into much more than a basketball simulation. 2K continues to redefine what’s possible in sports gaming with NBA 2K20, featuring best in class graphics & gameplay, ground breaking game modes, and unparalleled player control and customization. Plus, with its immersive open-world Neighborhood, NBA 2K20 is a platform for gamers and ballers to come together and create what’s next in basketball culture.\r\n\r\nBEST IN CLASS GAMEPLAY\r\n\r\nTake your skills to the next level with the most realistic player control ever, featuring an upgraded motion engine with signature styles, advanced shooting controls, a new dribble size-up system, refined off-ball collisions, and a new read & react defensive game.\r\n\r\nMyCAREER\r\n\r\nUp-and-coming visionary Sheldon Candis directs the most visually stunning MyCAREER cinematic experience to date. A star-studded cast including Idris Elba, Rosario Dawson, and NBA all-stars past and present bring the journey to life in a completely new and immersive way.\r\n\r\nTHE NEXT NEIGHBORHOOD\r\n\r\nExperience a more vibrant, active Neighborhood. Access even more 2K Compete Events, unlock animations with the new Show-Off Stick, play a round on the 9 hole Disc Golf course, and earn more exclusive gear than ever before.\r\n\r\nBRING YOUR GAME & REP UP\r\n\r\nThe Park remains the center stage where players hone their skills and battle to be the best. And with the return of Park Rep, everyone will know who’s legit and who needs a seat on the bench. Unlock exclusive items as you rep up, and use them on any of your MyPLAYER builds! Tons of new prizes available with the new and improved Rep system.\r\n\r\nMyPLAYER BUILDER\r\n\r\nMore control than ever before. The new MyPLAYER Builder allows you to make decisions on every aspect of your MyPLAYER’s potential, including choosing your own Takeover. With over 100 archetypes and 50 new badges, the combinations are nearly endless.\r\n\r\nWELCOME TO THE WNBA\r\n\r\nFor the first time, all 12 WNBA teams and over 140 players are in the game and ready to run in Play Now and Season modes. Complete with gameplay animations, play styles, and visuals built exclusively for the women’s game.\r\n\r\nMyTEAM\r\n\r\nNBA 2K’s fantasy card collector. Master MyTEAM with daily goals, card-leveling, a reimagined Triple Threat, limited-time events, and even more prizes. Enjoy a simplified user experience that both veterans and rookies will appreciate, and stay connected to the community with Locker Codes, Leaderboards, Developer Tips, Team of the Week, and more.\r\n\r\nDYNAMIC SOUNDTRACK\r\n\r\nIn collaboration with Steve Stoute and United Masters, this year’s soundtrack features a diverse array of top songs from both well-known and up-and-coming artists from across the globe.\r\n\r\nLEGENDARY TEAMS\r\n\r\nPlay with over 10 new legendary teams from the past, including the 2009-10 Portland Trail Blazers, 2015-16 Cleveland Cavaliers, 2013-14 San Antonio Spurs, 2002-03 Phoenix Suns, and All-Decade teams from every era of NBA history. Over 100 total legendary teams to choose from.\r\n\r\nNEXT LEVEL PRESENTATION\r\n\r\nDynamic, broadcast-quality gameplay presentation featuring the deepest roster of talent in sports videogame history, led by Kevin Harlan, Ernie Johnson, and many more. It’s an audio experience unlike any other, with over 60,000 new lines of dialogue, all-new studio shows and game intros, MyPLAYER interviews, records and milestone coverage, and over 2,000 arena specific crowd reactions and sounds.\r\n\r\nMyGM/MyLEAGUE\r\n\r\nThink you can build the next dynasty? Take full control of a franchise and develop a champion from the ground up. Featuring new skill trees, a revamped relationship system, simulator customization, revised scouting, and more.\r\n\r\n2KTV – SEASON 6\r\n\r\nHosted by Alexis Morgan & Chris Manning, NBA 2KTV returns for another season as the hub for all things NBA 2K. Featuring members of the 2K community, exclusive interviews with NBA & WNBA stars, the latest 2K20 news, tips & insights directly from developers, and your weekly Top Plays!",
  "banner_url": "/games/banner/nba-2k20.jpg",
  "icon_url": "/games/icon/nba-2k20.png",
  "is_public": true,
  "updated": "2019-10-28T00:21:18.414767Z",
  "steamid": 1089350,
  "gogslug": "",
  "humblestoreid": ""
}