{
  "name": "Blackhole",
  "slug": "blackhole",
  "year": 2015,
  "platforms": [
    {
      "name": "Linux"
    }
  ],
  "genres": [
    {
      "name": "Platform"
    },
    {
      "name": "Puzzle"
    }
  ],
  "aliases": [],
  "description": "BLACKHOLE is an animated 2D sci-fi hardcore platformer. Become a hero and discover the secrets hidden in a mysterious Entity. The world inside the black hole is waiting for you to explore it!\r\n\r\nWhen the crew of a spaceship called Endera is sucked into a black hole, it seems like it is the end. Fortunately, the ship crashes on Entity; an object resembling a planet. After the crash, the first member to wake up is the guy who made coffee for the crew. He discovers a copied artificial intelligence of the ship, Auriel, on his PDA. Together, they come up with a plan on how to fix their spaceship, save the survivors of the crew and become heroes of the planet Earth by shutting the black hole once and for all.\r\nMain features:\r\n\r\n*    Amazing places: Explore the colourful caves, a lost city of an ancient civilization, reach the skies in the Entity of huge mountains and have no fear to pass through a living jungle. Every step you make will be worth it!\r\n*    Change the gravity: Levels are designed in a unique way; turn the gravity in four different directions and reach places you had no chance to reach before. Every level is the same as the other four and it is only up to you to choose the best way in completing your quests.\r\n*    Beat the time: Your time in each level is recorded. You can share it with your friends afterwards. Find the fastest way to complete the level and earn the top spot in global charts.\r\n*    Full voicecast: Narrated by the best voice actors of the indie scene. Starring: Mark Whitten, Blake Swift, Kira Buckland, Edwyn Tiong, Anthony Sardinha, Martin Billany, Devon Talbott, River Kanoff, Marissa Lenti and more! Directed by Chris Niosi, the creator of \"TOME\" series and producer many internet videos.\r\n*    Captivating soundtrack: Made by composers Jakub Miřejovský and Jan Ševčík. Enjoy listening to strong melodies. Rhytmic drums, dynamic dubstep and fairytale orchestra will not keep you calm.\r\n*    Logic puzzles, action minigames: Pass through all the tricky traps and discover all the hidden secrets behind closing black holes.\r\n*    2D graphics in FULL HD: Animations and all the graphics are hand painted. Everything is prepared for the best gaming experience. Turn the world, laugh and compete for the best times in beautiful HD graphics! ",
  "banner_url": "/games/banner/blackhole.jpg",
  "icon_url": "/games/icon/blackhole.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:37.237264Z",
  "steamid": 322680,
  "gogslug": "blackhole",
  "humblestoreid": ""
}