{
  "name": "Afterfall InSanity Extended Edition",
  "slug": "afterfall-insanity-extended-edition",
  "year": 2012,
  "description": "Afterfall: InSanity is a survival-horror action game set in a post-apocalyptic world, the Afterfall universe. We are presented with an alternate timeline: Nazi Germany managed to create a nuclear bomb in early 1945, thus ending the war and forcing the allied forces into negotiations. A long period of cold war followed. Eventually, Germany detonated an experimental fusion bomb in 2012, starting World War III. The resulting nuclear mayhem forced survivors to hide in underground shelters.\r\n\r\nThe actual game takes place in 2035, many years after the apocalypse. Living in the underground facilities, deep down below the surface, has become normal. This unnatural way of live starts taking a toll on peoples' mental health, with an illness called Confinement Syndrome becoming common. Dr. Albert Tokaj, the protagonist, is a psychiatrist living in one of the underground shelters. He is interested in researching the syndrome and helping those affected, but he also experiences certain issues of his own (e.g. nightmares). When he is ordered to investigate \"people acting strange\" in another part of the shelter, the real horror begins. He has to face mutant monsters and insane inhabitants, find his way around the complex and try to make sense of the whole situation.\r\n\r\nAlbert can wield several kinds of melee weapons as well as firearms, but ammunition for the latter is scarce. Thus, hand-to-hand combat is important. He also has a flash light available. Strenuous actions like sprinting or melee attacks are limited in duration by the player's stamina, which is indicated by a corresponding bar on the HUD. There is also a mechanism called FearLock: If Albert's fear level rises beyond a certain threshold, FearLock kicks in and influences the way he performs attacks.\r\n\r\nThe game uses a 3rd-person perspective similar to titles like Dead Space. A PDA serves to keep track of objectives and other information.",
  "banner_url": "/games/banner/afterfall-insanity-extended-edition.jpg",
  "icon_url": "/games/icon/afterfall-insanity-extended-edition.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:13.303115Z",
  "steamid": 224420,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 504
}