{
  "name": "Planetary Annihilation",
  "slug": "planetary-annihilation",
  "year": 2014,
  "description": "Colonize solar systems, annihilate homeworlds, and exterminate your foes in epic interplanetary battles with multiple players and thousands of units. Planetary Annihilation takes strategy gaming to a never-before-seen scale -- and gives players powerful tools to control the action.\r\n\r\nBlow up everything, anywhere; dominate with punishing spacecraft, robots, and other futuristic machines of war. Arm asteroids and send them on planet-destroying collision courses. And take over an entire galaxy in a dynamic single-player mode with procedurally generated content. Don’t just win, annihilate!\r\n\r\nFeatures:\r\n*    Epic Single-Player - Galactic War is a twist on traditional real-time strategy campaigns that has players battling across a dynamic galaxy filled with procedurally-generated content. Every playthrough is different. Annihilation is final.\r\n*    Epic Multiplayer - Play with up to ten friends (or enemies) in massive free-for-all and team-based matches.\r\n*    Spectate And Broadcast - Spectate matches with a suite of incredible viewing options or broadcast with integrated Twitch.TV support.\r\n*    Advanced Command And Control - With intuitive drags and clicks, seamlessly switch between planets, mine resources, create custom unit formations, or pulverize armies.\r\n*    Dynamic Picture-In-Picture - View and interact with your units on another planet in a second window as you focus and control the action in your primary view.\r\n*    Instant Replays - View in-match recordings in real-time while matches are in progress. See when a battle turned by rewinding the game to any point or check out the entire match after a game ends.\r\n*    Smash Planets - Don’t just win, annihilate. End games with the mother of all weapons: an asteroid on a collision course. ",
  "banner_url": "/games/banner/planetary-annihilation.jpg",
  "icon_url": "/games/icon/planetary-annihilation.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:45.909202Z",
  "steamid": 233250,
  "gogslug": "",
  "humblestoreid": "",
  "id": 733
}