{
  "name": "BULLIED BRIDE",
  "slug": "bullied-bride",
  "year": 2019,
  "description": "To others Mei appears as a pretty gloomy girl. She hides her face behind her bangs and as a result often gets made fun of because of it. She says she likes it that length because it makes her feel closer to someone she admires or is it really because the stares of other people make her uncomfortable? Bond with her, get to know her, and who knows this bullied girl may end up becoming your devoted bride.\r\nOur story begins with Mei once again being picked on by a group of delinquents. However be it by chance or some strange twist of fate, you're there to witness the whole thing. In an effort to expose the bullies you end up getting suspended... Mei isn't someone to allow others to do such selfless things on her behalf and quickly joins you in suspension in an effort to return the kindness you've shown her.\r\n\r\nDescription\r\n\r\nFeatures:\r\nTranslated version of the original Japanese Visual Novel\r\nMei is fully voiced with original Japanese dialogue\r\nOriginal artwork HD upscaled with 16:9 and 4:3 variants\r\nHours of story content\r\nAudio including music and special effects\r\nEnhanced with character sprite animations\r\nGallery and Scene selections\r\n15 intimate scenes between you and your bullied bride.\r\nExperience Mei's growth from a gloomy girl into someone brimming with love and affection in this Japanese Visual Novel developed by Norn, we at Cherry Kiss aim to provide this authentic Japanese visual novel experience to gamers outside of Japan.\r\n\r\n** PLEASE NOTE **\r\nAll characters described and visually represented in this game are over 18 years of age, and no actual, nor identifiable minor was used in the production of this game.",
  "banner_url": "/games/banner/bullied-bride.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-08-29T22:41:36.766532Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 37562
}