{
  "name": "Hero of Allacrost",
  "slug": "hero-of-allacrost",
  "year": 2015,
  "description": "Hero of Allacrost is a single player 2D role-playing game inspired by classic console RPGs. The player will explore rich environments, solve challenging dungeon puzzles, and fight strategic battles in an active-time system. The game is distributed for free as open-source software and is available across several platforms including Windows, OS X, Linux, and FreeBSD.\r\nSetting\r\n\r\nHero of Allacrost takes place on the fictional world of Allacrost during a unique combination of a medieval setting and an age of exploration. The story follows the journey of Claudius, a knight who is given a perilous assignment by his king after his country was suddenly assailed by an unknown force of demonic beings. His mission is to search the world for a hero spoken of in legend that is said to be the key to bringing peace back to Allacrost. Claudius and his companions must piece together the clues left in the legend of the hero as they travel the world, while also unraveling the mysterious origins and purpose of the demons who continue to assault civilizations at random.\r\nDesign\r\n\r\nThree primary goals direct the design of Hero of Allacrost. Every feature in the game has been created with the intention of fulfilling one or more of these goals.\r\n\r\n    Prioritize efforts on developing an engaging gameplay and a compelling narrative\r\n    Eliminate tedious and micromanagement mechanics that are commonly found in RPGs.\r\n    Require the player to develop and employ strategies to progress through the game.\r\n\r\nMajor Features\r\n\r\nBattle Fatigue\r\nBattle fatigue serves multiple purposes to increase the engagement and strategy in battle. Here's a point-by-point summary of what battle fatigue is and how it works.\r\n\r\n    As a character receives damage, a portion of that is turned into health fatigue. Health fatigue reduces the character's maximum health.\r\n    As a character uses abilities, a portion of the skill required to execute that ability is turned into skill fatigue. Skill fatigue reduces the character's maximum skill.\r\n    Fatigue persists between battles, meaning that the maximum health and skill of their characters will continue to drop.\r\n    Fatigue is only restored by visiting an safe place, such as an inn, to rest.\r\n    At the end of every battle, each character's health and skill is restored to their maximum levels.\r\n\r\nBattle fatigue was designed in this way to meet a number of objectives. First, we wanted to remove the tediousness of requiring a player to visit the party menu immediately after battle to restore their characters as needed. Second, we wanted every character skill to be viable to use in any battle. Both high and low cost abilities should have their usefulness regardless of whether the party is facing a minor threat or a tough boss. Third, players should be penalized if they spam their most powerful attacks repeatedly every battle. Fourth, we want players to need to devise a strategy when entering a dungeon to manage fatigue so that they can survive.\r\n\r\nStatus Intensity\r\nStatus effects such as poison or haste have multiple degrees of intensity to reflect how much they cripple or aid a character or enemy in battle. A weak poison status may consume only 3% of a character's HP per turn, while the strongest poison can do damage as high as 20% of a character's HP. All status effects will weaken in intensity as the battle goes on and are immediately cured once a battle ends. The player must choose whether a status effect is severe enough that it must be treated, or if the smarter choice is to ignore the affliction and wait for the effect to neutralize itself naturally.\r\n\r\n \r\n\r\nSeamless Map Transitions\r\nAllacrost implements a system whereby multiple smaller maps may be contained within a single larger one. This allows, for example, a village where the player may instantly enter and leave a building with no load time or any other type of delay. NPCs can also move about between buildings, making environments feel more natural.\r\n\r\n \r\n\r\n \r\n\r\nBattle Damage\r\nAs characters and enemies take damage or heal, their portrait or sprite will gradually change to reflect their health. As a result, players will be able to gauge how weak their enemies are at a glance.\r\n\r\n \r\n\r\n \r\n\r\nPursuing Enemies\r\nThe player can see each enemy roaming the map and choose to engage the foe or slip past them. However, enemies will see when a player is close and give chase. If an enemy can sense that they are no match for the party of heroes, they will instead flee away. Revisiting a past area no longer means wasting time slaughtering enemies that are not worth the time.\r\n\r\n \r\n\r\nNarrative\r\nAllacrost strives to tell an intricate and deep narrative that is geared toward a mature audience. This is not another tale of fated teenagers who save the world. Characters are not one-dimensional nor are they static static. As the story progresses, a player will find their feelings toward a character change as they develop. This tale will keep you intrigued, entertained, and eager to find out what happens next.",
  "banner_url": "/games/banner/hero-of-allacrost.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:29:49.750701Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 19039
}