{
  "name": "Arma 2: Operation Arrowhead",
  "slug": "arma-2-operation-arrowhead",
  "year": 2010,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "FPS"
    },
    {
      "name": "Simulation"
    },
    {
      "name": "Tactical shooter"
    }
  ],
  "aliases": [],
  "description": "Three years after the conflict in Chernarus, portrayed in the original Arma 2, a new flashpoint explodes in the Green Sea Region. Coalition forces led by the US Army are deployed to Takistan to quickly restore peace and prevent further civilian casualties. \r\nYou will enlist into various roles within the US Army, from basic infantrymen, through special operatives, to pilots and tank crew in this new installment in the award winning line up of military simulators for PC from Bohemia Interactive. \r\nBuilding on 10 years of experience and constant engine development, Arma 2: Operation Arrowhead boasts the most realistic combat environment in the world. It models real world ballistics & round deflection, thermal imaging, materials penetration, features a realtime day/night cycle and dynamic wind, weather and environmental effects. \r\nNOTE:\r\nArma 2: Operation Arrowhead is a standalone product and does not require the original Arma 2.\r\n\r\n\r\nKey features:\r\n\r\nNEW PLAYABLE CONTENT: New story campaign for both SP and MP gameplay. Wide range of new tutorials, single scenarios and multiplayer modes. \r\n\r\nMASSIVE GAME WORLD: Three brand new Central Asia-style large maps including expansive urban, desert and mountainous terrain featuring a fully destructible and interactive environment. \r\n\r\nULTIMATE WAR EXPERIENCE: Fully integrates with the original Arma 2 for unmatched warfare simulation. \r\n\r\nUNIQUE GAMEPLAY ELEMENTS: Detachable backpacks with equipment, advanced weapon optics, material penetration modelling, remote real-time simulation of Unmanned Arial Vehicles (UAV), freedom of decision and repercussive actions. \r\n\r\nEXTRA UNITS AND VEHICLES: Multiple factions for all sides including US Army, United Nations, Takistani Army and Guerrillas making a collection of 300+ new units, weapons and vehicles. \r\n\r\nMISSION EDITOR: Design your own missions by the intuitive, easy-to-use mission editor and become part of one of the biggest and most creative PC gaming community ever. \r\n\r\nGAME MODIFICATION: Create Your own custom game content with complete editing tools suite (freeware SDK kit) and modify the game in ways where the only limitation is Your own imagination. \r\n\r\nEXTENSIVE MULTIPLAYER: Play the campaign missions in cooperative mode or join duty in the massive multiplayer battles with up to 50 players. \r\n\r\nCHEAT PROTECTION: Optional anti-cheat BattlEye (http://www.battleye.com) available to help secure dedicated servers. In addition BE adds 'RCON' (remote control) for game's dedicated server software. \r\n\r\nDEDICATED SERVER: To support smooth multi-player experience there is 'dedicated server software' available for Windows (included with game) and Linux (download-able from game's website). \r\n",
  "banner_url": "/games/banner/arma-2-operation-arrowhead.jpg",
  "icon_url": "/games/icon/arma-2-operation-arrowhead.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:25.096719Z",
  "steamid": 33930,
  "gogslug": "",
  "humblestoreid": ""
}