{
  "name": "Kirby: Mass Attack",
  "slug": "kirby-mass-attack",
  "year": 2011,
  "platforms": [
    {
      "name": "Nintendo DS"
    }
  ],
  "genres": [
    {
      "name": "Platform"
    },
    {
      "name": "Puzzle"
    }
  ],
  "aliases": [],
  "description": "Kirby Mass Attack is a puzzle platformer game in the Kirby series developed by HAL Laboratory and published by Nintendo for the Nintendo DS, which released worldwide in 2011. The game was briefly mentioned at the end of the Nintendo E3 2011 press conference.\r\n\r\nLike Kirby: Canvas Curse, the player does not directly play the game with a directional pad, face buttons, or shoulder buttons. Instead, the player only uses the stylus and touch screen on the DS to play the game. The game is played by using the stylus to command up to ten Kirbys on the screen. Tapping the screen creates a star that the Kirbys can follow or cling onto. By tapping enemies or obstacles on the screen, players can send multiple Kirbys to attack them, with the player also able to flick individual Kirbys as projectiles. By collecting pieces of fruit throughout the level, the player can gain up to ten controllable Kirbys, which allow players to tackle enemies and obstacles more easily than with one Kirby. Each level often requires a minimum number of Kirbys to enter, and some puzzles will require all ten Kirbys to solve. If a Kirby is hit by an enemy or obstacle, it will turn blue until the end of the level, or until the player finds a special gate which restores their health. If a blue Kirby is hit, it will turn grey and float away unless the player can drag him down and turn him blue again, with the game ending if the player runs out of Kirbys or fails a certain level objective. Hidden throughout each game are several medals, found either by exploring, solving puzzles or finding keys and treasure chests, which in turn unlock additional minigames and bonus features. Some levels also feature large lollipops that temporarily make all the Kirbys bigger, allowing them to break through barriers and reach new areas.",
  "banner_url": "/games/banner/kirby-mass-attack.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:05.032573Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}