{
  "name": "Heart of Darkness",
  "slug": "heart-of-darkness",
  "year": 1998,
  "description": "Andy is a child who likes playing with his dog Whiskey, doesn't particularly enjoy going to school, and has a knack for inventing complicated gadgets. One day Andy and Whiskey are strolling through the park, when suddenly a solar eclipse darkens the sky, and after a moment Andy realizes that his dog has been taken away. But science can solve everything, and Andy heads to his treehouse, which is home to his outstanding inventions, including a spaceship! If you thought it was just a toy, you thought wrong, because Andy boards the ship and pilots it into the heart of the Darklands, a world controlled by the evil Master of Darkness. Andy takes out his gun (another splendid invention of his) and prepares to fight the evil sorcerer's minions. Nothing will stop the boy from rescuing his beloved dog!\r\n\r\nHeart of Darkness is a cinematic 2D platformer designed by Eric Chahi, the creator of one of the genre's progenitors, Another World. Though the game has many fast and furious action sequences, including shooting hordes of dark creatures, it is built like a series of tasks, each requiring different approaches, from arcade-style shooting or jumping to interacting with the environment and solving puzzles. Like its spiritual predecessor, the game is linear; completing a section usually takes Andy to a different location, where another task awaits him.\r\n\r\nAndy has several guns at his disposal, though in certain locations he will lose his weapons and will rely on the player's wit or quick reaction to survive. Andy will also gain magical energy, which can be used to grow or destroy trees. Similarly to Another World, many hazards are placed on the hero's path; despite the child-oriented premise, the game contains graphically explicit death scenes, which occur if the player is not careful or quick enough to save Andy from a gruesome demise.",
  "banner_url": "/games/banner/heart-of-darkness.jpg",
  "icon_url": "/games/icon/heart-of-darkness.png",
  "is_public": true,
  "updated": "2019-10-26T14:13:11.588052Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 27676
}