{
  "name": "Planet Zoo",
  "slug": "planet-zoo",
  "year": 2019,
  "description": "Build a world for wildlife in Planet Zoo. From the developers of Planet Coaster and Zoo Tycoon comes the ultimate zoo sim, featuring authentic living animals who think, feel and explore the world you create around them. Experience a globe-trotting campaign or let your imagination run wild in the freedom of Sandbox mode. Create unique habitats and vast landscapes, make big decisions and meaningful choices, and nurture your animals as you construct and manage the world’s wildest zoos.\r\n\r\nMeet a world of incredible animals. From playful lion cubs to mighty elephants, every animal in Planet Zoo is a thinking, feeling individual with a distinctive look and personality of their own. Craft detailed habitats to bring your animals’ natural environments home, research and manage each species to allow them to thrive, and help your animals raise families to pass their genes onto future generations.\r\n\r\nManage an amazing living world that responds to every decision you make. Focus on the big picture or go hands-on and control the smallest details. Thrill visitors with iconic exhibits, develop your zoo with new research, and release new generations of your animals back into the wild. Your choices come alive in a world where animal welfare and conservation comes first.\r\n\r\nPlanet Zoo’s powerful piece-by-piece construction tools let you effortlessly make your zoo unique. Every creative decision you make impacts the lives of your animals and the experience of your visitors. Let your imagination run wild as you dig lakes and rivers, raise hills and mountains, carve paths and caves, and build stunning zoos with a choice of unique themes and hundreds of building components.\r\n\r\nJoin a connected community and share the world’s most creative habitats, scenery and even whole zoos on the Steam Workshop. See your own designs appear in zoos around the world, or discover fresh new content from the Planet Zoo community every day.",
  "banner_url": "/games/banner/planet-zoo.jpg",
  "icon_url": "/games/icon/planet-zoo.png",
  "is_public": true,
  "updated": "2019-06-13T16:11:36.109730Z",
  "steamid": 703080,
  "gogslug": "",
  "humblestoreid": "",
  "id": 27831
}