{
  "name": "Caveman Stories",
  "slug": "caveman-stories",
  "year": 2018,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "Adventure"
    },
    {
      "name": "Casual"
    },
    {
      "name": "Strategy"
    }
  ],
  "aliases": [],
  "description": "In Caveman Stories you control a Caveman who, at the beginning of an ice age, got lost from his tribe and now must fight to survive and find a way back home. You will not want to miss this adventure!\r\n\r\nSomething is causing the world to become cold and covered by \"white dirt\". For us, it's easy to recognize and survive in the snow, but for the cavemans who have never experienced this before, it can be a big challenge!\r\nExplore the Unknown\r\n\r\nExplore mysteriously large places to discover what is happening in the lands of the game. Unknown buildings and symbols surprise the fearless caveman.\r\nFind a way to defeat your enemies\r\n\r\nIn Caveman Stories, each type of enemy requires a different strategy to be defeated, which can be too simple or too complicated. Use whatever is within your reach to defeat them!\r\nCollect some wood and build to survive!\r\n\r\nIf you want to survive the icy Caveman Stories nights, you'll have to work hard to collect raw materials and build shelters all over the map! Of course, you may be lucky enough to find caves in time to hide from the cold, but I would not count on that!\r\nDiscover and solve mysteries and enigmas\r\n\r\nFind ways to open doors and disable mechanisms on the map to be able to continue your journey. Just don't forget about your enemies!\r\nFEATURES:\r\n\r\n    Amazing 3D Hand Painted graphics!\r\n    Interesting combats, which require some strategy and skills.\r\n    Easter Eggs all over the map! :D\r\n    Enigmas to be unraveled.\r\n    Build system (crafting).\r\n\r\nAnd much more!!",
  "banner_url": "/games/banner/caveman-stories.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-11-17T11:45:46.939588Z",
  "steamid": 814590,
  "gogslug": "",
  "humblestoreid": ""
}