{
  "name": "Megamind: The Blue Defender",
  "slug": "megamind-the-blue-defender",
  "year": 2010,
  "description": "Megamind: The Blue Defender, is a 3D character action game with additional elements of exploration, puzzle solving and ability collecting/swapping. The game is based on the film Megamind. The player assumes the role of Megamind – the super villain determined on exacting revenge on Metroman.\r\n\r\nJust as Megamind has become our new Mega Hero, a sudden crime wave hits the city. The Doom Syndicate & their Doom Goons have emerged and are looking to take over! They have broken into Megamind's Lair and Hal has transformed himself into \"Blue\" Titan. Unfortunately, due to a mishap Hal has taken both Megamind's & Metroman's essence. It is up to Megamind to once again clear the city of crime finding clues to make his way to Titan.\r\n\r\nWith help from an arsenal of weapons, they player gets to destroy, shoot and punch his or her way through a city populated by goons and members of the Doom Syndicate. The player can use various abilities against enemies. Aside from shooting Megamind must also collect abilities, explore and solve puzzles to reach the end of each level. Action is a large part of the game: the player spends the majority of his or her time fighting ex-creation robots and other enemies. At regular intervals in the game, the player also encounters bosses which require a different approach. Each boss has its own theme, and requires more than running and gunning to defeat them.\r\n\r\nMegamind's abilities are gained through finding and unlocking new weapons scattered throughout the levels. Each weapon is also able to trigger special objects found in the levels to open up new paths and collectibles. Finding all collectibles and unlocks in the game requires the player to go through each level multiple times.",
  "banner_url": "/games/banner/megamind-the-blue-defender.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-08-13T14:28:24.341401Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}