{
  "name": "Anstoss 2007",
  "slug": "anstoss-2007",
  "year": 2006,
  "description": "ANSTOSS 2007: Der Fussballmanager is a managerial soccer simulation where the player is responsible for the athletic and financial success of his team. Unlike similar managers its menu uses a a hybrid between office and menu bar. In the office the player can click on items to get to the corresponding menu screens, e.g. the notebook leads to the weekly schedule and the computer screen to the e-mails. The office is only used to access such daily updated screens, all other functions are reached through the menu bar.\r\n\r\nAs usual the player has a wide variant of settings to take care of which influence the team's future. On the financial side he transfers players, expands the stadium, searches for sponsors or hires employees. Before every season the club board gives a budget in six categories which have to be satisfied. Of course the player can try to negotiate with them to get more money - but that influences his popularity... \r\n\r\nOn the athletic side he sets the training, the tactics, the lineup and takes care of the youth. Each player has a nominal strength and an actual strength. The nominal strength is calculated from several individual strengths which depend on the position, e.g technique or speed. This nominal strength gets modified with several factors, e.g. training or experience, and results in the actual strength.\r\n\r\nPersonal options are the possibilities to buy status symbols, marketing the own character or changing the team. Another innovation is the new renown value of every club. It is calculated with different factors, e.g. the national and international performance in the past and is important for many aspects, e.g. player transfers or sponsors search. Managers have with reputation a similar value.\r\n\r\nIn comparison to former installments of the series ANSTOSS 2007 features just one mode of match presentation: a text mode. There all interesting actions are written down in text form. The player also can take track of parallel matches. Assistant managers can overtake some responsibilities if the player wishes but there usefulness depends on their competence level.\r\n\r\nAs usual the player can choose a team at the beginning of his career or has to rely on job offers from lower classes. For the first time the player can choose if he wants to start all the way down or in the first respectively second league. Besides the usual two difficulty levels (easy and realistic) there is also a new \"core\" mode which is basically identical to the realistic mode but takes away the manual save feature. This means the player has to rely on the auto saves and can't reload his game if he loses an important match. Another new feature is the cooperation with an internet radio if the player doesn't like the standard background music.\r\n\r\nBecause the game was released in the year of Ascaron's 15th birthday it also includes the following games as bonus:\r\nANSTOSS 2 GOLD: Der Fußballmanager\r\nANSTOSS 3: Der Fußballmanager\r\nANSTOSS Action: Die Fußballsimulation\r\nANSTOSS 4: Der Fußballmanager - Edition 03/04\r\n",
  "banner_url": "/games/banner/anstoss-2007.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:28:22.793747Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 5790
}