{
  "name": "Broken Sword 2: The Smoking Mirror – Remastered",
  "slug": "broken-sword-2-the-smoking-mirror-remastered",
  "year": 2010,
  "description": "‘Broken Sword - The Smoking Mirror: Remastered’ is a stunning update to the multi million-selling original. While investigating a ruthless drug gang, journalist Nico Collard unexpectedly comes across an ancient artifact. Little can she know that the ornately carved obsidian stone will lead her, and her adventuring companion George Stobbart, into a mysterious escapade of intrigue and deceit, in which they must overcome powerful forces and antagonists who will stop at nothing to fulfil their evil ambitions. \r\n\r\nTorment and terror, sacrificial rituals, and bloody massacre is unearthed beneath a veil of Mayan mystery. Kidnap, stolen treasure, astronomy, and deadly drug baron are the least of the duo’s worries, as divine forces threaten to annihilate mankind! Nerve, cunning and guile are essential in order to conquer in this compelling adventure, guaranteed to leave you with an aching brain and a beating heart. Are you up to the challenge?\r\n\r\nAlong with an exclusive new interactive digital comic, from ‘Watchmen’ co-creator Dave Gibbons, the game boasts fully animated facial expressions, enhanced graphics throughout, high quality music as well as a context-sensitive hint system, and diary.\r\n\r\nKey Features:\r\n* Over 60 characters with which to interact\r\n* A multitude of highly detailed locations to explore\r\n* Hundreds of mind-bending puzzles and clues to collect\r\n* Beautiful classically animated sequences\r\n* Stunning music from world-famous composer, Barrington Pheloung",
  "banner_url": "/games/banner/broken-sword-2-the-smoking-mirror-remastered.jpg",
  "icon_url": "/games/icon/broken-sword-2-the-smoking-mirror-remastered.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:36.767948Z",
  "provider_games": [
    {
      "name": "Broken Sword 2: Remastered",
      "slug": "1207658707",
      "service": "gog"
    }
  ],
  "steamid": 33600,
  "gogid": 1207658707,
  "gogslug": "broken_sword_2__the_smoking_mirror",
  "humblestoreid": "broken-sword-2-the-smoking-mirror",
  "id": 158
}