{
  "name": "Rappelz",
  "slug": "rappelz",
  "year": 2006,
  "description": "About Rappelz\r\nRappelz is a free-to-play MMORPG played around the world by thousands and thousands of players. Creating an avatar in Rappelz is easy and will set you up in a devastated world filled with magic and chaos in a heroic fantasy environment.\r\n\r\nWHAT IS A MMORPG?\r\nMMORPG stands for Massively Multiplayer Online Role-Playing Game. Is basically means that this is an online game where you write your own history with your avatar and share it with thousands of other players in a persistent world.\r\n\r\nCOULD YOU TELL ME MORE ABOUT THE ROLE-PLAYING ASPECT?\r\nIn Rappelz, each player has the possibility to choose a profession, From Assassin to Priest, Dark Mage to Gladiator. This is usually defined by users’ preferences and they tend to play a role sticking to their profession. For example, a Priest will have support skills and should, by definition, be nice to other players. Not really looking for melee combat, the Priest will have low defence but good support abilities to help him or the others surviving the numerous in-game challenges. Role-Playing is also the background story of your character that you create yourself. Many online users like sharing self-made stories and use their imagination to enhance their gaming experience. There are three different Races in game, Asura, Gaïa and Deva. It is important for you to choose according to your correctly as each race will define your set of skills and appearance.\r\n\r\nLearn about Races & Jobs.\r\n\r\nOK, BUT HOW IS RAPPELZ DIFFERENT THAN ANY OTHER GAMES?\r\nThe core of Rappelz is its pet system. Every single character in Rappelz can train a pet to fight on his side with many different purposes (tanking, damage dealing, healing, support, etc…). There are currently 28 different creatures in the world of Rappelz with many different appearances, skills and abilities. The rarer your pet is, the more destructive your character will be.\r\n\r\nBut Rappelz, like any other MMORPG is an experienced based game where your character will grow stronger when killing monsters, completing quests and learning new skills.",
  "banner_url": "/games/banner/rappelz.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-01-18T06:26:45.353838Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 31176
}