{
  "name": "Rampage World Tour",
  "slug": "rampage-world-tour",
  "year": 1997,
  "description": "Three titanic toughies smash their way through more than 130 levels in this 2D homage to Godzilla and other forty-foot stars of the silver screen.\r\n\r\nOur story begins one seemingly uneventful day at world HQ of Scum Labs. The demented genetic experiments of Dr. Eustas DeMonic have gone terribly awry, mutating three of his gentlest employees into raving 50-foot beasts. Lab techie Ralph, now a giant werewolf, gets his kicks by bashing buildings. Tyrannosaurus rex-like Lizzie, once a shy scientist, is no wallflower when it comes to squashing Army tanks. And George has gone positively ape since he became a giant gorilla with a mohawk. All are heck-bent on only one thing: destroying all 16 Scum Labs around the world.\r\n\r\nThe basic goal is to thrash and bash your way across a series of cities, snacking on citizens as you do. Various power-ups give you invincibility, fire breath, extra strength and extra time. Sucking up the toxic waste at a Scum Lab further mutates your beast into V.E.R.N. (Violent Enraged Radioactive Nemesis), a flying, ultra-strong monster with lousy social skills. A multiplayer mode adds to the ferocious fun.\r\n\r\nNo one likes what Lizzie, George and Ralph are doing to real estate values, so you'll soon find the police and military coming at you with helicopters, tanks and robots. Even ordinary folk will come gunning for the misunderstood monsters. Fortunately, you can fortify yourself for the endless battles by chowing down on hidden livestock and timid travelers cowering at sight-seeing spots, as the game gives a new meaning to the phrase \"tourist traps.\"\r\n\r\nThe original Rampage hit the arcades at about the same time that Beverly Hills 90210 was a fresh new show, so don't expect 3-D graphics and innovative features. With World Tour, Midway has stuck to the game's side-scrolling, sprite-driven roots, but took advantage of the N64's strengths to sharpen the graphics and make the control more precise. The Rumble Pak was created with games like this in mind and sure enough, Rampage: World Tour lets you feel every earth-shattering explosion.\r\n\r\nTea-sippers and other sensitive types may fuss about Rampage's wanton destruction, while sophisticated players may complain that the game is just plain repetitive. But for the millions of players who love nothing more than smashing stuff over and over and over again, Rampage is as welcome as a Three Stooges marathon.",
  "banner_url": "/games/banner/rampage-world-tour.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:54.594004Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 6377
}