{
  "name": "Homeworld 2",
  "slug": "homeworld-2",
  "year": 2003,
  "description": "Homeworld 2 shares the movement system and three-dimensional play area of its predecessor. Units are moved three-dimensionally using a combination of mouse movements and key presses to modify the z-axis of the destination position.\r\n\r\nGameplay in Homeworld 2 depends on so-called \"Resource Units,\" (RUs) which are collected by harvester craft. RUs are the currency for both ship creation and technology research, placing limits on what combination of shipbuilding and new technology research can be carried out in a single game.\r\n\r\nThe player's fleet is centered on the Mothership, the destruction of which results in an immediate Game Over in a single-player game, and is a critical loss in a multiplayer game. The Mothership is capable of constructing all but the very largest ships, which must be built using Shipyards (the game states these are built at orbital facilities and arrive via hyperspace). The Mothership can also build Carriers, which themselves can build any ship from the Fighter, Corvette and Frigate families. Although the Mothership is initially the center of new research, Carriers and Shipyards can build their own on-board Research Labs.\r\n\r\nAll units in Homeworld 2 are starships of various classes, from small to large: Fighter, Corvette, Frigate and Capital Ship. Although the larger ships are more powerful and durable, they are also much slower and less maneuverable. Ships within each class specialize in certain areas and are vulnerable to certain other ships, although there may be ships in the same class that do not share the same vulnerability. Ion Cannon Frigates, for instance, are very vulnerable to fighters due to the unwieldy (albeit powerful) nature of their single weapon. Flak Frigates, however, are specifically intended for use against fighters, but lack the firepower to defend themselves against other frigates. Effective use of the relative strengths of each ship is essential for success.\r\n\r\nHomeworld 2 allows players to co-opt enemy ships using specialized frigates, much like the original game. These maneuver close to enemy vessels and dispatch boarding parties, which capture the vessel after a short period of time; capture can be sped up by using multiple Frigates against the same target simultaneously. However, these frigates are completely exposed to attack during the boarding process, and all capturing progress is lost if they are destroyed.\r\n\r\nAlthough Homeworld 2 nominally has no difficulty setting, it features dynamic difficulty adjustments, in which the strength of a level's opposition is determined using the composition of the fleet the player enters the level with (the fleet remaining at the end of the previous level). This led to an exploit in which players \"retired\" all of their ships at the end of the previous level, reducing them to RUs, and entering the next level with a huge store of raw materials to use against a very weak enemy. The game also codifies the support caps introduced in Homeworld, and explained in Homeworld: Cataclysm, by placing overall limits on how many ships of each class the player may control at once.\r\n\r\nMission objectives in the single-player game are primarily achieved by destroying key enemy elements, capturing particular targets, protecting certain units for a particular amount of time, or towing an object back to the Mothership. In addition to the storyline objectives, a significant portion of the missions require the destruction of all enemy units.",
  "banner_url": "/games/banner/homeworld-2.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:29:51.977105Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 23656
}