{
  "name": "Corpse Party",
  "slug": "corpse-party",
  "year": 2016,
  "platforms": [
    {
      "name": "Linux"
    },
    {
      "name": "Nintendo 3DS"
    },
    {
      "name": "Sony PSP"
    }
  ],
  "genres": [
    {
      "name": "RPG"
    },
    {
      "name": "Visual novel"
    }
  ],
  "aliases": [],
  "description": "Kisaragi Academy student Mayu Suzumoto is transferring to a new high school, leaving behind a sizable group of friends and countless lovely memories. To help her cope with this move, her friend Ayumi has devised a seemingly innocent plan: the whole group will come together to perform a charm she found on the internet called “Sachiko Ever After,” which is supposed to bind all of its participants together as friends to the end.\r\n\r\nThis does not go as expected.\r\n\r\nFollowing an intense earthquake, the group awakens to find themselves separated and trapped in an alternate reality version of Heavenly Host Elementary, a tragedy-stricken institution that once stood on the site of their own school but was torn down long ago. Here, the vengeful spirits of elementary-aged children threaten their lives and their sanity, and the only hope of escape – much less survival – is to uncover the chilling details surrounding the murders of those trapped before them.\r\n\r\nCorpse Party is the original Windows edition of the cult classic horror game that gained a considerable fanbase when released on Sony’s PlayStation®Portable system in 2011. Beginning life as an independent RPG Maker adventure title in 1996, the gameplay was greatly refined and the story greatly expanded for this 2008 remake, featuring more characters, more detailed interactions, darker story elements, over 5,000 lines of voice-acting and dozens of shocking, gruesome endings. Players take control of nine main characters and several side characters who’ve been split up into groups of two or three and trapped in a run-down, otherworldly elementary school full of vengeful spirits, deadly mysteries and – of course – corpses. As they walk around examining objects and bodies in an atmospheric 2D environment, a horror tale spanning over 50 years begins to unfold, and player choices determine both how the story ends and who lives to see it through.",
  "banner_url": "/games/banner/corpse-party.jpg",
  "icon_url": "/games/icon/corpse-party.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:58.365417Z",
  "steamid": 251270,
  "gogslug": "corpse_party",
  "humblestoreid": ""
}