{
  "name": "PlanetSide 2 - Nanite Systems Operatives",
  "slug": "planetside-2",
  "year": 2012,
  "description": "PlanetSide 2 is a re-imagining of PlanetSide, featuring the same world and factions, and taking place at roughly the same time period. As in the previous game, it features territory control in open-world, large battles featuring up to 2000 players per continent on foot or in land/air vehicles. The territory system differs greatly from that of the original, being more free-form and based on a hexagonal territory control system. Former SOE (currently DBG) took into account balance issues from the first game. As stated by creative director Matthew Higby, the developers created a system to reward combatants on lower population empires through mechanics such as proportionally increased advancement rates and resources to aid the balance of overall empire saturation on each server as much as possible without force-restricting players from being able to play with their friends.[7]\r\n\r\nPlanetSide 2 is a faster paced game than the original Planetside and holds the ability to feature potentially thousands of players. It also features typical first person shooter elements such as sprinting, iron sights, and regenerating shields. An important aspect is that player skill and teamwork are major determiners when it comes to being able to kill other players and overcome opposing teams. Unlockable skills are available and offer different advantages over enemies in battle. The game also features a day and night cycle, meaning that battles happen at different times of day, which affects gameplay, as night time can provide adequate cover for coordinated attacks.[8]\r\n\r\nCombat takes place on the continents of the fictional planet Auraxis, which are broken up into numerous territories. Control of territories provides bonuses to a faction in adjacent sectors. The mission system is partly automated and partly controlled by players. It provides focal points for players to attack and defend and helps players get into the action quickly.\r\n\r\nAs the player participates in productive activities such as killing enemies, healing or repairing allies, or capturing bases, they earn experience, which increases their character's \"Battle Rank,\" or level, and rewards them with certifications or \"Certs.\" Certifications allow the player to specialize in certain roles by allowing them to improve weapons, vehicles or tools they use. Many certifications require the player to invest in multiple upgrade tiers of the certification, which increase the certification's efficiency. For example, the player can purchase five ranks of Nanoweave Armor, which when equipped reduce damage taken from infantry weapons. Using the certification system, the player is able to customize how they play using different classes or vehicles. For example, the player can purchase certifications to alter the main function of the Sunderer vehicle, such as the ability to repair or restock the ammunition of nearby allied vehicles and aircraft. Another currency, called \"ISO-4\" is used for \"Implants\" which resemble Perks in Call of Duty.\r\n\r\nContinents can be captured, or \"locked,\" by a specific faction. This is done when a faction takes about 41% of the continent's territory, triggering an \"Alert\". Whichever faction wins the alert locks the continent and gets rewarded with Certs and ISO-4. Another continent opens up immediately afterward. There are other types of Alerts that are done at random times which involve capturing different kinds of bases and facilities.\r\n\r\nAn update was released in late April 2016 that allowed players to construct their own bases by harvesting \"Cortium\", a new mineral that appears throughout the world.[9] Using a vehicle known as the ANT (Advanced Nanite Transport), players harvest the mineral and deploy a variety of structures, such as bunkers, rampart walls and Sunderer garages. Players can also deploy turrets, artillery, silos (where players store their Cortium) and modules, which include adding AI to friendly turrets and generating shields. \r\n\r\nNow as of April 2019, Direct X 11, and a new Faction called the NSO OP's has been added to the battlefield.",
  "banner_url": "/games/banner/planetside-2.jpg",
  "icon_url": "/games/icon/planetside-2.png",
  "is_public": true,
  "updated": "2019-05-20T01:55:42.048548Z",
  "steamid": 218230,
  "gogslug": "",
  "humblestoreid": "",
  "id": 744
}