{
  "name": "Land Stalker",
  "slug": "land-stalker",
  "year": 1992,
  "platforms": [
    {
      "name": "Sega Genesis / Mega Drive"
    }
  ],
  "genres": [
    {
      "name": "Hack and slash"
    },
    {
      "name": "jRPG"
    }
  ],
  "aliases": [],
  "description": "The game's intro starts in Gamul Date 312 where Nigel, a treasure hunter who is 88 years old, far older than he appears, is shown traversing a dungeon of rolling boulders and moving platforms called Jypta Ruins to acquire the Statue of Jypta. After selling this statue to a shop owner in a port town, Nigel is accosted by a wood nymph named Friday. She explains that she is being chased by three persistent yet bumbling thieves named Kayla, Ink, and Wally because she knows the location of the legendary treasure of King Nole. Once Nigel spends most of his money on a bird to carry him to the island, Friday admits that while she doesn't know the exact location of the treasure she has a \"feeling\" where it is. The player controls Nigel from here on where he and Friday, who accompanies him for the entire game, first journey through a dungeon until they fall into a river and end up in the care of the red-furred bear-people of Massan. When Nigel awakes, he finds his way to the neighboring village of Gumi, where the yellow-furred bear-people are ready to sacrifice the daughter of Massan's leader, Fara. Nigel follows the crazed tribe into their shrine and breaks them of their curse, freeing Fara and earning the respect of both tribes and a clue to help him to the treasure.\r\n\r\nNigel and Friday travel westward until they come to the lighthouse town of Ryuma which has been attacked by thieves. Nigel goes to the thieves' cave and rescues the mayor and some other men who have been kidnapped. He also finds a lithograph of a dragon, which Friday tells him is a clue to the treasure. Before he can leave, Kayla, Ink, and Wally show up and hold Friday hostage until Nigel hands them the lithograph.\r\n\r\nNigel's heroics earn him a place in the court of Duke Mercator, who orders him to go and defeat an old wizard, Mir, who is locked in a tower nearby and who has been terrorizing the town and extorting the Duke. Nigel braves a crypt and the wizard's tower and faces him in single combat. Defeated, Mir confesses all he knows about King Nole's treasure and then explains that the Duke is his brother and had been using him as a scapegoat for years. Nigel returns to the Duke and is about ready to confront him when he is tossed into a dungeon. While imprisoned he finds out that the princess of Maple, his home country, who had been a guest at the castle, has been taken away by the Duke's dragon-like henchman, Zak. He manages to escape to find the castle knights in open revolt and ships stuck in the harbour because the lighthouse in Ryuma is broken. Nigel saves Arthur, the Duke's general, and is given the key to the Greenmaze, where the Sunstone can be found, the gem that powers Ryuma's lighthouse.\r\n\r\nNigel navigates the maze despite the best efforts of troublesome gnomes and restores the lighthouse. He then takes a ship to pursue the Duke. He makes landing up the coast of the island at Verla, which has practically become a ghost town. The Duke had enslaved the population of the town and forced them to work in nearby mines searching for a legendary treasure. Nigel frees the townspeople, and they give him a legendary sword they found but had hidden from the Duke. Nigel continues through the mine to find the Duke sailing, via rafts, across a lake to an island temple. Nigel finds a way over and navigates through the labyrinth to fight the Duke but is caught off-guard by Zak. Nigel is teleported to safety by Mir before the Duke and Zak can finish him off. Mir then proceeds to give Nigel some more information about King Nole's treasure. Mir also gives a magical axe to Nigel which allows him to cut down trees with a single swing of his sword.\r\n\r\nNigel retakes his sword in hand, and Friday leads him up through mountains to get to the entrance to the underground dungeon where King Nole hid his treasure. They encounter Zak again, who has decided that while he doesn't like working for the Duke any longer he still wants to face Nigel one on one. After Nigel proves his superiority, Zak gives Nigel something he stole from the Duke that will allow Nigel to enter the underground. Zak departs defeated.\r\n\r\nNigel finds himself back at the same cave he started in, this time filled with monsters but no traps. He gets to the Duke just as he uses the Princess to open the gate between the above and below worlds(referencing the song In-A-Gadda-Da-Vida). Nigel charges through into the center of the island and into King Nole's labyrinth, a massive confusing dungeon guarding King Nole's palace. After making it through the labyrinth and the palace, Nigel makes it to the room which held the treasure. After all the challenges so far, things are not quite finished for King Nole's restless Spirit attacks Nigel but Nigel makes quick work of him. The Duke then shows up and as he thanks Nigel for doing the dirty work for him, Gola, the Dragon God that King Nole worshipped, burns him alive.\r\n\r\nNigel fights Gola using all of his strength and cunning, and when the beast is finally vanquished, the treasure is his. With vast sums of gold under his control he decides that rather than retire he and Friday will continue their adventures. In the original ending in the Japanese and European version the treasure vanishes after Gola's last stand. Nigel isn't very upset and suggests taking Friday with him to the main country for new adventures.",
  "banner_url": "/games/banner/land-stalker.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:07.607970Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}