{
  "name": "Pro Evolution Soccer 5",
  "slug": "pro-evolution-soccer-5",
  "year": 2005,
  "description": "It goes without saying, but we love saying it anyway - Pro Evolution Soccer 5 (PES 5) makes the best even better. With the new licensed teams, new trademark moves, massively expanded Master League and variable weather conditions, PES 5 ensures that console football is even closer to the real thing.\r\n\r\nThe best part is, you don't even need to take our word for it...\r\n\r\nArsenal's Thierry Henry, and Chelsea's John Terry, will be staring out from the box when Pro Evolution Soccer 5 is launched, this autumn. The two men, both at the top of their game in the world famous Premiership, are die-hard fans of PES and proud to be involved.\r\n\r\nThierry Henry has admitted: \"I have been playing Pro Evolution Soccer games for over 10 years now.\" He also revealed how much he has enjoyed representing the game since PES 4. \"It was great to be the face of such a realistic and engrossing football title, so I was delighted to return for the newest version,\" he said. \"I look forward to being closely involved with the creation and promotion of what promises to be a stunning game.\"\r\n\r\nPremiership champion, John Terry, says: \"I've been a massive fan of Pro Evolution Soccer for years now and am really pleased to be able to work with the talented people behind such a fantastic game.\" More than that, 'JT' also claims that PES is, \"the game of choice for lots of players as it is so true to the real thing,\" adding that, \"I'm looking forward to getting involved with the launch of this fifth and best version in the coming months - and getting to play advance versions on the way!\"\r\n\r\nWe've all got so much to look forward to, starting with the retuned controls giving players more control over weighted passes, one-twos, and so on. This ties in neatly with the improved animation, which not only looks more realistic, but requires you to time kicks and shots perfectly for maximum power - you're more likely to scuff the ball and make weak, inaccurate shots if you attempt to play them while off balance or out of step.\r\n\r\nIn order for you to enjoy the full benefit of the updated controls, Training Mode is extended - rewarding efforts with points used to unlock secrets within the game.\r\n\r\nThe new licensed clubs are all meticulously detailed, including the authentic representation of names and numbers on their backs. You'll find the most famous players bear an astonishing resemblance to the real thing. Increased detail in all players has been transferred to the Player Design mode, which has been hugely expanded to include more factors determining skill and ability.\r\n\r\nMaster League, in which you guide a lowly team to glory, now allows player-managers to monitor individual players and see when their health declines.\r\n\r\nIn all games, weather conditions can be set to 'variable', leading to patchy rain or snow. The new weather conditions further enhance the realism and unpredictable nature of PES matches. Rain or shine, PES 5 will be the greatest console football you've ever experienced.",
  "banner_url": "/games/banner/pro-evolution-soccer-5.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-10-31T00:50:42.671022Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 29990
}