{
  "name": "Homeworld Remastered Collection",
  "slug": "homeworld-remastered-collection",
  "year": 2015,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Real-time strategy"
    }
  ],
  "aliases": [],
  "description": "Experience the epic space strategy games that redefined the RTS genre. Control your fleet and build an armada across more than 30 single-player missions. Choose unit types, fleet formations and flight tactics for each strategic situation. Utilize advanced research to construct ships ranging from light fighters to huge carriers and everything in between.\r\n\r\nThe Homeworld games have been painstakingly re-mastered with key members of the original development team and taking critical influence and assistance from the passionate fan community. The Homeworld Remastered Collection introduces Relic's acclaimed space strategy games Homeworld and Homeworld 2 to modern players and operating systems using the newest sophisticated graphics rendering technology, plus a fully remastered score and new, high fidelity voice recordings by the original actors.\r\n\r\nAs a free bonus, this collection also includes original, non-remastered versions of Homeworld Classic and Homeworld 2 Classic, preserving the purest form of the original releases with compatibility for modern operating systems.\r\n\r\nHomeworld Remastered Collection also provides access to the Homeworld Remastered Steam Multiplayer. The competitive multiplayer modes for both Homeworld and Homeworld 2 have been combined into one centralized mode that will allow you access to content (races, maps and game modes) and improvements, features and technology from both games, allowing you to play unlimited competitive multiplayer space battles on an epic scale.",
  "banner_url": "/games/banner/homeworld-remastered-collection.jpg",
  "icon_url": "/games/icon/homeworld-remastered-collection.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:52.012716Z",
  "steamid": 244160,
  "gogslug": "homeworld_remastered_collection",
  "humblestoreid": ""
}