{
  "name": "Jidousha Shakai",
  "slug": "jidousha-shakai",
  "year": 2017,
  "description": "Jidousha Shakai is an open world racing game with unrivaled customization to spark the new coming of open world racers. Control every inch of your cars appearance to give it your unique touch. If you'd like to experience Jidousha Shakai in it's fullest form we need your help today!\r\n\r\nSome awesome things in Jidousha Shakai!\r\n\r\n    Bodykits (front bumpers, rear bumpers, hoods, trunks, spoilers/wings, exhausts, headlights, tailights, and more)\r\n    Engine Performance (intakes, starters, cams, forced induction, blocks, full engine swaps)\r\n    Paint (matte, chrome, metallic, flip-flop, pearlescent, window tint, dual color wheels)\r\n    Full featured rim/wheel creator! (Fully procedural wheels at your finger tips with many options to create your perfect wheel on the fly!)\r\n    And more! (License plates, light color, light bulbs (HID, XENON, ETC))\r\n\r\n\r\nOther features in JS that were completed upon request..\r\n\r\n    Full in-game radio that features streaming your own .mp3, .wav, and .ogg files from an easy documents folder.\r\n    Full features photo mode that outputs upscaled (up to 8k) screenshots no matter the resolution you play on.\r\n    Full controller and wheel support for driving physcis.\r\n\r\nJidousha Shakai is currently being completely rewritten to provide a better game and experience overall. The features below are part of the multiple phase plan to make JS the game it was meant to be from the beginning.\r\n\r\nFeatures currently being worked on..\r\n\r\n    Full mod support (custom cars, parts, maps, etc)\r\n    In-game map creator (road creator, building placer, foliage, custom mesh import)\r\n    Full online server based cross-platform multiplayer\r\n    Fun game events w/ custom event organizer (car meets, drift meets, cruise sessions, street drag sessions, and more)\r\n    Story and non-linear progression\r\n    More ideas from the community (you!) that have been noted!",
  "banner_url": "/games/banner/jidousha-shakai.jpg",
  "icon_url": "/games/icon/jidousha-shakai.png",
  "is_public": true,
  "updated": "2019-02-19T03:50:24.515652Z",
  "steamid": 611800,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13624
}