{
  "name": "Ostrofa",
  "slug": "ostrofa",
  "year": 2019,
  "description": "Be prepared to survive in a custom-generated, low poly environment, fighting against other players from all over the world.\r\n\r\nOnce the game begins, you'll find yourself on a deserted island, surrounded with nothing but the wild animals and collectible resources that will help with your survival.\r\nYou'll notice a bright, glowing orb on top of the statue right next to your spawn position - it represents your external heart. Once this structure gets destroyed by another player or NPC, you won't be able to respawn if you get killed and, unfortunately, the game will end for you. \r\nDon’t worry, you aren’t the only soul in this never-ending ocean. Look a bit further and you will find that there are more islands just like yours. Yes, these are homes of other players you are up against. It's very easy - kill everyone else and victory is yours! \r\nAny tips on survival? There are a few! The most important one - watch your hunger! It may decrease pretty fast if you don't eat anything. Food can be found on your or surrounding islands. Look for apple and orange trees, mushrooms, vegetables, and berries. You can also hunt nearby animals, which can provide a good amount of meat.\r\nDon't forget to stay away from open water – always use a boat to travel. We’ve seen a lot of deadly sharks in these parts – a sharp axe or bow might come in handy.\r\nAnd one more thing. A supply drop will be sent down at the center of the map a few times throughout the game. Yes, on that white iceberg that’s protected by a white, angry polar bear. It’s a dangerous journey, but worth it! These chests contain very, very exciting and worthy items.\r\nNow is when I stop explaining and showing you around. You have to see the rest for yourself. Ostrofa has so much more - weapon crafting, barricade building, fishing... See you in the game!",
  "banner_url": "/games/banner/ostrofa.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-12-28T20:52:03.757349Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}