{
  "name": "Linux Air Combat",
  "slug": "linux-air-combat",
  "year": 2014,
  "description": "Now available for free Internet download, this new, high-performance flight simulator is now \"feature-complete\", and supports all of the basics demanded by today's LINUX flight sim users, including all of these features:\r\n\r\n    Free and open source distribution. The clean source code compiles without modification on major LINUX distros\r\n    Very smooth, simple, high-performance graphics yield high frame rates even on modest computer hardware\r\n    45 flight/view functions can be mapped to any detected joystick axis, button, or keyboard key\r\n    Modern, multi-axis analog/digital joysticks support precision control of elevators, ailerons, rudder, throttle, etc.\r\n    Mouse control of elevators, ailerons, and weapons for those lacking a joystick\r\n    54 different flyable aircraft from World War II\r\n    A theoretical Jet fighter with performance similar to the General Dynamics F16\r\n    Industry-standard \"Air Warrior\" style viewsystem is easily configurable for other view options\r\n    Sophisticated flight model with stalls, high-speed compressibility, high-G blackouts, and redouts\r\n    Realistic high-altitude degredation of engine performance\r\n    Fuel consumption is proportional to engine load including WEP/Afterburner effects\r\n    Flight performance is degraded when lugging heavy bombs, missiles, or rockets\r\n    Flight performance is degraded when aircraft are damaged\r\n    Simulated RADAR to help locate opponents\r\n    Enemy airfields and RADAR facilities can be damaged or destroyed\r\n    Simulated IFF to help Identify Friend verses Foe\r\n    Guns combat\r\n    WW2-era Air-to-Ground rockets\r\n    WW2-era bombs\r\n    Missile combat (only when flying jets)\r\n    Flares and Chaff operable as missile countermeasures\r\n    Free flight mission\r\n    Four tutorial missions with detailed audio narration to help beginners get a quick start\r\n    Five Offline combat missions\r\n    Online \"Head to Head\" mission suitable for air racing or combat (2 players only. No server required.)\r\n    Free, high performance Linux Air Combat Server is now available at LacServer2.LinuxAirCombat.com\r\n    Three distinct, ten-player Internet missions in various terrains, with strategic airfield combat (Internet and access to a free LAC Server required)\r\n    Users can record \"GunCamera films\" and ask the Server to replay them as persistent \"Server Missions\"\r\n    32 distinct, online Realms, each supporting unique missions and/or communities\r\n    Realm \"0\" constantly runs persistent Server \"Strike\" missions with heavy bombers to escort, or to oppose\r\n    User-loadable graphic aircraft models support the free, open, well-known \".3ds\" format\r\n    User-loadable background music, sound effects, and narration files support industry-standard \".wav\" format\r\n    \"Talking Cockpit\" can verbalize target location so you can hear it without diverting your eyes\r\n    Innovative \"Network Router Panel\" on cockpit shows network telemetry and comms data flow from other players\r\n    Best-of-breed network user management with interplayer status messages on the cockpit panel\r\n    Powerful integration with \"Mumble\" for world-class voice communication between players\r\n    Dedicated Mumble server manages a rich heirarchy of voice radio channels and online help\r\n    Automated radio messages verbalize enemy airfield status when Mumble Radio is properly tuned\r\n    16 Comms-related functions can be mapped to any keyboard key\r\n    Text-only, low-bandwidth comms option acts like a \"Morse Code\" radio, generating real Morse code\r\n    Airfields with defensive guns challenge nearby opponents and protect nearby allied aircraft\r\n    Airfield defenses can be damaged and degraded with bombs, rockets, missiles, and/or machine guns\r\n    Damaged airfield defenses are gradually repaired by surviving airfield maintenance personnel\r\n    Air raid sirens blare loud on damaged airfields\r\n    Bombers have autogunners that take shots at nearby hostile fighters\r\n    \"Norden\" bombsight emulation makes precision, medium or high altitude bombing possible\r\n    Realistic bomber climb rates:  Heavily loaded bombers need a long time to climb to altitudes high enough to avoid fighters\r\n    Realistic bomb-run tactics make heavy bombers vulnerable to opposing fighters during critical mission segments\r\n    Heavy bombers can destroy an airfield in a single sortie if well flown and undamaged by opposing fighters\r\n    Real-time, automated radio and RADAR warnings alert players when their airfields are threatened by strategic bombers\r\n    Supported by an active development team for bug fixes\r\n\r\nNew! Here are two narrated YouTube Movies showing two network players enjoying the latest \"Server Mission\" with the current version of LAC as of June 2018:\r\n\r\n\r\n\r\n\r\n\r\n\r\nLinux Air Combat is free software that we donate to the world. We are writing this stuff because we love to do so. However, there are real-world limits on the amount of time we can spend writing and preparing this software. You can help! LAC Development is advertising-supported. Our development efforts are funded by the modest advertising revenue we receive from these LAC pages, and from our web site AskMisterWizard.com. All we ask is that you give our web site a chance. It's loaded with very high quality instructional videos about technology, flight simulation, and networking. Please be fair with our advertisers. We keep scripting to an absolute minimum, and we don't clutter up the site with excessive ads. If you see an ad that you don't like, please DON'T click on it. That will help our advertisers figure out the kinds of ads that please our viewers. On the other hand, if you see an ad that shows something of real interest to you, please consider exploring it in detail and giving the advertiser a fair share of your honest attention. When you do that, everybody wins, and we can spend more time improving LINUX AIR COMBAT.  Thanks!",
  "banner_url": "/games/banner/linux-air-combat.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:11.451696Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}