{
  "name": "Monkey Island 2 Special Edition: LeChuck’s Revenge",
  "slug": "monkey-island-2-special-edition",
  "year": 2010,
  "description": "Wannabe pirate Guybrush Threepwood, and the now zombie pirate LeChuck, return in what has long been considered one of the greatest LucasArts adventure games of all time. Monkey Island 2 Special Edition: LeChuck’s Revenge faithfully re-imagines the classic Monkey Island sequel in signature special edition detail. Expanding on the highly successful The Secret of Monkey Island: Special Edition in just about every way, fans will now experience new unique special edition features and interact with the world of Monkey Island like never before.\r\n\r\nHaving seemingly defeated the evil ghost pirate LeChuck in his first adventure, Guybrush Threepwood sets his sights on the legendary treasure of Big Whoop. But wait, LeChuck is now back in zombie form and he's out for revenge. Guybrush will have to use his wits, his humor and his insatiable desire for adventure to defeat his nemesis once and for all and truly prove himself the greatest pirate in the Caribbean. Voodoo dolls, spitting contests and amusement parks are just some of the challenges Guybrush must overcome as he meets old friends, fights new enemies and uses every ounce of his mojo to overcome the wrath of LeChuck’s revenge.\r\n\r\nPlay it again for the first time with signature Special Edition features:\r\n* High-definition graphics: All new re-imagined contemporary art style, hand-drawn and presented in high definition.\r\n* Voice over: Complete voice over using original Monkey Island franchise cast members brings the story and characters to life like never before, now available for both the Special Edition and Classic modes.\r\n* Renewed music score: Re-mastered and re-recorded musical score using live instruments.\r\n* Special Edition and Classic modes: Scene-for-scene hot swap lets you seamlessly transition between Special Edition and Classic modes at anytime during gameplay.\r\n* Enhanced gameplay: All new intuitive game interface and controls provide a more interactive gameplay experience.\r\n* Hint system: In-game puzzle hint system keeps the puzzles fresh and fun.\r\n\r\nIncludes all new features:\r\n* Direct control: Choose how you play -- use the classic point-and-click interface or the all new intuitive direct character control for a more interactive gameplay experience.\r\n* Object highlighting: Interactive object highlighting provides quicker clues to finding hidden objects.\r\n* Behind the scenes art: An in-game art viewer lets players view fantastic never-before-seen artwork from both the Classic and Special Edition versions of the game.\r\n* Original developer commentary: Listen to select scene commentary from Ron Gilbert, Tim Schafer and Dave Grossman as they share funny stories and chronicle the development of the original Monkey Island 2: LeChuck's Revenge.\r\n* SteamWorks Achievements: Only the mightiest of pirates can collect all three. We kid, there’s a lot more, but you will need to be mighty to get them.",
  "banner_url": "/games/banner/monkey-island-2-special-edition.jpg",
  "icon_url": "/games/icon/monkey-island-2-special-edition.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:49.096977Z",
  "steamid": 32460,
  "gogslug": "monkey_island_2_special_edition_lechucks_revenge",
  "humblestoreid": "",
  "id": 393
}