{
  "name": "In the City of Alabast: The Menagerie",
  "slug": "in-the-city-of-alabast-the-menagerie",
  "year": 2015,
  "platforms": [
    {
      "name": "Linux"
    }
  ],
  "genres": [
    {
      "name": "Sexual Content"
    },
    {
      "name": "Visual novel"
    }
  ],
  "aliases": [],
  "description": "The Menagerie is an 18+ eroge made by Studio Lupiesoft.\r\n\r\nThe game itself features 5 story characters and one main character, the Drachene “Rao-Ji”. In her adventures within The Menagerie she meets several other strange and interesting people.\r\n\r\nBelow the great entrance hall there exists another level, a separate hall unto itself, a secret society within a secret society of only the richest of the aristocracy. Compared to the common folk in the lower city, those members of high society live in utter opulence within the Sail. It is a palace, an escape of the desert heat. The pinnacle of status for the rich, the pompous, ‘bourgeoisie’. Below this great entrance hall is ‘The Menagerie’.\r\n \r\nThe Menagerie is often a place of supreme decadence and where the aristocrats engage in their lewd obsessions. The aristocrats do not even regard those in the Menagerie as anything more than ornate collectibles. It is not that they willfully ignore it, it is that they simply do not comprehend it, a person is judged based on their wealth and according to the aristocracy those who have no wealth of their own become the wealth of others.\r\n\r\nThe nobility has washed it’s hands with those in the ‘Lower City’ and while Alabast itself is fairly teeming with races of all sizes and types, the opulent palace of the aristocracy is off-limits to all but the esteemed of merchants and politicians. It is here that the Erzad act as the personal guards of the Sail and its Nobles. But in this ivory tower there are secrets the nobles keep even from each other. Everything is potentially another interesting experience and delights to be had. Here there is nothing and no one on display without a price.",
  "banner_url": "/games/banner/in-the-city-of-alabast-the-menagerie.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-06-13T21:23:12.075336Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}