{
  "name": "Child of Light",
  "slug": "child-of-light",
  "year": 2014,
  "description": "Child of Light is centered around the daughter of a duke from 1895 Austria, Aurora, who contracts a physical ailment that causes her to pass away. She somehow awakens, finding herself on an altar the mythical world of Lemuria. Lemuria had its sun, moon, and stars stolen by the Black Queen, and Aurora is entrusted with the task to defeat the Black Queen and recover the celestial bodies to return to her world and ultimately reunite with her father. In her journey, she is accompanied by Igniculus, a helpful firefly who can be controlled by a second player. Aurora meets several allies along the way, including Rubella, Finn, Norah, Robert, Tristis, Óengus, Golem (DLC content) and Gen, all playable characters in battle.\r\n\r\nAurora seeks help from the Lady of the Forest to wake herself up from this dream, however, the Lady of the Forest tells her that this is not a dream. Rather, there is magical link between her and this world. The linkage between this world and the real world is a mirror. In a vision, the Queen of Light rules Lemuria but she disappears one day. Instead, the Black Queen rules over the world with her two daughters and uses dark creatures to conquer Lemuria. The Lady tells Aurora, that the mirror is in Queen Umbra's possession and in order to return to her homeland she has to find the celestial bodies and defeat the Black Queen. She gives Aurora the stars which grant her with a pair of wings, hands her a flute and tells her to seek help along her travels to receive the moon and the sun.\r\n\r\nAurora unexpectedly meets Norah, her step-sister, who tells Aurora that she was forced through a mirror ending up in Lemuria like Aurora. They travel together to find the mirror in the Temple of Moon. Aurora leaves Rubella, Finn, Robert, Golem and Tristis behind. Aurora and Norah travel together through the mirror and Aurora finds her step-mother awaiting her, who is revealed to be the Dark Queen. Norah tells Aurora that her real name is Nox and she tricked Aurora into meeting the Black Queen. The Black Queen expresses her hatred for Aurora's mother and attempts to kill Aurora, but the false crown that Aurora once received from her father protects her from spells from the Black Queen. Since she cannot hurt Aurora, the Black Queen locks her, and her allies, in a prison. After a while, Óengus, the guard of the prison, hears a song Aurora played on her flute and helps her escape as long as she promises that she will defeat the Black Queen. Aurora agrees and rescues Igniculus, Rubella, Finn, Robert, Golem and Tristis before they all escape together.\r\n\r\nThe group takes back the moon from Cordelia, Aurora's other step-sister who's real name is Crepusculum, at the entrance of the Forgotten Tower. They travel to the lowest point in the world under the sea. On their way, they find out that the people of the Piscean Village in the Cynbel Sea are being captured and even eaten by a Giant Ogre. They defeat the Giant Ogre and recruit Gen who vows to fight the Black Queen on behalf of her villagers. The group travels down the tower into the sea and defeat Nox to take back the sun. After she is defeated the Black Queen appears and shows Aurora her father. She says that if Aurora hands over the stars and the moon she can return to her father in which case he would survive. Aurora though is not able to betray the inhabitants of Lemuria and denies the offer leading to the dukes death. Since Aurora received her false crown from her father it disappears and with it the protective spell on it. Therefore the Dark Queen manages to attack and kill her. But Aurora is able to grab the sun and throw herself in a rising waterfall. Dead she rises from the Cynbel Sea and is carried by fireflies to the Altar where the Lady of the Forest awaits. She resurrects Aurora by playing the flute and through the wishes of Aurora's allies, the stars, the moon and the sun. Aurora has a short reunion with her mother, the Queen of Light, then travels to the castle to defeat the Black Queen to free Lemuria of her rule.\r\n\r\nAurora travels through the mirror to go back to the real world, where the residents of her hometown are about to be drowned by the rising flood. She and her group rescues the citizens of her country and brings them all to Lemuria through the mirror. In the closing scenes, only a small island in a lake remains of that town, but Lemuria begins to grow again.",
  "banner_url": "/games/banner/child-of-light.jpg",
  "icon_url": "/games/icon/child-of-light.png",
  "is_public": true,
  "updated": "2019-06-01T06:31:12.424252Z",
  "steamid": 256290,
  "gogslug": "",
  "humblestoreid": "",
  "id": 3242
}