{
  "name": "Family Guy™: Back to the Multiverse",
  "slug": "family-guy-back-to-the-multiverse",
  "year": 2012,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "Adventure"
    }
  ],
  "aliases": [
    {
      "slug": "family-guytm-back-to-the-multiverse",
      "name": "Family Guy™: Back to the Multiverse"
    }
  ],
  "description": "Family Guy: Back to the Multiverse is an action-adventure game based on the TV animation series and specifically a sequel to the episode \"Road to the Multiverse\" from the series' eighth season. Players take control of Brian and Stewie Griffin as they try to prevent Stewie's evil half-brother, Bertram, from creating an army strong enough to kill Stewie. Players go through seven different universes with each having a unique ruler, ranging from the Amish to giant chickens. In addition, the game includes many characters and themes from actual TV episodes. Characters that appear include Ernie the Giant Chicken, Long John Peter, Evil Stewie, Crippletron, and Santa Claus. The game offers both offline and online multiplayer. In single-player it is possible to switch between the two characters at any moment, but cooperative gameplay is also supported through a drop-in, drop-out system. Throughout the campaign, players unlock costumes, multiplayer maps, extra levels, and other playable Family Guy characters.\r\n\r\nThe game is played as a third-person shooter. Stewie uses a laser gun and a flamethrower, while Brian wields a shotgun and a pistol. Some situations require a specific character's weapon to solve small environment puzzles and progress. Upgrades are provided by collecting cash and spending it at the multiverse store. Upgrades include for example improved health and ammo capacity.",
  "banner_url": "/games/banner/family-guy-back-to-the-multiverse.jpg",
  "icon_url": "/games/icon/family-guy-back-to-the-multiverse.png",
  "is_public": true,
  "updated": "2019-03-25T04:26:57.703638Z",
  "steamid": 214230,
  "gogslug": "",
  "humblestoreid": ""
}