{
  "name": "FINAL FANTASY III",
  "slug": "final-fantasy-iii",
  "year": 1990,
  "description": "In a remote village of Ur, four orphan boys were raised by the priest Topapa. Once, the Crystal of Wind, guarded by the people of Ur, sank deep into the earth. The four boys decided to retrieve it from there and went down into an underground cave. But when they found the crystal, it spoke to them and from its words they understood they were chosen for a much more important and world-embracing mission...\r\n\r\nFinal Fantasy III is the third Final Fantasy game for the NES platform. It was the last Final Fantasy game that does not use the ATB (active time battle) system (until it was removed again in Final Fantasy X). The turn-based battle engine has been improved: if the enemy is defeated, the next character will automatically switch to another enemy, and not hit the air, like in the previous two games. \r\n\r\nBefore the game begins, you give names to the four boys, which look the same (only in different colors) and belong all to the same class - the scrawny Onion Kid. Very quickly, however, you're able to give your heroes \"jobs\" - proper character classes, such as Fighter, Black Mage, Viking, Shaman and others. Each job has different capabilities and can use different equipment. More powerful jobs become available later in the game. The characters can change jobs throughout the game, though it costs them \"Capacity Points\" (which are earned in battle). \r\n\r\nThe game itself is, like the previous games, a top-down RPG where your characters travel in the overworld, sometimes entering cities and dungeons to buy equipment, rest and fight random encounters and bosses with turn-based combat. \r\n\r\nSome minor issues were slightly changed to resemble more the classical Final Fantasy look (such as the menu layout etc.).",
  "banner_url": "/games/banner/final-fantasy-iii.jpg",
  "icon_url": "/games/icon/final-fantasy-iii.png",
  "is_public": true,
  "updated": "2019-12-28T20:52:18.391054Z",
  "steamid": 239120,
  "gogslug": "",
  "humblestoreid": "",
  "id": 2624
}