{
  "name": "Might and Magic II: Gates to Another World",
  "slug": "might-and-magic-ii-gates-to-another-world",
  "year": 1988,
  "description": "What is happening in CRON? Chaos sweeps across the land, wreaking havoc among its peace-loving citizens. Respected and powerful community leaders are vanishing mysteriously, law and order is quickly being replaced by sword and sorcery, and rumors of doom and death abound. What can you do?\r\n\r\nEmbark on a glorious journey to save the world of CRON and yourself. Hundreds of quests matched to your personal proficiency will test your ingenuity, over 250 animated monsters will contest your might in an advanced combat system, while 96 spells, more than 250 weapons and items, two new character classes, hirelings, and 15 secondary skills will aid your cause.\r\n\r\nWhere will your travels take you? Expect to get down and dirty while you explore grim forests, arid deserts, frosty tundra, wild rivers and mysterious lakes, treacherous mountains, ominous castles and disreputable cities. And after all that you might even have to enter one, some, or all of the dreaded elemental planes. Could this even be enough? Probably not, for just as you have mastered modern CRON, you will have to travel through the very fabric of time itself to right ancient wrongs. But you don't have to worry about mapping all of these. While you enjoy our intricately detailed 3-D color windows, our new auto-mapping feature remembers every square you have ever crossed, indoors and outdoors, across all centuries.\r\n\r\nMight and Magic II contains all the basic elements of adventure; excellent graphics, time-conserving auto-mapping, spells and weapons galore to combat fierce, animated monsters, while developing and sustaining an exciting lore of the land. Gates to Another World, sequel to the smash hit Might and Magic Book 1, allows transfer of characters from Book 1, yet no previous Might and Magic experience is necessary.",
  "banner_url": "/games/banner/might-and-magic-ii-gates-to-another-world.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:23.254402Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 21501
}