{
  "name": "Diluvion: Resubmerged",
  "slug": "diluvion-resubmerged",
  "year": 2017,
  "description": "Diluvion: Resubmerged has been rebuild from the ground-up and introduces brand new features which add more strategic depth to looting, managing your unique crew, and upgrading your different submarines to fit player’s needs- and playstyles. Salvaging is more dynamic than ever with hazard battles that require your crew’s abilities and items to overcome, and a new forging system offers greater customization of your vessel with upgrades for armor, depth range, life support and more. The update also includes enhanced visuals, mappable gamepad controls, new graphics settings, a complete UI overhaul with improved quest tracking and waypoints, the ability to save anywhere, and revamped landmark, navigation and pathfinding systems. Lastly new side quests, artwork and music alongside a number of quality-of-life improvements.\r\n\r\nForced into the deep oceans by a Great Flood that occurred countless centuries ago, humanity now lives trapped under a thick layer of unbreakable ice and their survival hangs by a tenuous thread. However, their penchant for perseverance is strong, and a new civilization has emerged with distinct kingdoms, religions and cultures. By a twist of fate you, an aspiring submarine captain, have been given the honor of commanding your first sub. With a brave crew at your command, you now venture into the unknown on a quest to discover humanity’s greatest secret.\r\n\r\nExplore the dangers of the depths in this beautifully realized flooded world, and unearth untold riches and glory. Discover the remnants of civilization in numerous unique towns and learn their local lore, trade stories and treasure, and hire crew new members.\r\n\r\nContinuously improve each of the game’s 9 unique pilotable submarines using a deep upgrade system, and gain access to new areas and loot. Discover numerous types of cannons and torpedoes to help you overcome the dangers of the deep, and assemble your own unique crew to brave it alongside you. Whether you wish to play as a silent hunter or a guns blazing dreadnought, arrange your crew members and weapons to fit your playstyle.",
  "banner_url": "/games/banner/diluvion-resubmerged.jpg",
  "icon_url": "/games/icon/diluvion-resubmerged.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:39.985292Z",
  "provider_games": [
    {
      "name": "Diluvion: Resubmerged",
      "slug": "1276899051",
      "service": "gog"
    }
  ],
  "steamid": 446790,
  "gogid": 1276899051,
  "gogslug": "diluvion",
  "humblestoreid": "",
  "id": 14915
}