{
  "name": "Burnout 2: Point of Impact",
  "slug": "burnout-2-point-of-impact",
  "year": 2002,
  "description": "Racing a car is one thing, but racing into traffic at high speeds, where you are rewarded for the style of your crash, is another. This is the idea behind Burnout 2, which brings new modes and higher speeds compared to the original title. As usual, the aim is to speed around real life roadways, through the traffic ahead, while avoiding collisions.\r\n\r\nBurnout is a street racing game focused around speed and crashing. Unlike many games which focus on closed course driving, you get to drive through cities with real traffic and city infrastructure. Designers have built city districts and surrounding areas, and implemented the race courses throughout the streets. As a result, many times certain parts of race-courses interlace with other parts of other races. As well, instead of encouraging strategic driving and safe driving, Burnout strongly encourages offensive driving. Driving on the wrong side of the road, barely missing passing traffic, drifting, and jumps all add to your boost \"burnout\" meter. Speed boosts and jumps aid your attempt to drive past buses, trucks and anything else that gets in the way. The more offensive and dangerous your driving is, the more boost you get!\r\n\r\nBurnout 2 contains a full campaign and custom car campaign. While you can unlock regular cars and tracks, later in the campaign you unlock more raceways like reverse tracks and one-way sprints. You can unlock over 20 cars like a Nascar, a 1920s gangster car, a Japanese muscle, and many customized vehicles with custom paint jobs and upgraded stats.\r\n\r\nAlong with the same sense of speed and highly detailed crash animations as before, Point of Impact includes new modes of play. Pursuit mode has you playing the cop as you chase down the speeding motorists, and to win you must crash them out of the race. Or you can reverse that with a friend. You can flee from a friend while he attempts to chase you. Crash mode, as the name suggests, forces you to glide into crowded intersections to get the most cars involved in a pile-up as possible. The bigger the crash, the better. Up to 4 players can compete for the best score.\r\n\r\nTraining and 2 player racing modes are also included.",
  "banner_url": "/games/banner/burnout-2-point-of-impact.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-06-16T20:36:01.627308Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 37194
}