{
  "name": "Dragon Age: Origins - Ultimate Edition",
  "slug": "dragon-age-origins-ultimate-edition",
  "year": 2009,
  "description": "Four hundred years have passed since the last Blight was successfully prevented by the Grey Wardens. Now once again the fearsome Darkspawn under the rule of the Arch Demon gather and are about to invade the land of Ferelden. The first battleground: the destroyed city at Ostagar, where the Grey Wardens meet the army of Cailan, king of Ferelden, to try and stop the Darkspawn, preventing death and destruction before it has even begun.\r\n\r\nHowever, during the battle, the forces of general Loghain inexplicably abandon the battlefield. As a result, the Grey Wardens, the king, and most of the human warriors are killed. Among the few survivors is the hero, who had joined the Grey Wardens just before the battle, and must now find a way to unite the races of Ferelden in a struggle against the common enemy.\r\n\r\nDragon Age: Origins is a party-based third-person perspective role-playing game. Similarly to Baldur's Gate, combat is in real time, with the ability to pause at any moment. Tactical options include an editor which allows the players to give the AI detailed instructions on how to behave in every possible situation. Nonetheless the player can also control the party (with up to four active combatants) one by one, switching between the characters, using their special talents and abilities to overcome the many different enemies. During the course of the game, the player will have the opportunity to invite up to nine players to his party. While only four can leave the party camp at any given time, the experience points earned by killing enemies, fulfilling quests or simply opening a chest are granted to each member of the group.\r\n\r\nAt each level-up a character earns three attribute points and one talent point. The talent point is used to unlock new spells and abilities in the extensive talent tree differing greatly between the three available classes: warrior, rogue and mage. Every three levels the character also earns a skill point allowing him/her to learn or get better at herbalism or increasing survival skills. In addition, at level 7 and 14 characters earn a specialisation point which allows them to learn two of four class specializations, such as for example shapeshifter and spirit healer for the mage class. These specializations give instant bonuses to certain attributes and unlock five exclusive talents. However, in order to learn such a specialization, it needs to be unlocked first. This is either done by buying the corresponding book from traders, or by learning it from another character, may it be a non-playable character or a party member.\r\n\r\nNot everyone is willing from the start to teach the protagonist. In particular the player's party members have to have a certain level of trust and satisfaction. Satisfaction can range from -100 to +100 and is influenced heavily by the decisions the player makes during the game. Talking and giving gifts to the party members also increases their satisfaction. A high level of satisfaction then grants the party member a bonus to specific attributes and unlocks additional quests as they open up and tell their past. In addition, it is possible to have a romance with up to two of the party members if the player character is of the right gender and makes the right dialogue choices.\r\n\r\nAlthough the main part of the game is the same for every character created and will only differ in what the player decides to do first or what choices he or she makes, the game features six unique prologues (called \"origin stories\" in the game) - two for each race, except the humans who share the magi origin story with the elves. They all tell the story how the player's character met the Grey Warden Duncan and ended up at the battle at Ostagar.\r\n\r\nThe console versions lack the tactical overhead view available in the PC version. The controls are designed in such a way that it is easier to control one characters and let the AI handle the rest of the party, as opposed to the PC version, where the entire party can be handled with more ease. Also, the default difficulty level on the consoles is lower than on the PC.",
  "banner_url": "/games/banner/dragon-age-origins-ultimate-edition.jpg",
  "icon_url": "/games/icon/dragon-age-origins-ultimate-edition.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:40.550277Z",
  "steamid": 17450,
  "gogslug": "dragon_age_origins",
  "humblestoreid": "",
  "id": 606
}