{
  "name": "Day of Infamy",
  "slug": "day-of-infamy",
  "year": 2017,
  "description": "Experience hardcore gameplay with an emphasis on teamwork oriented objectives and high lethality gunplay with nine specialized player classes.\r\n    Secure positions, destroy enemy equipment, assassinate enemy officers, and move the line forward in 7 player versus player game modes and 3 cooperative modes against AI.\r\n    Fight through fortified beachheads, war-torn villages, destroyed cities and snow covered forests in 14 different levels based on World War II battles throughout Europe.\r\n    Communicate using proximity VOIP that nearby friendly and enemy players can hear, and broader VOIP communication through equippable radio backpacks.\r\n\r\n    Use over 60 weapons including everything from Thompson sub machine guns to PIAT bomb launchers to FG42 auto rifles and flamethrowers.\r\n    Customize weapons with bayonets, grenade launchers, stripper clips, extended magazines, slings, cloth wraps, and more.\r\n    Work with your teammates to call in explosive, smoke, and incendiary artillery fire support as well as carpet bombings, Stuka dive bombers, Typhoon rocket strafes, P-47 machine gun runs, and supply drops.\r\n\r\n    Progress through the ranks and unlock 33 different playable units of the US Army, British Commonwealth and German Wehrmacht factions like the 101st Airborne Division, No. 2 Commando, and 1. Fallschirmjäger Division.\r\n    Hear over 8000 lines of voice over including American, British, German, Canadian, Australian, Scottish, Indian, and African-American characters, each a part of their historic military units.\r\n\r\n    Get new official content updates for free including maps, features, and more.\r\n    Download over 1,200 community made mods, levels, sound packs, weapon skins, character skins, and other custom content on the Steam Workshop.",
  "banner_url": "/games/banner/day-of-infamy.jpg",
  "icon_url": "/games/icon/day-of-infamy.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:05.683678Z",
  "provider_games": [],
  "steamid": 447820,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 8965
}