{
  "name": "Dynasty Warriors 4: Empires",
  "slug": "dynasty-warriors-4-empires",
  "year": 2004,
  "platforms": [
    {
      "name": "Sony PlayStation 2"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "Hack and slash"
    },
    {
      "name": "Strategy"
    }
  ],
  "aliases": [],
  "description": "Dynasty Warriors 4: Empires is a strategy-oriented variant of Dynasty Warriors 4, mixing it with gameplay similar to Romance of the Three Kingdoms. The heart of the game, campaign mode, begins by choosing any of 24 regions and 42 rulers (custom characters can be created). Beginning with a small kingdom, the ultimate goal is the conquering of all others. Each turn, the player is given a choice from 4 different governing options (brought to your attention by your generals) followed by a single decision of action. These actions typically include the invasion or defense of a specific province or the option to aid an allied empire with those same actions.\r\n\r\nIn any battle, be it offense or defense, the player chooses up to three generals and three lieutenants and their troops to form the army. Soldiers fill the battlefield with different ranks and styles (normal, archers, guards, sorceresses and 2 types of siege weapons) as well as horses which can be riden. The player, in 3rd person perspective, may guard, parry, attack, charge, fire arrows, jump, announce or charge up to unleash a special musou attack. All generals and lieutenants are displayed on the map and may be attacked or challenged. Enemy characters who are defeated enough times in a battle can be challenged to a duel. The obvious goal of the battlefield is to control strongholds at strategic points that will make it easier to defend or reach a certain area or opponent. At any given time, these stronghold areas are under control of either of the two sides. They are won by defeating all of the opposing forces in the immediate area. Strongholds routinely generate health recovery items. The winner of a offensive action can win territory and capture enemy soldiers. Each province under control of an empire nets that empire 100 gold each turn which may be spent on various governing decisions.",
  "banner_url": "/games/banner/dynasty-warriors-4-empires.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:20.460836Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}