{
  "name": "Irony Curtain: From Matryoshka with Love",
  "slug": "irony-curtain-from-matryoshka-with-love",
  "year": 2019,
  "description": "Take a look behind Irony Curtain in this satirical point-and-click inspired by the best works of LucasArts and Daedalic Entertainment! Experience the totalitarian Matryoshka through the eyes of Evan – a low-ranking, goofy journalist involuntarily pulled right into the middle of an espionage stand-off between two powers. Jump into the wacky spy adventure, uncover secrets of the bizarre communist country (and the powerful capitalist empire!), witness a story full of unpredictable twists and turns, and discover the true agenda of the mysterious Supreme Leader!\r\n\r\nWhat business might the loving father of the Matryoshkan nation have with a lowly, capitalistic pen-pusher?\r\nWhy suddenly lift the Irony Curtain and welcome a stranger into Matryoshka? \r\nAnd why is there an alligator in the middle of the bathroom?!\r\n\r\n\r\n\r\n\r\nAn original setting: fictional Cold War era – alternate reality unbound by historical accuracy, and the communistic Matryoshka full of people who work all the possible angles to navigate this illogical, odd country.\r\nInspired by classic adventure games – but better. No dream-logic, no pixel hunting. No-nonsense. Pure point and click fun.\r\nThe Spy Intrigue – sleeper spies, stolen secrets and world-domination plots wrapped up in layers of humor.\r\nQuirky characters – Meet the mysterious Leader ruling Matryoshka with an irony fist, the clueless and guilible Evan, the brave and witty Agent Anna and the notorious Minister of Propaganda... \r\n\r\nDo it your way – some of the puzzles are non-linear and can be solved in two or more different ways. \r\n21 hand-painted locations – that look surprisingly better than their original inspirations. \r\n1,951 cleverly sneaked-in easter eggs – some of them punishable by political imprisonment. \r\nMusic score as grand as Matryoshka itself - music by the state composer Arkadiusz Reikowski (Layers of Fear, My Brother Rabbit) with Main Theme by Peter McConnell (Monkey Island, Grim Fandango)\r\nFull voice-over – in English, and subtitles in Polish and German.\r\nA 5-year plan – that no one ever hoped to achieve, and neither should you.",
  "banner_url": "/games/banner/irony-curtain-from-matryoshka-with-love.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-05-31T00:17:45.960727Z",
  "steamid": 866190,
  "gogslug": "irony_curtain_from_matryoshka_with_love",
  "humblestoreid": "",
  "id": 27500
}