{
  "name": "Europa Universalis",
  "slug": "europa-universalis",
  "year": 2001,
  "platforms": [
    {
      "name": "Linux"
    },
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Real-time strategy"
    },
    {
      "name": "Turn-based strategy"
    }
  ],
  "aliases": [],
  "description": "The year is 1492. Life in Europe is determined by conquests, colonization and power-struggles. The world is changing faster than ever before - and you can be a part of this change. As a leader of one of the large European states the history of Europe lies in your hands. You have to explore, conquer and colonize in order to strengthen your position of power and defend yourself from the other states. Build rich cities, forge diplomatic ties and recruit a powerful army - every sunrise offers you new chances in this era of exploration. Use your power carefully, one step in the wrong direction could have disastrous effects: famine, unemployment and poverty threaten your population. And those around you are waiting for you to make that wrong decision. Smell the power of the great old Europe! Take part in the birth of the new world. The future is uncertain - but it lies in your hands!\r\n\r\nKey Features:\r\n* Control one of the twelve large nations such as the Netherlands, Austria, England or France.\r\n* Play 2 scenarios with a total of more than 150 missions, from the discovery of America up until the French Revolution.\r\n* More than 270 historical characters such as George Washington influence events as they unfold.\r\n* Detailed historical map of the world with more than 800 provinces, 550 seas and lakes and 100 rivers.\r\n* Real-time strategy which with an intelligent pausing function allows you to plan your strategy: semi real time.\r\n* Multiplayer option via network or internet.\r\n* Historically correct soundtrack and SFX",
  "banner_url": "/games/banner/europa-universalis.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:25.737786Z",
  "steamid": null,
  "gogslug": "europa_universalis",
  "humblestoreid": ""
}