{
  "name": "Celestian Tales: Old North",
  "slug": "celestian-tales-old-north",
  "year": null,
  "description": "A Story of Life\r\n\r\nThe Old North is a world of fantasies and realities. Of swords and sorceries, yet of humans and mortals. A world where the utmost evil is not a dimension-defying sorcerer or an awakened godlike creature of ancient myths, but the darkness lurking in every man's heart. A world where peace, love, and compassion stand side by side with hatred, pride, and jealousy. A world where the virtues and vices of humanity are two sides of the same coin. Grey morals, questionable justice, and blind faith are among the main themes of the Old North. \r\n\r\nIn this story there will be neither time-travelling, selective amnesia, nor god-killing. It is not a tale of a chosen one destined to save the world to fulfil a prophecy. It is an epic odyssey of struggles and of joy; of common humans reaching for a better future.\r\n\r\nSix Points of View\r\n\r\nA noble prepared to sacrifice those of lower birth for the greater good. A loyal soldier bred for the fields of battle. A prodigy in strength pushing through any obstacles by force. A knowledge-hungry explorer shackled by the chains of duty. A peasant crawling out from a life of poverty. An outsider questioning the natural evils of humanity. A cause to unite them all.\r\n\r\nOne's truth may not be another's. Good deeds done by someone may be perceived by another as evil. Often we see only what we want to see and believe only in what we want to believe. Whose steps will you follow as you journey in the Old North? Through whose eyes will you experience the events that unfold?\r\n\r\nSpanning Three Decades\r\n\r\nBegin your journey as a youth learning your steps into knighthood. Serve great and powerful heroes as their squires. Take part in campaigns of glory by their sides. Be there as time withers even the mightiest of mortals. When heroes of today replace the yesterday, will you stand to defend your ideals? Will you be steadfast as realities confront your naive thoughts? Will your dark secrets be kept hidden from even dearest ones?\r\n\r\nAs decades change and life throws its worst, many a people come out a different person. That face you're looking at the mirror might not be a face you used to know. Flames once shining in your eyes might have turned to cold ashes. Sincere laughters might have vanished into fake smiles to please your peers. Or perhaps you will stay the same, as unrelenting as ever in your beliefs. The path of life has many branches; it is up to you to pick which to tread.",
  "banner_url": "/games/banner/celestian-tales-old-north.jpg",
  "icon_url": "/games/icon/celestian-tales-old-north.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:37.348894Z",
  "steamid": 315860,
  "gogslug": "celestian_tales_old_north",
  "humblestoreid": "",
  "id": 4014
}