{
  "name": "Keef the Thief: A Boy and His Lockpick",
  "slug": "keef-the-thief-a-boy-and-his-lockpick",
  "year": 1989,
  "description": "Play Keef the Thief, a promising young thief who finds himself on the outskirts of the Mercon the Merchant City. Considering the penalty of thievery is the removal of certain body parts, our young hero must be careful in his profession and ultimately (among others) train himself to access and steal from the city treasury.\r\n\r\nKeef the Thief: A Boy and His Lockpick is a first-person perspective role-playing game. It has elements of parody, clearly identifiable from various descriptions in the game and enemy names during combat. One of the goals in the game is to steal everything in sight - at least in the city. The game map itself includes, beside the city, various dungeons, jungles, and an arena, among others.\r\n\r\nThe game introduces four vital elements of game play: Thievery, Adventuring, Combat, and Alchemy: \r\n\r\nThievery\r\nThe thievery element is based on the ability to disarm traps before the player can loot treasure. There are many houses or other places where the player can steal valuable objects (at least within the city walls). The higher the skills, the more options the player has to rightly pick which course the player wants to choose to disarm a trap.\r\n\r\nAdventuring\r\nWhen the player has stolen everything valuable from underwear to gold crowns from the city, eventually the player will have to venture outside the city into the unknown depths of the surrounding jungle. There are a lot of places that has yet to be discovered in the game. Just be sure to be well equipped with armor and weapons. Monsters have a bad habit of popping up, almost always!\r\n\r\nCombat\r\nThe first-person real-time combat setting comes complete with a top-down radar indicating the player's positioning and the enemies. In the combat screen the player can melee to victory or just shoot them from a distance. That is if the player has the appropriate weapons available.\r\n\r\nAlchemy\r\nFor the most part it's alchemy, though magic spells are also created through this process. Collecting ingredients is one thing, experimenting on what works is another. Sometimes the player may get lucky and find a recipe. Sometimes.",
  "banner_url": "/games/banner/keef-the-thief-a-boy-and-his-lockpick.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-10-22T22:06:50.311676Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 29450
}