{
  "name": "Crysis 3",
  "slug": "crysis-3",
  "year": 2013,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Action"
    },
    {
      "name": "Shooter"
    }
  ],
  "aliases": [],
  "description": "Crysis 3 is the third main game in the first-person shooter series. Players take the role of Laurence \"Prophet\" Barnes, a character featured in the previous two games but now for the first time as the protagonist. Set 24 years after the events of Crysis 2, it takes place in 2047. Once again the main character is equipped with a nanosuit that provides formidable abilities. Prophet returns as his personality and memories that were stored in the nanosuit are assimilated with the body of Alcatraz, the protagonist of the previous game, replacing his consciousness. What is left of Manhatten has been placed under a large dome by the Cell network to protect what is left of the alien civilization. Together with a team of elite soldiers, including his former team mate Psycho, Prophet travels to different locations to track down the Alpha Ceph, the leader of the Ceph race, and it plays out over seven chapters. Some story elements are explained by collecting audio diaries throughout the game.\r\n\r\nThe setting mixes urban environments with lush, jungle-like growth. The bow is introduced as one of the prominent weapons. It is used for one-hit kills and can still be fired while Prophet is cloaked. There are different types of arrows to choose from. That way, stealth and sneaking optionally plays a larger role than in the previous games. Enemies consists of both humans and aliens, and of course regular weapons can still be used. They range from assault rifles and grenades to exotic types and there is also melee combat. The player can determine the nanosuit's configuration, focusing for instance on cloak or rather a strong armor with the capacity to take a lot of damage, or a speed mode to run fast and jump high. Configurations can be switched on the fly to adapt to situations quickly. By completing primary and secondary objectives, upgrade points can be gathered to extend the nanosuit abilities. Weapons can also be customized with various enhancements influencing weapon statistics such as accuracy, rate of fire, mobility, damage, range and stability. A tactical visor is used to scout the environment and to locate weapons and ammo. It can also be used to detect heat and tag enemies. The game also includes a hacking mini-game.",
  "banner_url": "/games/banner/crysis-3.jpg",
  "icon_url": "/games/icon/crysis-3.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:01.509442Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}