{
  "name": "Phantasy Star IV: The End of the Millennium",
  "slug": "phantasy-star-iv-the-end-of-the-millennium",
  "year": 1993,
  "description": "The Algol star system is in troubled times. Many thousands of years ago, it was a peaceful world. Three planets surrounded the Algol star and were in perfect harmony: Palma, a lush green planet, where its citizens devoted their lives to arts and the sciences; Motavia, a desert planet, inhabited by humans and native Motavians; and the enigmatic Dezolis, a harsh ice planet, where the citizens were just as unknown as the planet itself. Unfortunately, the harmony and balance was not to last. Palma had exploded, and with it, ninety per cent of Algol's population died. Motavia had fallen into horrible conditions from the explosion, turning almost into a total wasteland. The Darkness spread its hand over the land.\r\n\r\nA thousand years have passed. Motavia has healed somewhat, and life is beginning to return to the way it once was many years ago. The Hunter's Guild on Motavia helps to keep things steady. But a dark evil once thought to be long dead is beginning to stir once again, and the young hunter, Chaz, is about to begin his ultimate adventure - which starts with one simple routine assignment...\r\n\r\nPhantasy Star IV is a Japanese-style role-playing game with top-down world map exploration, random enemy encounters, and turn-based combat. The gameplay of the fourth entry in the series is similar to that of the second installment, sharing notable features such as the ability to equip two weapons at once, most of the \"techniques\" (equivalent to magic spells in comparable games), etc. The dungeons are noticeably less maze-like than in Phantasy Star II. Player-controlled party may include up to five active combatants.\r\n\r\nAs before, leveling up and technique-learning is automatic, save for android characters, whose abilities are found in treasure chests in the dungeons. Androids also cannot be healed by conventional means and use their own item sets. Beside regular attacks and techs, characters also possess unique attacks that have limited uses and can be replenished after the character rests. Characters can also execute combination attacks, merging two or more techs or special attacks. The player may opt to assign macro command sets for the party instead of inputting commands manually.\r\n\r\nThere are a few segments in the game with vehicle combat, which mostly follows the same turn-based formula as the regular battles. Side quests are present in form of hunter assignments for Chaz and his friends. A \"party talk\" feature is available, displaying conversations between player-controlled characters. The game uses manga-style comic book panels as cutscenes.",
  "banner_url": "/games/banner/phantasy-star-iv-the-end-of-the-millennium.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:43.560361Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 19348
}