{
  "name": "Excite Truck",
  "slug": "excite-truck",
  "year": 2006,
  "description": "A launch game for the Nintendo Wii, Excite Truck is the \"sequel\" to the Excitebike games for the NES and N64. The term sequel is used lightly, because now instead of playing on motorcycles, you are racing monstrous trucks across constantly transforming outdoors terrains.\r\n\r\nLike its predecessors, Excite Truck is a racing game pitting you against multiple opponents or other players. Players have the ability to play in tournaments against NPC's to unlock medals, play head to head, or play a single-player special mode. Single player features a mode that allows players to go up against computer-controlled trucks in a competition with two branching difficulties across 4 medal challenges (bronze, silver, medal, platinum). The multiplayer head-to-head also allows for two players to race their trucks against each other, but without the use of the other NPC trucks. Special modes include a slalom challenge, a leap-through-rings jumping challenge, and a demolition derby. Players race on outdoor tracks in a number of locales from Fiji to Scotland. The map is littered with obstacles such as jumps, water hazards, and cliffs to impede your progress.\r\n\r\nInstead of using a traditional joystick, the game is specifically designed around the Wii remote's motion sensing ability. The controller is held sideways without the nunchuk attached, like a steering wheel. Players tilt the controller left and right to turn their truck. In the air, players can tilt the remote back and forth to lean their truck forward or backwards. The #2 button is used for gas, and the D-pad can be used for a turbo.\r\n\r\nThe term \"Excite\" is not just used to make the game look like the sequel to an old NES classic. Excite Truck features a complete loss of realism, emphasis on turbo, and chaotic game play. Players have the ability to push their truck's speed far past physical limitations, and jumps can be used to achieve jump heights akin to the N64 game San Francisco Rush. Simply by picking up icons, players or even NPC's can reform the land to make shortcuts and ramps. The game encourages the players' use of turbo, and even emphasizes chaotic driving through its overuse. Some stunts may even be rewarded by more boost or a power-up.\r\n\r\nPulling off these maneuvers is not just a feature, but a core mechanic that is used to progress through the game. Like the Burnout series, performing death-defying stunts not only benefits the player, but rewards them with \"star points\". These points are what actually unlocks new modes and races. While coming in first place is important to earn more star points, it may not be necessary if the player drives crazy enough during the race.",
  "banner_url": "/games/banner/excite-truck.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2020-03-22T07:20:14.862006Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}