{
  "name": "King's Quest VI: Heir Today, Gone Tomorrow",
  "slug": "kings-quest-vi",
  "year": 1988,
  "platforms": [
    {
      "name": "MS-DOS"
    }
  ],
  "genres": [
    {
      "name": "Adventure"
    },
    {
      "name": "Point-and-click"
    }
  ],
  "aliases": [],
  "description": "Be prepared for a spectacular adventure, three times larger than any previous Sierra adventure, a landmark in computer gaming that transcends existing standards of computer graphics, sound, and animation.\r\n\r\nPowerfully dramatic, King's Quest IV evokes emotion like no other computer game with a unique combination of lifelike animated personalities, beautiful landscapes, and soul-stirring music. Sierra has recreated the universe of King's Quest, a world that one moment will pull at your heartstrings, the next moment place terror in your heart. Uniting the best programmers, artists, and musicians in the business, Sierra has created a constantly evolving universe where landscapes change from day to night, characters roam freely, and dramatic music interludes tantalize your emotions in a complicated tale of faith and mistrust. Your quest begins with a full-length cartoon and proceeds to plunge you into a fantasy world of mystery, intrigue, and enough plot twists to confound even the most dedicated adventurer.\r\n\r\nEmbark upon a perilous journey into the darkest corners of the King's Quest universe. Not one, but many successful quests must be completed to save the royal family from a tragic destiny. With a surprise introduction and an equally unexpected conclusion, plot twists abound as you strive to discover the mysteries of a strange land, overcome its hostile inhabitants, and reveal the secrets hidden therein.\r\n\r\nRoam the grounds at night and discover areas which remain hidden during daylight hours. Travel swiftly, as time is of the essence, and each moment brings the royal family closer to ruin.\r\n\r\nFeatures:\r\n*    A full-length cartoon introduction to the game (approximately 10 minutes running time)\r\n*    Complete day and night cycle.\r\n*    Several mini-quests to complete before the final quest can be finished.\r\n*    40 minutes of original music composed and performed by William Goldstein (Fame television series, Hello Again, a Touchstone film, Switched on Classics, a top record album).\r\n*    Many strange and unusal places await your arrival.\r\n*    Explore the countryside carefully (some things happen only at night!)\r\n*    Encounter characters from ancient folklore and legend.",
  "banner_url": "/games/banner/kings-quest-vi.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:04.864057Z",
  "steamid": null,
  "gogslug": "kings_quest_4_5_6",
  "humblestoreid": ""
}