{
  "name": "Doom RPG",
  "slug": "doom-rpg",
  "year": 2005,
  "platforms": [
    {
      "name": "J2ME"
    }
  ],
  "genres": [
    {
      "name": "FPS"
    },
    {
      "name": "RPG"
    }
  ],
  "aliases": [],
  "description": "DOOM comes to mobile devices as a first-person turn-based role playing game, co-developed by John Carmack. It incorporates many elements of the original game, but was designed with the limitations of the platform in mind. Instead of giving complete freedom, you move in steps and turn by 90 degrees. You can move as fast as you want, but when a monster appears, the game becomes completely turn-based, both for movement and attacks.\r\n\r\nYou are a space marine dispatched to a UAC research facility where a distress call was sent out. You start with a limited amount of health, armor and weapons. As you progress and kill monsters, you gain experience and level up to improve health, strength and agility. When engaging in a fight, hits are determined by your statistics, the type of enemy and the weapon you are currently using. Each enemy has a weapon weakness. You can also collect credits to buy upgrades at computer terminals and talk to characters. The story is revealed through conversations with characters and scripted sequences.\r\n\r\nFamiliar elements in the ten new levels of the game are the textures, the HUD, explosive barrels, health vials, ammo and armour skulls to collect, green, blue, yellow and red key cards, secret areas, and of course the weapons, armour and enemies. Next to the pistol, shotgun, super shotgun, chaingun, plasma gun, rocket launcher and BFG-9000, there is also an axe to break doors, a fire extinguisher to put out fires and a mystical weapon called Demon Wolf. A dog collar can be used against dog-like creatures. Medikits, a soul sphere and berserker give you the edge in difficult fights.\r\n\r\nPuzzles often involve key cards, computer terminals and conversations with characters. Important clues and passcodes are stored in your notebook and the auto map provides an overview of the large maps. True to the original game, there are secret areas and a full hidden level. Enemies have been divided over 13 different classes such as Zombie, Commando, Imp, Pain Elemental, Revenant, Baron... with two special creatures. There are 41 different enemies in total with familiar villains such as Mancubus, Cyberdemon, Commando, Bull Demon, Imp Lords...\r\n\r\nYou can save and load the game at any time. There are sound effects along with the original Doom title music.",
  "banner_url": "/games/banner/doom-rpg.jpg",
  "icon_url": null,
  "is_public": false,
  "updated": "2020-04-01T02:59:58.011196Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}