{
  "name": "Act of War: High Treason",
  "slug": "act-of-war-high-treason",
  "year": 2006,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Action"
    }
  ],
  "aliases": [],
  "description": "The highly anticipated sequel to the critically acclaimed game Act of War: Direct Action picks up where the techno-thriller left off. On the eve of the U.S. Presidential elections, simultaneous terrorist attacks hit both candidates. Clues point to corrupt elements within the U.S. military, but also to the shadowy organization known as the Consortium.\r\nYou take on the role of U.S. Army Brigadier General Jason Richter, a career soldier and former commander of the 1st Special Forces (Delta Force) who has been given control of an elite new anti-terrorist unit: Task Force TALON. From massive enemy assaults to delicate hostage extractions, from classified spy missions to search-and-destroy onslaughts, Task Force TALON is deployed to engage the enemy in hotspots around the globe. Using near-future weaponry, Richter's men will be pushed to their mental and physical limits to contain a powerful unpredictable enemy bent on toppling the governments of the world.\r\n\r\n\r\n-    Ultra-realistic modern military RTS with massive new features for both single and multiplayer\r\n-    Over 50 new multiplayer maps and new single player campaign\r\n-    Three new online multiplayer modes and customization options\r\n-    Naval combat with advanced water physics and expanded technologies\r\n-    Nine different mercenaries to expand the gameplay experience\r\n-    Over 50 new ships, tanks, planes, soldiers, and upgrades\r\n-    Enhanced A.I., graphics, artillery and aircraft handling, and much more!",
  "banner_url": "/games/banner/act-of-war-high-treason.jpg",
  "icon_url": "/games/icon/act-of-war-high-treason.png",
  "is_public": true,
  "updated": "2019-11-02T02:31:44.693945Z",
  "steamid": 9760,
  "gogslug": "act_of_war_high_treason_copy3",
  "humblestoreid": ""
}