{
  "name": "Distance",
  "slug": "distance",
  "year": 2014,
  "description": "Distance is an atmospheric racing platformer. Fusing futuristic arcade racing with parkour, survive a deadly, mysterious, neon-drenched city by jumping, rotating, and flying.\r\n\r\nThe roads are treacherous with obstacles around every corner. Instead of doing laps on a loop, survive to the end in the quickest time. Your car has abilities that not only allow you to drive on the track, but upside down and on buildings and walls! You can also fly to discover new shortcuts and paths. Take on the roads alone, or in multiplayer with your friends! \r\n\r\nThe game is a spiritual successor to the multi-award winning Nitronic Rush, created by ourselves and 5 others at DigiPen Institute of Technology. It was widely praised for its innovative mechanics, visual style, audio design, and atmosphere.\r\nKey Features\r\n* Adventure: A short single player experience. Drive into the heart of a dark, mysterious city as you pursue an ominous threat.\r\n* Arcade: Race ghosts to take on the leaderboards' best. Earn medals to unlock new tracks in several different modes.\r\n* Multiplayer: Online (up to 12 players) and split-screen (2-4 players) play in modes such as Sprint, Reverse Tag, Stunt, etc.\r\n* Trackmogrify: Random track generation with advanced seed modifiers.\r\n* VR: Full VR integration with support for Oculus Rift CV1 and HTC Vive.\r\n* Level editor: Use a powerful level editor to create levels from within the game and share them with players around the world. Over 2,000 levels have already been shared on Steam Workshop!\r\n* Original soundtrack: New music from the composer behind award-winning games like Nitronic Rush, Solace, and The Fourth Wall. Listen to a preview here.",
  "banner_url": "/games/banner/distance.jpg",
  "icon_url": "/games/icon/distance.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:13.655073Z",
  "steamid": 233610,
  "gogslug": "",
  "humblestoreid": "",
  "id": 3533
}