{
  "name": "Police Quest: In Pursuit of the Death Angel",
  "slug": "police-quest-in-pursuit-of-the-death-angel",
  "year": 1987,
  "description": "Forget the mindless garbage you've seen on television. A police officer's job consists of more than high speed chases and \"Dirty Harry\" shootouts. Drug traffic, homicide and violence provide the backdrop for their everyday existence. It's a grueling, thankless career of unending responsability and unexpected jeopardy.\r\n\r\nNow, to salute those \"blue knights\" who serve and protect, Sierra introduces Police Quest. An adventure game that lets you experience what it's like to be a real police officer.\r\n\r\nPolice Quest takes place in Lytton, a small town with a growing problem. A major criminal, dubbed by the press as \"Death Angel,\" is creating havoc in the community. Drug trafficking, robbery and murder have made the streets unsafe, and the crime wave is escalating.\r\n\r\nIn Police Quest, you take on the role of a street cop in uniform. You'll deal with the routine of police life, handing out tickets, attending briefings, and even discovering your best efforts tangled in the red tape of the judicial system. If you make a good cop, you may be asked to \"go undercover\" in an assignment to infiltrate the \"Death Angel's\" gang, and bring the racketeer to justice.\r\n\r\nThroughout the game, you must follow standard police procedures. You can't shoot first and ask questions later -- unless you want early retirement. One careless mistake, and you could make an arrest that won't hold up in court, or you might let a dangerous suspect get the upper hand.\r\n\r\nPolice Quest is a Sierra 3-D Animated Adventure. It is a game, but with its unflinching situations and real-life dramas, it isn't fantasy.",
  "banner_url": "/games/banner/police-quest-in-pursuit-of-the-death-angel.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-05-31T00:17:52.305637Z",
  "steamid": null,
  "gogslug": "police_quest_in_pursuit_of_the_death_angel",
  "humblestoreid": "",
  "id": 10269
}