{
  "name": "Root Double -Before Crime * After Days- Xtend Edition",
  "slug": "root-double-before-crime-after-days-xtend-edition",
  "year": 2016,
  "description": "The year is 2030. Business is as usual in the isolated research city of Rokumei–that is until several explosions suddenly go off in the nuclear research facility known as “LABO.” The city sends in “Sirius,” an elite rescue squad, to deal with the situation. But the situation only gets worse when LABO’s nuclear reactor melts down, sending the facility into lockdown–with members of Sirius and survivors still trapped inside. With lethal radiation leaking everywhere and not enough anti-radiation medication to last until lockdown lifts, the survivors make more and more grim discoveries. In their struggle for survival, in a deathtrap full of fire and radiation, they learn that doubt is their greatest enemy, and trust their greatest asset.\r\n\r\nThe story of Root Double features two different protagonists: Watase Kasasagi, a rescue squad captain who has lost his memories in the hours after the incident, and Natsuhiko Tenkawa, a student piecing together the clues in the six days before. The only key to survival lies in the player’s hands with the Senses Sympathy System (SSS). Unlike traditional visual novels, Root Double does not have clear cut “choices,” but rather, the game uses SSS to allow the player to manipulate the story based purely upon emotion. Your emotions projected upon the characters, particularly your trust in them, shape the progression of the story. Only with effective use of this system and completion of both protagonists’ stories can the player piece together the truth and hope to discover a way out of the facility.",
  "banner_url": "/games/banner/root-double-before-crime-after-days-xtend-edition.jpg",
  "icon_url": "/games/icon/root-double-before-crime-after-days-xtend-edition.png",
  "is_public": true,
  "updated": "2019-01-23T08:31:03.960231Z",
  "steamid": 438130,
  "gogslug": "",
  "humblestoreid": "",
  "id": 10551
}