{
  "name": "Fear Effect",
  "slug": "fear-effect",
  "year": 2000,
  "description": "It starts as a simple assignment for the three mercenaries - the beautiful, mysterious Hana, the former army officer Glas, and the ruthless killer Deke. Somewhere in the futuristic Hong-Kong, full of huge corporations, flying cars and helicopters, home for the famous Triad mafia, they have to find the young Wee Ming Lam, the daughter of a powerful gangster. But Hana and her partners don't suspect that the search for Wee Ming will lead them not only to very dangerous areas of Hong-Kong, but to outskirt villages infected by zombies, a dubious restaurant-brothel, and the Chinese hell, where they'll have to confront Yim Lau Wong himself - the Chinese equivalent of the Western Satan.\r\n\r\nThe gameplay of Fear Effect is similar to survival horror titles such as Resident Evil, but it also features many pure action elements and arcade-like sequences, where precise timing matters. The player controls Hana, Glas, or (in a few instances) Deke during different chapters of the story. Player characters can crouch, sneak on enemies, and roll forward or to the sides. There are many human as well as monster enemies to eliminate or avoid. Characters can run and shoot at the same time, as well as use two weapons at once to combat multiple enemies. A considerable portion of the gameplay is dedicated to puzzle-solving.\r\n\r\nInstead of the traditional health bar characters have a \"fear meter\", which turns red and eventually kills the character whenever he or she is damaged or found in a particularly stressful situation. The functional difference between the fear meter and a regular health bar is the possibility to restore it to a normal green color by reducing the character's stress, e.g. solving a puzzle or killing an enemy in a stealthy way.\r\n\r\nThe game's 3D character models are unshaded, aiming to resemble cel-shading technique and anime art. The backgrounds are pre-rendered and often consist of streaming or looping full-motion video. The story unfolds through numerous pre-rendered movies.",
  "banner_url": "/games/banner/fear-effect.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-12-17T02:26:10.113434Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}