{
  "name": "Four Horsemen",
  "slug": "four-horsemen",
  "year": 2017,
  "description": "Four Horsemen is a visual novel / SLG about homelands and the immigrant experience. Play as a group of four contemporary immigrant teenagers squatting in a World War II era machine gun bunker, trying to find a place for themselves in a pre-apocalyptic, present-dystopian country that has no place for them. Will you go native, turning against your own people to bury the past your parents fled to escape? Will you cling to your parents’ identity at any cost, at the price of being a permanent stranger in your adoptive country? Or will you strike out on your own, turning against both your homeland and your adoptive country to shape a destiny for yourself? Love is all you need…and also improvised firearms.\r\n\r\nFour Horsemen is not another hagiographic, pioneer-tradition, self-exotifying immigrant explainer about being slightly different. It is an exploration of human migration in terms of people–neither as mythology nor as political platform, but as a difficult decision made by ordinary human beings caught in impossible circumstances, with consequences that ripple for generations. This isn’t a game about finding yourself…it’s a game about your self finding you.\r\n\r\nDrawing from the developers' real lived experiences, interviews with current and former immigrant teens from around the world, and a year of painstaking anthropological research, featuring 4 different main storylines, 9 different endings, 12 different playable homelands (all of which play differently), and a multitude of agonizing, important decisions, Four Horsemen tells a powerfully compelling, heartrendingly familiar, brutally honest story about what it's like to be a stranger in a strange land. One playthrough can be finished in a matter of hours, but you’ll want to revisit it again and again to see all of the many stories the game has to tell…and to pursue that elusive dream of a land you can call your own.",
  "banner_url": "/games/banner/four-horsemen.jpg",
  "icon_url": "/games/icon/four-horsemen.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:34.417187Z",
  "steamid": 668200,
  "gogslug": "",
  "humblestoreid": ""
}