{
  "name": "Killzone: Liberation",
  "slug": "killzone-liberation",
  "year": 2006,
  "platforms": [
    {
      "name": "Sony PSP"
    }
  ],
  "genres": [
    {
      "name": "Shoot'em up"
    }
  ],
  "aliases": [],
  "description": "There are five chapters with 4 levels in which players eliminate the Helghast resistance (The fifth and final chapter was made available to download).[2] In Killzone: Liberation, two months after the events of Killzone, the Helghast have been dealt a hefty blow from the last game, but the war is far from over. The enemy still controls large parts of the planet Vekta, and though the ISA armies are fighting hard, they are losing ground. The rules of war have been cast aside with the sadistic Helghast General Armin Metrac, employed by the Helghast Emperor Scolar Visari to use brutal measures in order to seize the initiative after their past defeat and strengthen his position further. Metrac and his right-hand man, Colonel Cobar, are planning to capture three key figures of ISA, and their plan ends up successful.\r\n\r\nReturning as Jan Templar, players are sent on a covert operation to save hostages captured by Metrac, while ISA troops continue the fight for liberty. Rico Velasquez, Jan's friend on the battlefield, often assists him on his way through the enemy lines. Shadow Marshall Luger, another of Jan's partners, also helps him.\r\n\r\nAs Metrac captures ISA Minister of War Heff Milcher, scientist Evelyn Batton, and ISA General Dwight Stratson, Jan is sent on the rescue mission. After a set of military operations, Templar is closely following the trail of hostages and pursues Cobar, who has taken Milcher and Stratson. Milcher is then killed by Cobar, but Jan is nevertheless successful in defeating him, even though Cobar was piloting a personal walking tank. Cobar reveals that there is a traitor in ISA command who is helping the Helghast, but is finished off by Stratson before he can say who the traitor is.\r\n\r\nThe next step for Templar is to assault Metrac's mountain fortress and rescue Batton. Luger aids him on the mission. There, he fights many of Helghan's elite warriors (including a giant cybernetic unit) before encountering and killing Metrac in a final showdown.\r\n\r\nAfterwards, Templar locates Evelyn and escapes with her just before the fortress is destroyed. The game's outro marks the beginning of Killzone 2, as we hear Visari speaking of nuclear weapons which he intends to use on ISA forces.\r\n\r\nIn the fifth, downloadable chapter, Jan is sent on a mission to the Vektan capital city. Even though Metrac is no more, the enemy forces are still coordinated and fighting well. ISA believes that the unknown traitor is supplying Helghan with information. The only suspect is Rico, Jan's friend. Battling his way through the war-ravaged city, Jan finally finds Rico, who reveals that the traitor is, in fact, Stratson, who not only sold the planet to Helghast, but has become the shadow commander of the remaining Helghan forces. Jan proceeds to the capital building of Vekta, where Stratson is located, battling hordes of Helghast and even Stratson's personal elite guard on his way. There, he engages the general in combat. However, Stratson is well-prepared and uses his armored mecha against Jan, but is ultimately defeated. He, wounded, is then arrested by ISA forces.",
  "banner_url": "/games/banner/killzone-liberation.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:03.582089Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}