{
  "name": "Neverwinter Nights: Enhanced Edition",
  "slug": "neverwinter-nights-enhanced-edition",
  "year": 2018,
  "description": "Neverwinter Nights is a third-person role-playing video game developed by BioWare. Interplay Entertainment was originally set to publish the game, but financial difficulties led to it being taken over by Infogrames, who released the game under their Atari range of titles. It was released for Microsoft Windows on June 18, 2002. BioWare later released a Linux client in June 2003, requiring a purchased copy of the game to play. MacSoft released a Mac OS X port in August 2003. In 2018, Beamdog released an enhanced edition of the game that takes the original Aurora Engine and modifies it in a way to work out of the box on modern computers.\r\n\r\nImprovements include:\r\n* Improved Display: Your portrait, combat bar, inventory, and other UI elements adjust in size based on your chosen resolution including 1080p and 4k.\r\n\r\n* Advanced Graphics Options: Pixel shaders and post-processing effects make for crisper, cleaner visuals. Enable contrast, vibrance, and depth of field options as preferred.\r\n\r\n* Community Endorsed: Original developers have teamed with key members of the Neverwinter Nights community to curate important fan-requested improvements to support players, storytellers, and modders.\r\n\r\n* Backwards Compatibility: Works with save games, modules, and mods from the original Neverwinter Nights. A galaxy of community created content awaits.\r\n\r\n* Restored Multiplayer: A completely rebuilt multiplayer system makes it easy to find online persistent worlds and game with friends.\r\n\r\n* More Modder Opportunities: Toolset quality-of-life improvements, shaders, filters, texture maps, and a new material systems allow creators to make amazing looking models and modules.",
  "banner_url": "/games/banner/neverwinter-nights-enhanced-edition.jpg",
  "icon_url": "/games/icon/neverwinter-nights-enhanced-edition.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:31.986565Z",
  "steamid": 704450,
  "gogslug": "",
  "humblestoreid": "",
  "id": 17727
}