{
  "name": "Ryse: Son of Rome",
  "slug": "ryse-son-of-rome",
  "year": 2014,
  "description": "Ryse: Son of Rome is a third-person action-adventure hack and slash video game developed by Crytek and published by Microsoft Studios. It was released on November 22, 2013 as a launch title for the Xbox One, and was released on October 10, 2014 for Microsoft Windows by Crytek and Deep Silver. Set in an alternate version of Ancient Rome, Ryse follows the life of the Roman centurion Marius Titus as he becomes one of the leaders in the Roman Legion. Gameplay revolves around Marius using his sword to strike enemies and shield to deflect attacks. Execution sequences are featured in the game, which are quick-time events that serve as an extension to combat. The game features a cooperative multiplayer mode, which tasks players to fight against waves of enemies in maps that are changing dynamically.\r\n\r\nThe game's development began in 2006. Originally it was set to be a first-person Kinect-only title for the Xbox 360. However, the team later made three new prototypes, and redesigned to become a third-person hack and slash game, with Kinect serving a diminished role. The development of the game was originally handled by Crytek Budapest, but was later transferred to Crytek's headquarters in Frankfurt, Germany. The game's combat emphasizes on \"flow\", a term referring to a player's ability to move on to fight against another enemy upon defeating an enemy with few limitations in between.\r\n\r\nRevealed as Codename: Kingdom at E3 2010, the game was reintroduced as Ryse: Son of Rome two years later. It received a mixed critical reaction from reviewers upon launch, being praised for its visuals, story and high production values but criticized for its repetitive and simple gameplay. Cevat Yerli, CEO of Crytek, added that he was not satisfied with the sales of the game. Upon launch, the game was supported with several multiplayer-focused downloadable content, but the originally planned Challenge Editor was cancelled.",
  "banner_url": "/games/banner/ryse-son-of-rome.jpg",
  "icon_url": "/games/icon/ryse-son-of-rome.png",
  "is_public": true,
  "updated": "2019-06-01T06:28:37.146735Z",
  "steamid": 302510,
  "gogslug": "",
  "humblestoreid": "",
  "id": 4360
}