{
  "name": "Crusader Kings II",
  "slug": "crusader-kings-ii",
  "year": 2012,
  "description": "Crusader Kings II explores one of the defining periods in world history in an experience crafted by the masters of Grand Strategy. Medieval Europe is brought to life in this epic title rife with rich strategic and tactical depth.\r\n\r\nEurope is in turmoil. The lands are fragmented into petty fiefs, the emperor struggles with the Pope, and the Holy Father declares that all those who go to liberate the Holy Land will be freed of their sins. Now is the time for greatness.\r\n\r\nIncrease your lands and fill your coffers, appoint vassals, battle traitors, introduce laws while interacting with hundreds of nobles, and create the most powerful dynasty of medieval Europe. A beleaguered king will always have friends to support him. But beware, as your rule and realm may find trouble when a loyal vassal becomes a bitter rival. Stand ready, increase your prestige, and listen to the world whisper your name in awe.\r\n\r\nFeatures:\r\n* Start a game at any point between 1066 and 1337 and play until 1453\r\n* Pick a Christian lord and make sure his dynasty survives as you play a succession of his descendants through the ages\r\n* Gain Prestige for every successive character you play, furthering the glory of your Dynasty\r\n* Expand your feudal domain - and keep it from falling apart\r\n* Unravel the plots of your courtiers and vassals, each with their own opinions and agendas\r\n* Take up the Cross and fight the Moor, the Heathen and the Heretic.\r\n* Defend against the onslaught of the Mongol Horde\r\n* Struggle with the Pope for control of the bishops\r\n* Relive the Middle Ages with up to 32 other players in a competitive multiplayer mode ",
  "banner_url": "/games/banner/crusader-kings-ii.jpg",
  "icon_url": "/games/icon/crusader-kings-ii.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:01.202482Z",
  "provider_games": [],
  "steamid": 203770,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 653
}