{
  "name": "First Kiss Stories",
  "slug": "first-kiss-stories",
  "year": 2003,
  "description": "First Kiss Stories is a PlayStation 2 release which includes:\r\nFirst Kiss Story\r\nFirst Kiss Story II: Anata ga Iru Kara\r\nBoth games are integrated together and are ran from the main menu. This is also the only release of either of the two games for PlayStation 2 platform.\r\n\r\nFirst Kiss Story\r\n\r\nKnown as the last game originally released for PC-FX (with a PlayStation port being released seven months afterwards), First Kiss Story has the player assume the role of a high school boy (whom the player must name himself), whose parents left town one month before his graduation. So during this month, he will live by his parents' friends, the Orikura family, which consists of two sisters, Kana and Manami, and their mother, a young and attractive widow. Yes, you've guessed it - the hero (and by extension, the player) can conquer the hearts of all three, plus a dozen more lovely girls that populate the city of Akitsuki - and that is pretty much what the story is about.\r\n\r\nFirst Kiss Story is what is commonly called a \"visual novel\", with even less interaction than a typical Japanese adventure with its menu-based commands. All the player can do here is to access locations from the town map, and sometimes choose a dialogue option. The locations with a \"girl event\" in them are marked with a heart on the map. Depending on the decisions taken by the player, the hero will end up with one of the pretty girls.\r\n\r\nDespite suggestive themes and some mildly erotic images, there is no nudity in this game.\r\n\r\nThe PlayStation port includes additional content, along with alternative CGs for certain scenes, and spans two CDs, as opposed to one for the PC-FX version.",
  "banner_url": "/games/banner/first-kiss-stories.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-06-16T20:38:43.901467Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 36648
}