{
  "name": "Camelot Unchained",
  "slug": "camelot-unchained",
  "year": 2019,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "MMORPG"
    }
  ],
  "aliases": [],
  "description": "Welcome to\r\nCamelot Unchained™!\r\n\r\nThis is your story. This is the story of how you chose one of the three Realms and carved your name in the blood of your enemies. This is the story of how you became a legend. Whether you choose the noble Arthurians, the mysterious Tuatha Dé Danann, or the fierce Vikings, every battle changes you. Every building changes your world. Every adventure becomes a part of the story, raising your Realm's power and influence through combat or crafting. Gain power through using abilities instead of grinding experience points, and become mighty through great skill. Fight other players for resources or land, carefully coordinate attacks and sieges with your Realm, and write your tale in letters of fire for the tomes of history.\r\n\r\nRebuild a World:\r\nYour epic story does not require you to raid a dungeon day after day, hoping the right item will drop if you kill enough bosses: your story begins with survival. All the world was almost wiped out when the Veilstorms tore across the land, changing and breaking it apart. You live on, to rebuild and reconquer what remains.\r\n\r\nIn Camelot Unchained, a player-driven economy of shops and bazaars brings you into the immersive world. There are no real-world money shops for your hero to take the easy path. You must consult a master craftsman, who can create items as powerful as the harsh RvR world demands. You must win your Realm's trust, and earn the right to wield a mighty blade by equally mighty deeds. Drawing on ancient folklore from Arthur to Yggdrasil, the world is alive with strange creatures and stranger folk to meet; but your story rarely includes treasure simply found by the roadside.\r\n\r\nThis is Your Game:\r\nOur RvR game puts the power of choice in your hands. Camelot Unchained never tries to monetize you, never slows down, and won't be “free-to-play.” We respect your commitment to a subscription-based game; in return, you won't see thinly-veiled grabs for more money. Everything you need to succeed in Camelot Unchained requires skill and effort, not an open wallet. You will see your choices change your fate.\r\n\r\nCamelot Unchained is not just about the battle between three Realms; it is a world filled with rich lore, ancient yet written anew. While dungeon raids are not part of your daily ritual, you can fall deep into The Depths™, a creation from the mind of studio co-founder Mark Jacobs, which draws inspiration from the mythos of H.R. Giger and H.P. Lovecraft. It is a truly twisted place, a dark abyss that lives and breathes evil. If you dare to explore, know this: even after death, a player's soul can haunt and hunt other adventurers.",
  "banner_url": "/games/banner/camelot-unchained.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:45.134046Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}