{
  "name": "Dragon Ball: Origins",
  "slug": "dragon-ball-origins",
  "year": 2008,
  "description": "Dragon Ball: Origins, known as Dragon Ball DS (ドラゴンボールDS Doragon Bōru Dī Esu) in Japan, is a video game for the Nintendo DS based on the manga/anime franchise Dragon Ball created by Akira Toriyama. The game was developed by Game Republic and published by Atari and Namco Bandai under the Bandai label. It was released on September 18, 2008 in Japan, November 4, 2008 in North America, December 5, 2008 in Europe, and December 11, 2008 in Korea.[1] The game was released in Australia on December 4, 2008[2] and was later recalled as its PG rating did not reflect the racy content found in the game and was subsequently given a higher rating.[3]\r\n\r\nThe game allows players, with stylus and touchscreen, to take on the role of series protagonist Goku who must journey with Bulma to find the seven mythical Dragon Balls, and later train under the martial arts teacher Master Roshi to compete in the 21st Tenkaichi Budokai.\r\nThe game, for the most part, is presented in a 3/4 overhead perspective with elements similar to The Legend of Zelda: Phantom Hourglass.[4] Players take full advantage of the stylus and touchscreen capabilities by journeying through each level battling enemies, solving puzzles and collecting power-ups, health items, and various Zeni Bags. Although Goku's movements are controlled by the stylus, they're not limited to it as players can still use the directional button.[5] Over the course of the game players will learn new techniques to battle enemies with. Players can use their Skill Points to upgrade their levels to improve combat performance.[6]\r\n\r\nAnother feature is addition of Bulma, who will tag alongside the player in many of the levels throughout the game. Although she is armed with whatever weapon the player has given her, she is still vulnerable to any attack. Often the player will run into obstacles like a gaps or doors that will restrict Bulma's progress, which the player must remedy to proceed.\r\n\r\nThe game's primary mode is the \"Episode Select\", where players are given the option of playing each episode installment in chronological order or play them at random. Players can revisit these installments to either try to earn a higher rank or search for items they missed. As each installment is completed, a new installment is unlocked.[7]\r\n\r\nSome levels contain racing elements where players, on Nimbus, must arrive at a particular point or catch up with an opponent with a time limit or before the opponent moves out of range.\r\n\r\nAs a bonus, players are given the opportunity to collect figures throughout the game. These figures are eventually the avatars of all characters within the game. They can be either found in random places in each episode installment or purchased in the store. Each figure comes with its own animation that can be viewed in the \"Animation Figure screen\".[8] Players can also trade figures with other players via wireless multi-card play.[9]",
  "banner_url": "/games/banner/dragon-ball-origins.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:29:16.370370Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}