{
  "name": "Dragons and Titans",
  "slug": "dragons-and-titans",
  "year": 2014,
  "description": "Dragons and Titans is a fast paced MOBA with classic RPG elements, where your champions are Dragons and a variety of game modes gives you the power on how to play. Show true courage and skill to become the ultimate Dragon Lord as you embark on your quest to free your Titan from captivity.\r\n\r\nSelect from over 30 unique dragons and 30 legendary weapons, each with unique abilities and progression levels. Take your battle to the next level by upgrading your dragons as you gain experience and improving your weapons in the Forge. Free your Titan in fierce 5v5 PvP battles across 3 different map types or delve deeper into the story in ‘Adventure Mode’, traveling across different regions in the Lands Below, earning Dragons as you complete each set of missions. Gain favor with the Titans and climb the PvP leaderboards to prove your true worth as the ultimate Dragon Lord!\r\n\r\n*    Become the Ultimate Dragon Lord - Master over 30 Dragons, each with unique abilities. As you gain experience, level up your Dragons to dominate in combat!\r\n*    Discover a Deeper Story– Explore the vast regions of The Lands Below, embark on quests and be handsomely rewarded with Dragons for your heroism.\r\n*    Forge Your Weapons – collect elements during combat and upgrade weapons in the Forge to harness their true power!\r\n*    Take to the Skies Your Way - battle times of 10-15 minutes means you’ll be able to complete more matches across a variety of maps: traditional MOBA, Capture & Hold and ARAM. Choose your play style with 5v5 PvP, Co-Op or single player Adventure Mode!\r\n*    Dominate the leaderboards – compete against other opponents each Season to see who the ultimate Dragon Lords are and show off with exclusive winner avatars. ",
  "banner_url": "/games/banner/dragons-and-titans.jpg",
  "icon_url": "/games/icon/dragons-and-titans.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:16.689380Z",
  "steamid": 263500,
  "gogslug": "",
  "humblestoreid": ""
}