{
  "name": "Live for Speed",
  "slug": "live-for-speed",
  "year": 2003,
  "description": "Live for Speed is a serious racing simulator. No arcade modes, no steering aids - YOU have to do the driving.\r\n\r\nThe forces affecting the car's motion are simulated individually at each wheel. We recommend the use of a steering wheel, because although you can use the keyboard and/or mouse, a wheel and pedals provide a lot more accuracy. The force feedback sent to the steering wheel is calculated directly from the forces, with no canned effects. This allows you to feel what is happening at the contact patch between your tyres and the road, helping you to get closer to the limit without exceeding it too much!\r\n\r\nWhen you have a lot of speed and you approach a corner, you must brake well in advance or you will end up somewhere you don't want to be! You need to find the best way through any sequence of bends by going through them many times. There's always more to learn.\r\n\r\nYou can race alone, against the clock, or against the AI drivers. But for many people the real fun is to be found online, racing real people, in multiplayer mode. LFS makes it very easy for you to do so. Simply click \"List of Hosts\", select a server that looks interesting and join instantly. Many hosts run short races of a few laps, so there isn't usually too long to wait for a restart. Most public hosts allow you to join mid-race. Just make sure you keep out of the way of the people who started the race before you joined! There are also several online racing leagues you can take part in if you are looking for something with a more competitive edge.\r\n\r\nA serious simulator obviously requires a very good physics simulation to provide the thrill and fun of real racing. This is done by including all aspects that are important to racing. Live for Speed is in constant development. S2 is the second step towards our vision of the finished product, and already does a very good job in simulating real racing. Many aspects are covered - comprehensive setup possibilities, fuel usage, tyre wear, crash damage, different surface types, intriguing racing environments, different car classes and so on. All this makes sure you have plenty to practise with and spend time on, learning the flow of the tracks. Don't forget to plan your pitstops - find out how much fuel your car uses per lap and how your tyres behave on any track, with your particular car setup and driving style.",
  "banner_url": "/games/banner/live-for-speed.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:11.943574Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 3924
}