{
  "name": "Age of Wonders: Planetfall",
  "slug": "age-of-wonders-planetfall",
  "year": 2019,
  "description": "Emerge from the cosmic dark age of a fallen galactic empire to build a new future for your people. Age of Wonders: Planetfall is the new strategy game from Triumph Studios, creators of the critically acclaimed Age of Wonders series, bringing all the exciting tactical turn-based combat and in-depth empire building of its predecessors to space in an all-new, sci-fi setting.\r\n\r\nBuild your empire with one of six unique factions, ranging from the militant Vanguard to the dinosaur-riding Amazons and the cyborg-zombies of the Assembly. Progress through each faction’s missions using your wits, military strength and diplomacy, exploring planetary ruins and encountering other survivors as you unravel the history of a shattered civilization. Fight, build, negotiate and technologically advance your way to utopia in a deep single player campaign, on random skirmish maps, and against friends in multiplayer.\r\n\r\nTactical Turn-Based Sci-Fi Combat\r\n\r\nPerfect your combat strategy in intense turn-based battles featuring a large cast of factions, customizable units, and destructible environments.\r\n\r\nDiscover a Rich Science-Fiction World\r\n\r\nWhat secrets will unfold when you uncover the history of the fallen galactic empire? Discover the fate of the Star Union by exploring lush landscapes, wild wastelands and overgrown megacities. Encounter rival factions and discover hidden technologies long forgotten in abandoned places.\r\n\r\nPlanetary Empire Building\r\n\r\nSteer the future of your colony with a mix of technological advances and social development. Will you create an environmental paradise or a perfect military order?\r\n\r\nMultiple Paths to Victory\r\n\r\nAchieve your end goals through conquest, diplomacy or doomsday technologies.\r\n\r\nA Multitude of Game Modes\r\n\r\nA deep single-player story campaign alongside random map generation makes for endless replayability. Try new play styles in skirmish mode, and play multiplayer your way - online, hotseat, and asynchronous!",
  "banner_url": "/games/banner/age-of-wonders-planetfall.jpg",
  "icon_url": "/games/icon/age-of-wonders-planetfall.png",
  "is_public": true,
  "updated": "2019-06-13T16:11:44.028250Z",
  "steamid": 718850,
  "gogslug": "age_of_wonders_planetfall",
  "humblestoreid": ""
}