{
  "name": "Jinxter (Revived)",
  "slug": "jinxter-revived",
  "year": 2019,
  "platforms": [
    {
      "name": "Linux"
    },
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Adventure"
    }
  ],
  "aliases": [],
  "description": "Magnetic Scrolls classic masterpiece revived and enhanced for 2019.\r\n\r\nEvery silver lining has a cloud...\r\n\r\nJUST WHEN YOU THINK YOUR LUCK IS RUNNING OUT...\r\n\r\n... things start getting even worse. You get run over by a bus. Sprayed with cheese sandwich by a supernatural being. Smashed against a tunnel by a speeding train. Fall from two thousand feet into an artificial waterfall. You get drunk, drowned and cursed, incinerated, widdled on, folded, bent, spindled, mutilated and generally mucked about with.\r\n\r\nAnd in return? In return you get the leading role in a perplexing, hilarious race against time and chance, set in a jinxed land menaced by the impending death of good fortune.\r\n\r\nWho are we talking about? Who is reading this page? You guessed it. Look on the bright side. It could be your luckiest move yet. \r\n\r\nJinxter comes from Magnetic Scrolls, authors of international award-winning adventures The Pawn and The Guild of Thieves. \r\n\r\nIt's more than a collection of crossword puzzles; it's a whole universe, where things behave as they do in the real world... with some alarming exceptions. Don't expect tiresome trolls, obvious orcs, silly spells and wet, wimpish witches in JINXTER. Infuriating, enchanting, absurd and hilarious by turns, Jinxter will surprise you with every move you make.\r\n\r\nBut don't forget: every lining has a cloud... JINXTER - Some People Have All The Luck.\r\n\r\nRevived and remastered, Jinxter is back in all its magic, but even more fun than ever. You think, you know Aquitania? You think, you know your witches? Prove yourself! On Android, iOS, Windows, macOS, Linux!",
  "banner_url": "/games/banner/jinxter-revived.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-10-22T22:06:49.039695Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}