{
  "name": "MechWarrior 4: Vengeance",
  "slug": "mechwarrior-4-vengeance",
  "year": 2000,
  "description": "RECLAIM YOUR BLOODRIGHT\r\n\r\nThe year is 3063. The clan invasion has ended. You return to your homeland a hero. Your family has been murdered, your throne seized, and now your planet is in the throes of civil war. it is time to reclaim what is yours. a 40-foot high, 80 ton, 90 mph BattleMech is your weapon. Assemble your lancemates, set your battle plan and command you MechWarroirs in a relentless campaign of retaliation. You will know vengeance. Your enemies will know terror.\r\n\r\nPRODUCT FEATURES \r\n-YOU ARE IN COMMAND:\r\nYou choose the 'Mechs, the weapons and the uniquely skilled lancemates to pilot them.\r\n\r\nINTERACTIVE ENVIRONMENTS:\r\n7 immense, futuristic environments - swamps, cityscapes, forests - each populated with thousands of full-3D objects.\r\n\r\nINTENSE FIREPOWER:\r\n21 light, medium, heavy and assault BattleMechs. Including 7 never before seen in the BattleTech Universe - plus over 50 devastating weapons to choose from.\r\n\r\nEXCITING MULTIPLAYER ACTION:\r\nFiece team and individual based multi-play for up to 16 MechWarriors. King of the Hill, Capture the Flag, Destruction and much more.\r\n\r\nEPIC SCOPE:\r\nYou are in the center of a 25 mission campaign where your every decision effects the fate of you, your lancemates, and the destiny of a planet.\r\n\r\n-7 huge environments with over 25 densely populated missions\r\n-control your destiny as you lead your elite forces into battle\r\n-amazing special effects bring combat to life\r\n-over 20 'Mechs with awesome firepower\r\n\r\nSYSTEM REQUIREMENTS:\r\nMICROSOFT WINDOWS 95, 98, ME OR 2000 / PROCESSOR : PENTIUM II 300 MHZ OR HIGHER / MEMORY : 64MB RAM / 3D CARD : DIRECTX 8.0 OR LATER COMPATIBLE WITH 8MB OF VRAM AND DIRECT3D SUPPORT / DIRECTX : 8.0 / CD-ROM DRIVE 8X SPEED / SOUND CARD : COMPATIBLE WITH DIRECTX 8.0 OR LATER WITH SPEAKERS OR HEADPHONES FOR AUDIO PLAYBACK / HARD DISK SPACE : 775 MB AVAILABLE / PERIPHERALS : MICROSOFT MOURSE OR COMPATIBLE / MODEM : 28,000 BITS-PER-SECOND (BPS) OR FASTER MODEM, OR LOCAL AREA NETWORK (LAN) WITH TCP/IP OR IPX PROTOCOL",
  "banner_url": "/games/banner/mechwarrior-4-vengeance.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-12-22T18:06:51.279468Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}