{
  "name": "Haven & Hearth",
  "slug": "haven-hearth",
  "year": 2009,
  "description": "Haven & Hearth is a MMORPG (Massive Multiplayer Online Roleplaying Game) set in a fictional world loosely inspired by Slavic and Germanic myth and legend. The game sets itself apart from other games in the genre in its aim to provide players with an interactive, affectable and mutable game world, which can be permanently and fundamentally changed and affected through actions undertaken by the players. Our fundamental goal with Haven & Hearth is to create a game in which player choices have permanent and/or lasting effects and, thus, providing said players with a meaningful and fun gaming experience.\r\n\r\nPlayers start the game surrounded by a vast and somewhat unforgiving wilderness, with only the most basic tools of survival at their disposal. The use of fire is a thematic focal point of the game's mythos, and an early and important task will be the simple lighting of one. As the first hearth fires disperse the darkness of the surrounding wilderness, more pressing questions will present themselves to the players: Who are they? Where are they? And, most importantly, where are they going? From this point on, players will have to blaze trails of their own into the unknown, the wilderness and the future, and explore and affect the world of Haven & Hearth using only their own best judgment and a chipped stone axe. Trust us, the stone axe is the shit.\r\n\r\nAs players progress, they will be able to acquire new skills and abilities, allowing them to perform a variety of tasks—such as the claiming of land, the construction of buildings and the cultivation of crops—each step forward making the basic task of survival somewhat easier. Having progressed far enough, players will, in time, be able to organize themselves into societies, from simple tribes and villages, progressing through republics, nation states and, ultimately, empires.\r\n\r\nAt least, those are our lofty ambitions.\r\n\r\n// The Seatribe team",
  "banner_url": "/games/banner/haven-hearth.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-06-16T20:35:43.334750Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 37300
}