{
  "name": "Evolution RTS",
  "slug": "evolution-rts",
  "year": 2014,
  "platforms": [
    {
      "name": "Linux"
    }
  ],
  "genres": [
    {
      "name": "Real-time strategy"
    }
  ],
  "aliases": [],
  "description": "Evolution RTS is a free an Open Source RTS game designed using the Spring Engine. It has been in development for many years and receives updates often. Its gameplay is designed specifically to appeal to gamers of all skill levels. The gameplay is designed around the use of unit groups, and the mixture of your unit group often will determine how successful you are in battle, as opposed to churning out hundreds of the same unit continually.\r\nThe economy and teching system is easy to learn and use. The game itself supplies many tools that make managing your economy easier so that you can focus more on crushing your enemy than of playing simcity in your base. Units interact using realistic physics and varied terrain (you can actually micro units in order to dodge projectiles!).\r\n\r\nBelow is a very short list of the features that Evolution RTS has to offer:\r\n\r\nRealistic Physics\r\nProjectiles and units use a realistic physics system which allow for unprecedented control and gameplay. Micro your units to avoid projectiles. Hide behind terrain for cover.\r\n\r\nEpic and Macro scales\r\nControl the battlefield and a level that feels the most comfortable to you, whether zoomed in controlling individual units, zoomed out viewing the entire map and issuing orders on a macro scale, or somewhere in between! You are in complete control!\r\n\r\nFine tuning controls for builders\r\nSet builders on repeat so that they repeat the orders you give infinitely until they die. Adjust builder priority in order to control the amount of resources allocated to that specific builder’s construction project.\r\n\r\nUnique Cover System allows you to easily set up ambushes\r\nHide your army in rocks and foilage completely undetected and lie in wait to ambush your enemy!\r\n\r\nGameplay geared towards casual gamers in addition to hardcore rts fans, as opposed to only being fun to play at the higher levels\r\nGameplay designed around being easy to learn yet hard to master. As a newbie you can be up and running in no time, and the gameplay ensures that just because you are new, you aren’t necessarily at a huge disadvantage.\r\n\r\nHundreds of units at once\r\nThe Spring Engine allows for hundreds or thousands of units to be beating the daylights out of each other all at once. Gameplay scales seamlessly to fit!\r\n\r\nUnique unit abilities\r\nDiscover units with special abilities, such as the ORB with it’s incredible area healing abilities, or the Overseer with it’s EMP ability!\r\n\r\nSimple Economy\r\nThe economy is designed to be easy to learn, and use. There are only two resources in the game; Energy and Metal. Energy is used for utility purposes such as unit ammunition, powering shields, and building nuclear missiles, whereas metal is used to construct structures and units. Metal income is split between allies and resources that overflow the player’s capacity automatically flow into allies banks.\r\n\r\nEasy to learn teching system\r\nSimple teching system that revolves around using the same buildings that supply energy as a means to increase your tech availability ensure seamless transitions into heavier unit technologies.\r\n\r\nBeautiful effects\r\nFull particle effects engine and beautiful effects painstakingly created down to the last detail ensure that every battle will be visually stunning!\r\n\r\nFull Soundtrack\r\nFull in-game soundtrack that highlights the mood based upon whether you are building structures in your base or engaged in an all out no holds barred war for survival will keep you on your toes and fuel your need for dominance! Over 40+ tracks!\r\n\r\nEasy battle formations\r\nEasy to use battle formations via selecting a group of units, right-clicking and dragging on the map make it easy for you to give complex orders to your units, even in the midst of a battle!\r\n\r\nIntelligent Unit Targeting AI\r\nUnits automatically target the best enemy units to attack on their own, leaving you to concentrate on formations, flanking, and commanding your army!\r\n\r\nGive orders via the mini-map\r\nFull unit orders can be given via the minimap, so you can control your units intuitively no matter where your camera is pointing.\r\n\r\nPlace map markers with or without labels, and draw directly on the map\r\nMap markers, drawing, and labels make it easy for you and your allies to communicate your battle plans, and illustrate them!\r\n\r\nUnit balance dependent on unit mixture instead of one unit owning an entire army all by itself\r\nUnit balance is designed so that composition matters more than simply churning out hordes of the most expensive unit.\r\n\r\nIntelligent builder AI\r\nBuilders have a plethora of tools and options available to use to help you with macro tasks so that you can focus on kicking robotic ass!\r\n\r\nCompletely customizeable GUI\r\nThe many parts of the in-game gui can easily be moved around, resized, and positioned exactly how you like it! Be your own boss!\r\n\r\nGorgeously detailed unit textures and designs",
  "banner_url": "/games/banner/evolution-rts.jpg",
  "icon_url": "/games/icon/evolution-rts.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:26.440738Z",
  "steamid": 291150,
  "gogslug": "",
  "humblestoreid": ""
}