{
  "name": "Ballistic Overkill",
  "slug": "ballistic-overkill",
  "year": 2017,
  "description": "Steam Silver Tier:\r\n'Top games that left Early Access in 2017 as measured by gross revenue'\r\n\r\nBallistic Overkill is a bombastic, brutal, and bullet-filled multiplayer shooter. It blends classic arena shooter action with modern FPS gunplay giving you a fast paced class based shooter that'll leave your opponents bloody on the battlefield. With a progression system that means your wins actually matter and a huge map pool with 4 varied game modes, there's something for every shooter. Whether you prefer chasing team objectives or the thrill of classic deathmatch, Ballistic Overkill has the gun and the mode for you.\r\n\r\nPick a class, choose your gun, and dive right in, Ballistic Overkill has no barrier between you and immediate run and gun action. Designed from the outset to be 'pick up and play', Ballistic Overkill is for you regardless of your level of FPS experience.\r\n\r\nClasses\r\nSelect one of 7 classes, each with their own style, weapons, and visuals. You get to play Ballistic Overkill the way YOU want to play it. Select from multiple loadouts with each class to tailor each character exactly the way you want to play. And remember there are no support classes, in Ballistic Overkill everyone is a killer!\r\n\r\nBerserker - deadly close combat rushdown expert\r\nVanguard - master of field survival and assault specialist\r\nWraith - infiltrator and ranged assassin\r\nShadow - master of speed and stealth assassinations\r\nGrenadier - bane of the campers and explosions maniac\r\nTank - towering machine-gun toting survival expert\r\nMarksman - perceptive and adaptable intelligence specialist\r\n\r\nMaps and game modes\r\nFrom parks, to malls, to abandoned hospitals and factories, Ballistic Overkill covers a wide variety of locations in its 10 maps. Each is filled with death, either your opponent's or if you're not ready…yours.\r\n\r\nAll maps feature multiple game modes to liven things up including:\r\nTeam Deathmatch\r\nFree for All\r\nCapture Point\r\nKing of the Hill\r\n\r\nSteam Marketplace and Unlockables\r\nWith over 80 weapons in game, there's always a new way to kill your enemies in Ballistic Overkill, and with droppable skins that you can trade and/or sell through the Steam Market you can now do this with style and flair. The game features Class based lockboxes and drop Seasons that will change every few months so players can seek out the best skins and unlockables across 5 different rarity types. These unlockables will be dropped in keyless lockboxes so nothing will prevent you from opening them and grabbing the amazing content inside.\r\n\r\nIt's insane, fast paced, and action packed in a way that's fun, and tactical.\" Spifferino, Steam User\r\n\r\nCan be enjoyed by both casual and competitive gamers.\" Skyrunes, Steam User\r\n\r\nI've really enjoyed playing this game through different versions to watch it evolve and once it's finished it's going to be a really fantastic game.\" Liamdawe, Gaming on Linux",
  "banner_url": "/games/banner/ballistic-overkill.jpg",
  "icon_url": "/games/icon/ballistic-overkill.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:31.091420Z",
  "steamid": 296300,
  "gogslug": "",
  "humblestoreid": ""
}