{
  "name": "Bloons TD6",
  "slug": "bloons-td6",
  "year": 2018,
  "description": "The Bloons are back and better than ever! Get ready for a massive 3D tower defense game designed to give you hours and hours of the best strategy gaming available.\r\n\r\nCraft your perfect defense from a combination of awesome monkey towers, upgrades, Heroes, and activated abilities, then pop every last Bloon that comes your way!\r\n\r\nALL NEW 3D BLOONS TD\r\n* Vibrant new monkey animations and upgrade skins\r\n* Intense visual effects\r\n* 37 original maps, some with 3D objects that can block line of sight\r\n\r\nEPIC MONKEY TOWER UPGRADES\r\n* 21 powerful monkey towers, including 2 all new monkeys - Druid and Alchemist!\r\n* 3 upgrade paths - all monkey towers now have 3 amazing paths to choose between\r\n* Tier 5 upgrades - top upgrades so powerful only one monkey can have them\r\n\r\nHEROES!\r\n* Each game, place one of these unique and powerful monkeys with 20 signature upgrades\r\n* Two bloon-shredding activated abilities per Hero\r\n* Craft new gameplay strategies around each Hero's powers and synergies\r\n\r\nDEEP MONKEY KNOWLEDGE SYSTEM\r\n* Over 100 meta-upgrades that buff individual monkey towers or monkey groups\r\n* Adds late game power so you can win more maps and reach higher freeplay rounds\r\nMORE AWESOMENESS\r\n* Play anywhere - single player offline works even when your wifi doesn't!\r\n* New Bloons - tricky new bloon types like Purple, Fortified, and the relentless B.A.D.\r\n* New game modes added to each game difficulty, like Restricted Monkeys, Double Health MOABs, and the brutal CHIMPS rules\r\n\r\nAnd there's heaps more! We packed as much content and polish into this game as possible, and we'll continue to add new features, content, and challenges in regular updates. We truly respect your time and support, and we hope Bloons TD 6 will be the best strategy game you've ever played.\r\nNow those bloons aren't going to pop themselves... sharpen your darts and go play Bloons TD 6!",
  "banner_url": "/games/banner/bloons-td6.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2020-01-01T06:51:52.450732Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}