{
  "name": "E.Y.E: Divine Cybermancy",
  "slug": "eye-divine-cybermancy",
  "year": 2011,
  "platforms": [
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "FPS"
    },
    {
      "name": "RPG"
    }
  ],
  "aliases": [],
  "description": "As a member of the strange secret society E.Y.E, you wake up after a fight in which your fellow teammates were killed. E.Y.E, an armed branch of the Secreta Secretorum is attempting a coup against the all-powerful Federation, a coalition of several worlds and planets that rule with an iron fist.\r\nTo complicate matters, E.Y.E itself is plagued with its own internal conflicts between the Jian faction and the Culter faction, to which you belong. Your loyalties are torn between Commander Rimanah, your superior and the chief of the Secreta who is a separatist with an unstoppable ambition, and the \"Mentor\" your friend and instructor. The \"Mentor\" tries at all costs to unite the two rival factions. In doing so, you are thrust into the middle of a fratricidal war frought with political conspiracies and quests for power in which different groups and megacorporations are implicated.\r\nThese troubles set the stage for an attack by an unknown force bent on destroying humankind.\r\nKey features:\r\n\r\n*    Multiplayer co-op modes directly influence solo play, and vice-versa. The limits of solo and multiplayer games are finally left behind.\r\n*    Psychological and mental trauma management.\r\n*    25 weapons, different shooting modes, dynamic precision, drilling shots, iron sighting, extended zoom.\r\n*    Complete hacking system with game play impact\r\n*    9 devastatingly subtle PSI powers.\r\n*    More than 20 NPC with non-scripted, fully reactive and efficient AI, endowed with a sense of initiative. Bloody close combat with technical detail. Incredible physical movement realism thanks to Source Engine physics.\r\n*    Excellent replayability - primary and secondary missions, dynamic environments, non-linear level progression, and random NPC spawn, type and appearance. Death doesn't penalize players: no need to restart the current mission.\r\n*    Open-level gameplay for hours of fun without reloading. ",
  "banner_url": "/games/banner/eye-divine-cybermancy.jpg",
  "icon_url": "/games/icon/eye-divine-cybermancy.png",
  "is_public": true,
  "updated": "2019-01-23T08:29:27.041449Z",
  "steamid": 91700,
  "gogslug": "",
  "humblestoreid": ""
}