{
  "name": "Metal Slug 7",
  "slug": "metal-slug-7",
  "year": 2008,
  "description": "Metal Slug 7 (メタルスラッグ 7) is a run and gun video game developed by SNK Playmore for the Nintendo DS. It is the eighth title in the main Metal Slug series. It was announced in the September 2007 issue of Famitsu and marks the first game in the main series that would be released without an arcade version. The game was released in Japan on July 22, 2008 and North America on November 28, 2008 by Ignition Entertainment.\r\n\r\nA revised version of the game, titled Metal Slug XX (メタルスラッグ XX), was released on December 23, 2009 in Japan and North America on February 23, 2010 by Atlus for the PlayStation Portable. This version of the game features additional content, including co-op multiplayer and downloadable content. Metal Slug XX was also released on Xbox Live Arcade on May 19, 2010 and was made backwards compatible on Xbox One in 2015.[2]\r\n\r\nThe Peregrine Falcon Strike Force, the SPARROWS, and the Ikari Warriors are once again on a search for General Morden and his army, this time on a giant island landfill that has been converted into a military fortress, in order to stop his latest coup d'état. After having his newest prototype weapon crushed by the heroes, Morden receives unexpected help when a time portal opens up and high-tech soldiers from the future appear to pledge their support. With their advanced technology, Morden is able to further fortify his base, but the heroes push forward despite the incredible odds\r\n\r\nAt the very end, the heroes are able to destroy the time portal and cut off the Rebel Army's suppliers. Morden escapes in his rebuilt prototype weapon, now completed and more powerful than before, and confronts them on a giant lake of molten lava. After a long and arduous battle, Morden is defeated and his weapon begins to sink into the lava. The heroes capture Morden and escape via helicopter, but he escapes when the Martians attack the helicopter. The final scene shows the heroes chasing Morden and his men off into the sunset.",
  "banner_url": "/games/banner/metal-slug-7.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:22.211353Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}