{
  "name": "Command & Conquer",
  "slug": "command-conquer",
  "year": 1995,
  "platforms": [
    {
      "name": "MS-DOS"
    },
    {
      "name": "Nintendo 64"
    },
    {
      "name": "Sega Saturn"
    },
    {
      "name": "Sony PlayStation"
    },
    {
      "name": "Windows"
    }
  ],
  "genres": [
    {
      "name": "Real-time strategy"
    }
  ],
  "aliases": [],
  "description": "\"Command & Conquer is an interactive strategy game like no other. Unlike traditional \"strategy\" games, Command & Conquer offers real-time combat. The emphasis isn't on turn taking or solving tactical problems like fuel, food, and bullets, but on real-time thrills, spills, and kills.\r\n\r\nThose old-time Westwood followers might recognize that Command & Conquer is based on the same game engine as Dune II: The Building of a Dynasty (on IBM and Amiga) and Dune: The Battle for Arrakis (on Sega Genesis). Undoubtedly, game play in Command & Conquer shares the same elements of addictive fun as its predecessors: balancing realtime combat along with city/base-building simulation, along with the race to gather precious resources to finance the player's combat and building efforts. But while the game play balance was preserved, Command & Conquer's Artificial intelligence has been greatly enhanced to take advantage of the player's strategies and weaknesses. Rarely will the computer make the same mistake twice. You can expect to see sneak attacks, advanced patrols, and entire convoys striking at multiple weak points at once. In Command & Conquer, the outcome of battle is not determined by your adversary's weaknesses, but by your own.\r\n\r\nIn Command & Conquer, you must first choose who you fight for. Does your allegiance go to The evil Brotherhood of Nod, a terrorist faction bent on world dominance? Or, do you choose to fight for the good of all, and support the United Nations Global Defense Initiative (GDI)? With Command & Conquer, you can expect twice as much game play, without the feeling you're playing the same game over and over.\r\n\r\nAdded to the addictive fun of the game's play are the animated cinematic sequences. Employing the latest cutting-edge graphics techniques, the Westwood staff artists working on Command & Conquer combined the use of rendered and digitized full-motion video. Set to a script written by professional screenwriters, these animated sequences set the game play in an exciting story that places you right in the middle of the action.\r\n\r\nAnd because you asked for it, Command & Conquer will allow you to go head-to-head against other commanders in specially designed missions over a modem (2 player) or network (4 player)! As most of us know, nothing feels better than blasting your friends into dust, then gloating in triumph afterward. All of this, combined with the ability to play good or evil, modem or network, Human or Computer AI makes Westwood's Command & Conquer a game with tons of replay value.\r\n\r\nSome of Command & Conquer's cool features include....\r\n\r\n* A wide range of missions with varied objectives and sometimes multiple goals.\r\n\r\n* The stark horror of conflict is punctuated by over 40 minutes of vividly rendered cinematic presentation comprising news footage, commercials, mission briefings and cut-scene rewards.\r\n\r\n* Large, mean-looking, detailed hardware to wreak havoc with including VTOL Orca Fighter Craft, Raptor Attack Cycles, Devil's Tongue incinerator tanks, Air Cushioned All Terrain Landing Craft and the Mammoth Heavy Battle Tanks (to name just a few).\r\n\r\n* Modem and network play make this game of world dominance a truly global affair.\r\n\r\n* A delicious, heavy-duty soundtrack featuring digitized speech and musical styles including Cyberpunk, rap, hip-hop, house and eerie atmospherics.\"",
  "banner_url": "/games/banner/command-conquer.jpg",
  "icon_url": "/games/icon/command-conquer.png",
  "is_public": true,
  "updated": "2019-02-07T18:00:57.442262Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}