{
  "name": "Left 4 Dead 2",
  "slug": "left-4-dead-2",
  "year": 2009,
  "description": "This co-operative action horror FPS takes you and your friends through the cities, swamps and cemeteries of the Deep South, from Savannah to New Orleans across five expansive campaigns.\r\nYou'll play as one of four new survivors armed with a wide and devastating array of classic and upgraded weapons. In addition to firearms, you'll also get a chance to take out some aggression on infected with a variety of carnage-creating melee weapons, from chainsaws to axes and even the deadly frying pan.\r\nYou'll be putting these weapons to the test against (or playing as in Versus) three horrific and formidable new Special Infected. You'll also encounter five new uncommon common infected, including the terrifying Mudmen.\r\nHelping to take L4D's frantic, action-packed gameplay to the next level is AI Director 2.0. This improved Director has the ability to procedurally change the weather you'll fight through and the pathways you'll take, in addition to tailoring the enemy population, effects, and sounds to match your performance. L4D2 promises a satisfying and uniquely challenging experience every time the game is played, custom-fitted to your style of play.\r\n\r\n*    Next generation co-op action gaming from the makers of Half-Life, Portal, Team Fortress and Counter-Strike.\r\n*    Over 20 new weapons & items headlined by over 10 melee weapons – axe, chainsaw, frying pan, baseball bat – allow you to get up close with the zombies\r\n*    New survivors. New Story. New dialogue.\r\n*    Five expansive campaigns for co-operative, Versus and Survival game modes.\r\n*    An all new multiplayer mode.\r\n*    Uncommon common infected. Each of the five new campaigns contains at least one new uncommon common zombies which are exclusive to that campaign.\r\n*    AI Director 2.0: Advanced technology dubbed The AI Director drove L4D's unique gameplay – customizing enemy population, effects, and music, based upon the players’ performance. L4D 2 features The AI Director 2.0 which expands the Director’s ability to customize level layout, world objects, weather, and lighting to reflect different times of day.\r\n*    Stats, rankings, and awards system drives collaborative play ",
  "banner_url": "/games/banner/left-4-dead-2.jpg",
  "icon_url": "/games/icon/left-4-dead-2.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:08.802764Z",
  "steamid": 550,
  "gogslug": "",
  "humblestoreid": ""
}