{
  "name": "Colobot",
  "slug": "colobot",
  "year": 2018,
  "platforms": [
    {
      "name": "Linux"
    }
  ],
  "genres": [
    {
      "name": "City building"
    },
    {
      "name": "Construction"
    },
    {
      "name": "Puzzle"
    },
    {
      "name": "Real-time strategy"
    },
    {
      "name": "Space simulation"
    }
  ],
  "aliases": [],
  "description": "Home\r\nLearn more\r\n\r\nColobot is a real-time strategy game. In a way. But it isn’t…\r\n\r\nAnd this is what made the game special in our childhood, or maybe even early adulthood. Unlike most RTS games, Colobot does not require tactics, but it does require thinking. An another difference would be the fact, that we do not control the game from a ‘god’ camera, seeing everything from up top, but instead, we are actually controlling each unit we make, or find. This could potentially cause the problem, of not being able to control 2 units at once, yet this is when an another twist comes in. Colobot actually has its own interpretation of robot programming, which is done fully by the player in a language called CBOT, together with a few hints and tips from the trusty SatCom system. The programmed robots function at a level similar to the brutality of writing an actual program, which does mean it requires the right amount of accuracy, with the right mix of imagination.\r\n\r\nBut then, you can play the game without programming the robots if you want. This is all up to you!\r\n\r\nThe game has received endorsements and awards for its educational capabilities, in teaching teenagers the basics of algorithms and commands similar to C++ and Java. After a valiant effort of the Polish Community, EPSITEC has provided the source code on a GNU GPLv3 License, and allowed the community to use the title “Colobot” in their upcoming projects.\r\n\r\nWelcome to Terra Nova, and Colonise with Bots!",
  "banner_url": "/games/banner/colobot.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:28:55.722874Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}