{
  "name": "Amber's Magic Shop",
  "slug": "ambers-magic-shop",
  "year": 2017,
  "description": "Amber, a dark elf, was abandoned as baby in the woods south of Icesilia. She was found and raised by Vin, a witch, who decided she should become an alchemist. When Amber turned sixteen, Vin sent her to Icesilia as apprentice to the legendary mage Haros.\r\n\r\nIn the big town of Icesilia, she'll train and once she reachs adult age, become a master alchemist running her own shop, and along the way also meet interesting characters who might become something more than just friends:\r\n\r\nDaniel, Haros' son, who wants to be a mage like his father but also trains in alchemy. In competition with Amber since young age, he'll need to be careful to not be consumed by his pride.\r\nBernard, a brave young man who wants to become a famous adventurer. Paranoid and ill-tempered, he'll need to learn to control himself to avoid doing things he might regret.\r\nLair, the son of the influent noble elf Arnor. Naïve but with good heart, suffers the bad influence of his arrogant father Arnor.\r\nRuby, a seductive young woman who turned vampire just recently, struggling to not lose the humanity still left in her.\r\nCosa and Anders, two mysterious silver-haired adventurers who will ask Amber's help, and might reveal themselves to be something more than they look.\r\nLynn, a cute elf who runs the herbalist shop with her mother. A marriage with a noble has been arranged for her, but she's not sure if she really wants it.\r\n\r\nThe game can be played as a dating sim and offers an optional crafting/simulation game. Each choice will change Amber's (and her friends/love interests) alignment: there's Dark and Light. But be careful: dark and light doesn't mean wrong or right. There are no right or wrong choices in this game, though some endings are more sad and cruel than others!\r\n\r\nThe game features 4 different endings for each love interest, with some dark events/scenes never seen before in a Winterwolves' game. Play the game at your own risk! Unlock all the endings of a specific character to discover bonus pin-up images.",
  "banner_url": "/games/banner/ambers-magic-shop.jpg",
  "icon_url": "/games/icon/ambers-magic-shop.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:20.500928Z",
  "provider_games": [],
  "steamid": 584940,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 23039
}