{
  "name": "Darklands",
  "slug": "darklands",
  "year": 1992,
  "description": "Deep in the twilight of the Black Forest, you and your companions crouch before the robber-knight's tower. Hans the alchemist places a mysterious potion by the heavy oak door. Ebhard the monk implores Saint Dunstan to bless your weapons and armour. Gretchen and you unsheathe your broadswords ready to jump into the fray.\r\n\r\nWith a thundering crash, the door explodes into fragments. You and your companions charge inside swinging swords and maces from side to side.\r\n\r\nGerhard the Red Wolf, the infamous robber knight, waits for you surrounded by his evil henchmen. They are ready with weapons drawn. Suddenly, Hans tosses a choking potion into their faces, they reel from the effect and in that precious moment you race into them. The lonely tower, set deep within the vast Black Forest, echoes with the sound of clashing steel.\r\n\r\nDarklands. The first realistic fantasy role-playing game. By leading a band of adventurers across the sinister lands of 15th century Germany you'll encounter the real Middle Ages steeped in fear, myth and legend. Travel hundreds of miles, visit over ninety cities and watch savage battles unfold before your eyes!\r\n\r\nYour quest, or series of quests, may take you through raucous city streets, down deep dank mine shafts or into witches' covens in search of fame and fortune. So prepare yourself for the wonders and mysteries of Darklands!\r\n\r\nKey features:\r\n* Improve each character's attributes and skills as the game progresses. No artificial character classes or levels!\r\n* Learn alchemical formulas to make your own potions!\r\n* Brilliant watercolour-style graphics bring to life the myths and mysteries of the Middle Ages!\r\n* Easy-to-use and innovative menu presents you with unprecedented role-playing options.\r\n* Characters fight in real-time animation! Freeze the action and give new orders to characters any time you wish!",
  "banner_url": "/games/banner/darklands.jpg",
  "icon_url": "/games/icon/darklands.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:38.913447Z",
  "steamid": 327930,
  "gogslug": "darklands",
  "humblestoreid": "",
  "id": 3441
}