{
  "name": "Myth II: Soulblighter",
  "slug": "myth-ii-soulblighter",
  "year": 1998,
  "description": "Destruction reigns supreme. Castle walls crumble under a barrage of Dwarven mortar fire. Flaming arrows rain down from battlements. Deadly sorceries rip through your ranks, scattering your bravest warriors.  Welcome to Myth II: Soulblighter, a strategy game set in a 3D world of dangerous alliances and ancient evil, where all beings tremble before the wrath of Soulblighter, cruelest and most cunning of the evil Fallen Lords\r\n\r\nSeize the Walls and Wreak Havoc from Above:\r\nDestroy bridges and storm enemy fortifications. Seize the drawbridge before the guards can raise it. In Myth II: Soulblighter immense 3D structures are an integral part of the environment. Use them to your advantage, or die.\r\n\r\nSet Off Explosions that Send Limbs Flying:\r\nMyth II: Soulblighter is the only strategy game with real-world physics. Launch arrows in deadly arcs over obstacles. Set off earth-rippling 3D explosions that send heads rolling. Use Dwarven mortars to blast through enemy walls and fortifications.\r\n\r\nControl the High Ground:\r\nSeize the high ground so your archers can shoot farther. These spectacular 3D landscapes aren't just for show. The difference in elevation can mean the difference between life and death.\r\n\r\nInvade Enemy Strongholds:\r\nStorm the castle... and take it. Travel through scorching deserts, snowy mountains, and deadly swamps. Fight your way down echoing castle corridors and through dangerous catacombs.\r\n\r\nCreate Your Own Campaigns:\r\nDesign and share your own levels, from battlefields to entire worlds. With the included campaign editors, Fear and Loathing, you can create 3D maps, objects, sounds, artifacts, even units.\r\n\r\nFeatures:\r\n* Control your troops with ease using a powerful and intuitive new interface\r\n* Choose from 10 customizable formations - how you arrange your men can mean life or death\r\n* Beware the hazards of real weather. Rain extinguishes fires and snow reveals tracks.\r\n* Challenge a sophisticated AI that strives to outthink you, outmaneuver you, and crush you\r\n* Torch the grass beneath your foe or set the ground ablaze to strategically block a pass\r\n* Wield a new magic system where spell casters have multiple spells and replenishing mana\r\n* Smash your enemy with dozens of new units, all with multiple attacks and smoother animations\r\n* See your troops from every angle and zoom in on the 3D combat\r\n* Endless Multiplayer Carnage\r\n* Play cooperatively or go head to head with up to 16 players per game via TCP/IP or community server.\r\n* Test your skill on dozens of net-only maps and net-specific games like Assassin and Last Man on the Hill",
  "banner_url": "/games/banner/myth-ii-soulblighter.jpg",
  "icon_url": "/games/icon/myth-ii-soulblighter.png",
  "is_public": true,
  "updated": "2019-01-23T08:30:29.276036Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 2058
}