{
  "name": "Jones in the Fast Lane",
  "slug": "jones-in-the-fast-lane",
  "year": 1991,
  "description": "Back of Box - DOS (US):\r\n\"Jones is driven by player-customized goals, a dynamic economic system, and logical decision-making.\"\r\n\r\n-Computer Gaming World\r\n\r\nAchieve your Ambitions - Balance a Budget - Collect Compensation - Demonstrate Determination - Establish Enterprises - Fabricate a Fortune - Get a Grip - Halt Hardships - Increase your Independence - Jump for Joy - Know your Knack - Learn a Lesson - Minimize Misfortune - Note Necessities - Optimize Opportunities - Participate in Pastimes\r\nWho Says You Can't Win the Rat Race?\r\n\r\nReach for Your Goals\r\nIt's a board game, it's a computer game, it's unlike any game you've ever played! It's Sierra's newest game of real life — Jones in the Fast Lane. You and any combination of 1 to 3 human and computer players (up to 4 players) vie to be the first to accomplish their goals of money, happiness, education and career.\r\n\r\nManage Your Affairs\r\nWhile you're trying to keep pace with Jones, you'll improve your education, gel a better job, pay bills, buy necessities, invest your money, get mugged — even win the lottery. You never know whether you'll be riding high on blue chip stock dividends, or pawning your socks down at the Friendly Loan Company.\r\n\r\nWinner Take All\r\nIt's a game of ambition, motivation and competition for the whole family — with fulfillment, success and satisfaction as the prize. Real life can be fun for everyone when you're Jones in the Fast Lane.\r\nFEATURES\r\nNo-typing 'point-and-click' interface\r\nBeautifully detailed 'Game Board\" environment with multiple action windows\r\nDigitized animations of live actors play all the parts\r\nPlay with up to three friends, or up to three computer opponents\r\nGet a job, go to school, pay your bills — and have fun, too",
  "banner_url": "/games/banner/jones-in-the-fast-lane.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:01.049041Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 6579
}