{
  "name": "Myth III: The Wolf Age",
  "slug": "myth-iii-the-wolf-age",
  "year": 2001,
  "description": "Myth III: The Wolf Age is a 2001 real-time tactics video game developed by MumboJumbo and co-published by Take-Two Interactive and Gathering of Developers for Microsoft Windows and by Take-Two and MacSoft for Mac OS. The Wolf Age is the third game in the Myth series, following 1997's Myth: The Fallen Lords and 1998's Myth II: Soulblighter, both of which were developed by Bungie. In 1999, Take-Two purchased 19.9% of Bungie's shares, but when Microsoft bought Bungie outright in 2000, the rights for Oni and the Myth series were transferred to Take-Two, who hired the startup company MumboJumbo to develop Myth III.\r\n\r\nThe Wolf Age is a prequel to the two previous games, and is set one-thousand years prior to the events depicted in The Fallen Lords. It tells the story of Connacht's attempts to rid the land of the flesh eating monsters known as the Myrkridia, and defeat the immortal evil spirit \"The Leveler\", who has inhabited the body of the hero who defeated him in a previous age, Tireces. Now known as Moagim, The Leveler is determined to wipe out humanity. The plot of the game serves as an origin story for many of the main antagonists from The Fallen Lords and Soulblighter, and depicts the original forms and relationships of characters such as Balor, Soulblighter, Shiver, The Deceiver, The Watcher, and \"The Head\".\r\n\r\nThe game received generally positive reviews, although it was considered inferior to the two previous games. Critics praised the storyline, graphics, single-player campaign and general gameplay. Major points of criticism included the many bugs in the Windows version, awkward controls, and a poor online multiplayer mode. Many critics felt the game was rushed to release, with several speculating that MumboJumbo had not been given enough time to complete it satisfactorily. Shortly after the game was released, the entire development team was let go by MumboJumbo, and no further technical support or patches were provided by either MumboJumbo or Take-Two.\r\n\r\nThe Myth series as a whole, and Soulblighter in particular, supported an active online community for over a decade after the official servers went offline. The first formally organized group of volunteer-programmers was MythDevelopers, who were granted access to the game's source code by Take-Two. MythDevelopers initially formed with the purpose of fixing the bug-ridden Windows version of The Wolf Age when it became apparent there would be no official support for the game. The most recently active Myth development group is Project Magma, an offshoot of MythDevelopers. These groups have worked to provide ongoing support for the games, update them to newer operating systems, fix bugs, release unofficial patches, create mods, and maintain online servers for multiplayer gaming.",
  "banner_url": "/games/banner/myth-iii-the-wolf-age.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-01-23T08:30:29.267741Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 24598
}