{
  "name": "Final Fantasy II",
  "slug": "final-fantasy-ii",
  "year": 1988,
  "description": "The Paramekian Empire decided to take over the world. Its soldiers and Dark Knights persecute innocent people, burn whole villages, hunt down brave warriors. Now Phin, the homeland of the four heroes, has been destroyed by the evil empire. Only four young warriors could escape, three men and one girl. On their way to a neighbour town Altea, they were attacked by the Dark Knights. Three of them were brought safely to Altea by the order of the rebel army. But one has not yet been found...\r\n\r\nFinal Fantasy II (not to be confused with Final Fantasy IV, released in the West as \"Final Fantasy II\"), like its predecessor, is a top-down role-playing game where the player-controlled party travels through the overworld, fighting enemies, buying weapons, armor and magic spells in shops, and resting in town inns. Combat is round-based: the player selects commands for the whole party, and then watches the combat round unfold. \r\n\r\nThe game has an unusual character-building system. The three main controllable characters and a few others who may join the party can be fully customized by the player, without restrictions of classes or abilities. There are no character levels in the game: characters grow stronger by performing the same action repeatedly, which might increase one parameter but decrease another. For example, sustaining damage gradually increases the character's hit points; casting spells raises intelligence but lowers physical power, etc.\r\n\r\nWeapons and spells, on the other hand, can be leveled up. The more a certain type of weapon is used in combat, the more proficient the character who uses this weapon becomes in this particular type. The power of a magic spell also gradually increases when used repeatedly in battles.",
  "banner_url": "/games/banner/final-fantasy-ii.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2019-06-23T20:38:27.448341Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 13790
}