{
  "name": "GeForce NOW",
  "slug": "geforce-now",
  "year": 2015,
  "description": "Cloud gaming service:\r\n\r\nGeForce Now is a brand used by three cloud gaming services offered by Nvidia. The Nvidia Shield version of GeForce Now, formerly known as Nvidia GRID, launched in beta in 2013, with Nvidia officially unveiling its name on September 30, 2015. The service is a subscription-based offering that allows users unlimited access to a library of games hosted on Nvidia servers for the life of the subscription, delivered to subscribers through streaming video. Certain titles are also available via a \"Buy & Play\" model. The service is available exclusively on the company's Shield Portable, Shield Tablet, and Shield Console devices.[1][2]\r\n\r\nIn January 2017, Nvidia unveiled a separate cloud gaming service for PC and Macintosh computers also branded as GeForce Now. It is a remote desktop provider in which users can rent access to a virtual computer, where they can install their existing PC games from existing digital distribution platforms, and play them remotely. As with the Shield version, the virtual desktop is streamed from Nvidia servers. \r\n\r\nGeForce Now consists of a network of servers based in data centers in North America, and Europe that host and serve the GeForce Now game library to members in those regions.[3] The servers utilize Nvidia Tesla graphics cards, and can stream games at up to 1080p resolution at 60 frames per second. Nvidia recommended a 50 Mbps internet connection for the 1080/60p stream, but the service can also stream at 720p/60p for 25 Mbps connections, 720/30p frames per second for connections higher than 10 Mbps, and use Adaptive bitrate streaming to scale the quality based on bandwidth.[4][5] The server-side hardware will be upgraded over time to improve the quality of the streams.[1][6]",
  "banner_url": "/games/banner/geforce-now.jpg",
  "icon_url": "",
  "is_public": true,
  "updated": "2020-08-16T20:20:40.478832Z",
  "provider_games": [],
  "steamid": null,
  "gogid": null,
  "gogslug": "",
  "humblestoreid": "",
  "id": 23560
}