{
  "name": "Coffin Dodgers",
  "slug": "coffin-dodgers",
  "year": 2015,
  "description": "Coffin Dodgers sees you take on the role of saving one of seven quirky retirement village residents, each racing for their soul in \"pimped up\" mobility scooters against none other than the Grim Reaper himself. Our old heroes are armed with a variety of homemade weapons and gadgets to take on anything the Grim Reaper and his Zombie army may throw at them. Can you survive the retirement village?\r\n\r\nPlayers must battle it out against The Grim Reaper and other competitors over a 13 race Championship, where only the most skilled racer will survive. There are 4 distinct areas within the Sunny Pines Retirement Community, each featuring it's own mini tournament in which your rank against other competitors will ensure you progress to the next stage; however finish bottom of the pile and the Reaper gets to take your soul. The final race takes place over each of the 4 areas in a straight shoot out between you and the Grim Reaper.\r\n\r\nAs the game progresses the game environment becomes more and more apocalyptic as Grim's shadow slowly engulfs Sunny Pines. Look out for Grim's retinue of fiendish friends as they try and halt your progress.\r\n\r\nKey Features:\r\n• Race & Battle the Grim Reaper and his army of zombies. \r\n• Save one of the 7 quirky retirement village residents\r\n• Customise and modify your mobility scooter\r\n• Player to player combat & rag doll physics\r\n• 3D open world game environment \r\n• 13 unique race tracks\r\n• Single player Story and Time Trail modes\r\n• Online Multiplayer race mode\r\n• 3D Open world single & online multiplayer game modes\r\n• Local multiplayer versus race mode (2-4 players)\r\n• Full controller & keyboard support\r\n• Steam Trading Cards and Achievements\r\n\r\nWelcome to a suburban retirement village where all is not as it seems… \r\n\r\nAfter settling down to recover from the responsibilities of working life, the residents of Sunny Pines have been idling away the days, life could not be more tranquil. \r\n\r\nHowever, a creepy new resident, Mr Grim Reaper, looks set to turn retirement on its head. After years trawling the earth for souls to harvest, Mr Grim Reaper concludes Sunny Pines is where he’ll lay his hat, where he can harvest souls from the comfort of his rocking chair. However, seven of the sprightliest senior citizens have other ideas and set out to prove that life for Grim in Sunny Pines definitely won't be like shooting fish in a barrel.\r\n\r\nThe stately seven decide to strike a deal with the Grim Reaper; a mobility scooter racing championship to the death. If they can prove themselves to be fast and full of life, surviving and ultimately winning the championship, then he will allow them to live. However, too slow and they will be condemned to the retirement village in the sky. \r\n\r\nWhat the Reaper doesn’t tell the folk of Sunny Pines is that once he takes your soul he can bring you back as one of his army of the living dead; mobility scooter racing zombies that are hell bent on making sure that nobody wins, by any means possible.",
  "banner_url": "/games/banner/coffin-dodgers.jpg",
  "icon_url": "/games/icon/coffin-dodgers.png",
  "is_public": true,
  "updated": "2019-01-23T08:28:55.432300Z",
  "steamid": 320540,
  "gogslug": "",
  "humblestoreid": "coffin-dodgers",
  "id": 4162
}