{
  "name": "Mega Man Zero Collection",
  "slug": "mega-man-zero-collection",
  "year": 2010,
  "description": "Mega Man Zero Collection, released in Japan as Rockman Zero Collection (Japanese: ロックマンゼロコレクション Hepburn: Rokkuman Zero Korekushon), is a compilation of all four Mega Man Zero video games, which were originally released for the Game Boy Advance between 2002 and 2005. It was developed by Inti Creates and published by Capcom, and was made available worldwide in June 2010 for the Nintendo DS. The collection contains new features such as a beginner-friendly \"Easy Scenario\" that grants power-up items and abilities from the beginning of each game, as well as unlockable character art and the ability to display artwork on the Nintendo DS's bottom screen as the game is played.\r\nMega Man Zero Collection is a compilation of Mega Man Zero, Mega Man Zero 2, Mega Man Zero 3, and Mega Man Zero 4, a series of 2D action platformer games originally for the Game Boy Advance that emphasize dashing, jumping, and dispatching enemies with various weapons. The individual systems of each title are retained in the collection, with the addition of new features such as the ability to play through all games in order as one cohesive story. A new \"Easy Scenario\" mode decreases the overall difficulty of every title by granting many power-up items and abilities from the beginning, which saves the player from having to obtain them through normal means. Players may also map the game's controls to accommodate for the Nintendo DS's two extra buttons compared to the Game Boy Advance.\r\n\r\nPrimary gameplay takes place of the top screen of the Nintendo DS, while the extra bottom screen displays static artwork relevant to the portion of the game the player has reached. During a boss fight, for instance, concept artwork of the enemy will appear on the bottom screen throughout the battle. All art collected in this way becomes available for viewing in the game's Gallery menu. The original Game Boy Advance aspect ratio is preserved on the marginally larger Nintendo DS screens by placing a black border around the gameplay area in each title.",
  "banner_url": "/games/banner/mega-man-zero-collection.jpg",
  "icon_url": null,
  "is_public": true,
  "updated": "2019-01-23T08:30:21.194824Z",
  "steamid": null,
  "gogslug": "",
  "humblestoreid": ""
}