{
  "name": "Fallout",
  "slug": "fallout",
  "year": 1997,
  "description": "From the creators of Wasteland, comes a new breed of role-playing games:\r\n\r\nFallout: A Post Nuclear Role Playing Game\r\n\r\nSet in the aftermath of a world-wide nuclear war, Fallout will challenge you to survive in an unknown and dangerous world. You will take the role of a Vault-dweller, a person who has grown up in a secluded, underground survival Vault. Circumstances arise that force you to go Outside -- to a strange world 80 years after the end of the modern civilization. A world of mutants, radiation, gangs and violence.\r\n\r\nYour immediate task is to find a replacement for the broken water purification controller chip. Without that chip, your fellow Vault dwellers are doomed to dehydration or be forced to leave the safety of the Vault for the Outside.\r\n\r\nThe core of the game revolves around your character. When you start Fallout, you can choose or modify one of three pre-made characters, or create your own from scratch. The character creation system allows you to make a vibrant, unique character. We use a skill-based system to allow you to fine tune your character. \r\n\r\nAs you gain experience (roughly half from combat, the other half is from solving adventure seeds and non-combat based events), your character will grow as you determine. No classes here!\r\n\r\nCombat in Fallout is tactical turn-based. You can take as much time as you need to make decisions. Choose from different types of attacks, with a variety of weapons and attack skills. Weapons include: shotguns, flamers, chain-guns, rocket launchers, sledgehammers, brass knuckles and more.",
  "banner_url": "/games/banner/fallout.jpg",
  "icon_url": "/games/icon/fallout.png",
  "is_public": true,
  "updated": "2020-05-31T00:17:42.136177Z",
  "provider_games": [
    {
      "name": "Fallout",
      "slug": "1440148836",
      "service": "gog"
    }
  ],
  "steamid": 38400,
  "gogid": 1440166342,
  "gogslug": "fallout",
  "humblestoreid": "",
  "id": 381
}